ir_version: 8
producer_name: "onnx-genai tiny-tts-nested fixture"
graph {
  node {
    input: "inputs_embeds"
    output: "embeds_mean"
    name: "node_ReduceMean_0"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "embeds_mean"
    input: "one_f"
    output: "code_val"
    name: "node_Add_1"
    op_type: "Add"
  }
  node {
    input: "vocab_index"
    input: "code_val"
    output: "diff"
    name: "node_Sub_2"
    op_type: "Sub"
  }
  node {
    input: "diff"
    input: "diff"
    output: "diff_sq"
    name: "node_Mul_3"
    op_type: "Mul"
  }
  node {
    input: "diff_sq"
    output: "logits"
    name: "node_Neg_4"
    op_type: "Neg"
  }
  node {
    input: "inputs_embeds"
    output: "emb_shape"
    name: "node_Shape_5"
    op_type: "Shape"
  }
  node {
    output: "batch_index"
    name: "node_Constant_6"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        name: "batch_index_value"
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "sequence_index"
    name: "node_Constant_7"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        name: "sequence_index_value"
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "axes_zero"
    name: "node_Constant_8"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: "axes_zero_value"
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "emb_shape"
    input: "batch_index"
    output: "batch"
    name: "node_Gather_9"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "emb_shape"
    input: "sequence_index"
    output: "sequence"
    name: "node_Gather_10"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "batch"
    input: "axes_zero"
    output: "batch_vec"
    name: "node_Unsqueeze_11"
    op_type: "Unsqueeze"
  }
  node {
    input: "sequence"
    input: "axes_zero"
    output: "sequence_vec"
    name: "node_Unsqueeze_12"
    op_type: "Unsqueeze"
  }
  node {
    output: "one"
    name: "node_Constant_13"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: "one_value"
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "head"
    name: "node_Constant_14"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: "head_value"
        raw_data: "\004\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "hidden"
    name: "node_Constant_15"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: "hidden_value"
        raw_data: "\010\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "batch_vec"
    input: "sequence_vec"
    input: "hidden"
    output: "hidden_shape"
    name: "node_Concat_16"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "code_val"
    input: "hidden_shape"
    output: "code_embeds"
    name: "node_Expand_17"
    op_type: "Expand"
  }
  node {
    input: "batch_vec"
    input: "one"
    input: "sequence_vec"
    input: "head"
    output: "cache_shape"
    name: "node_Concat_18"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "cache_axis"
    name: "node_Constant_19"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: "cache_axis_value"
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "code_val"
    input: "cache_axis"
    output: "code_val_cache"
    name: "node_Unsqueeze_20"
    op_type: "Unsqueeze"
  }
  node {
    input: "code_val_cache"
    input: "cache_shape"
    output: "current_key"
    name: "node_Expand_21"
    op_type: "Expand"
  }
  node {
    input: "current_key"
    input: "value_offset"
    output: "current_value"
    name: "node_Add_22"
    op_type: "Add"
  }
  node {
    input: "past_key_values.0.key"
    input: "current_key"
    output: "present.0.key"
    name: "node_Concat_23"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 2
      type: INT
    }
  }
  node {
    input: "past_key_values.0.value"
    input: "current_value"
    output: "present.0.value"
    name: "node_Concat_24"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 2
      type: INT
    }
  }
  name: "tiny_tts_nested_code_predictor"
  initializer {
    data_type: 1
    name: "one_f"
    raw_data: "\000\000\200?"
  }
  initializer {
    dims: 1
    dims: 1
    dims: 16
    data_type: 1
    name: "vocab_index"
    raw_data: "\000\000\000\000\000\000\200?\000\000\000@\000\000@@\000\000\200@\000\000\240@\000\000\300@\000\000\340@\000\000\000A\000\000\020A\000\000 A\000\0000A\000\000@A\000\000PA\000\000`A\000\000pA"
  }
  initializer {
    data_type: 1
    name: "value_offset"
    raw_data: "\000\000\000?"
  }
  input {
    name: "inputs_embeds"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "sequence_len"
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  input {
    name: "past_key_values.0.key"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "past_sequence_len"
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "past_key_values.0.value"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "past_sequence_len"
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "logits"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "sequence_len"
          }
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  output {
    name: "code_embeds"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "sequence_len"
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  output {
    name: "present.0.key"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "total_sequence_len"
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "present.0.value"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "total_sequence_len"
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  value_info {
    name: "one_f"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
  value_info {
    name: "vocab_index"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  value_info {
    name: "value_offset"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 13
}
