{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[EOS]": 1,
      "c2": 2,
      "c3": 3,
      "c4": 4,
      "c5": 5,
      "c6": 6,
      "c7": 7,
      "c8": 8,
      "c9": 9,
      "c10": 10,
      "c11": 11,
      "c12": 12,
      "c13": 13,
      "c14": 14,
      "c15": 15
    },
    "unk_token": "[UNK]"
  }
}
