ir_version: 10
graph {
  node {
    input: "inputs_embeds"
    input: "axes_unsq"
    output: "embeds_hc"
    op_type: "Unsqueeze"
  }
  node {
    input: "hidden_states"
    input: "embeds_hc"
    output: "mtp_state"
    op_type: "Add"
  }
  node {
    input: "mtp_state"
    input: "axes_reduce"
    output: "mtp_hidden"
    op_type: "ReduceSum"
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  name: "tiny_hc_mtp"
  initializer {
    dims: 1
    data_type: 7
    int64_data: 2
    name: "axes_unsq"
  }
  initializer {
    dims: 1
    data_type: 7
    int64_data: 2
    name: "axes_reduce"
  }
  input {
    name: "inputs_embeds"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "hidden_states"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "mtp_hidden"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "mtp_state"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  value_info {
    name: "axes_unsq"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  value_info {
    name: "axes_reduce"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 18
}
