ir_version: 11
producer_name: "mobius"
producer_version: "0.1.0"
graph {
  node {
    input: "pre_fc_norm_embedding.weight"
    input: "const_1.0_f32"
    output: "v_pre_fc_norm_embedding.Add_0"
    name: "pre_fc_norm_embedding/Add_node_0"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/pre_fc_norm_embedding: OffsetRMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'OffsetRMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'pre_fc_norm_embedding\']"
    }
  }
  node {
    input: "inputs_embeds"
    input: "v_pre_fc_norm_embedding.Add_0"
    output: "v_pre_fc_norm_embedding.RMSNormalization_1"
    name: "pre_fc_norm_embedding/RMSNormalization_node_1"
    op_type: "RMSNormalization"
    attribute {
      name: "epsilon"
      f: 1e-06
      type: FLOAT
    }
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/pre_fc_norm_embedding: OffsetRMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'OffsetRMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'pre_fc_norm_embedding\']"
    }
  }
  node {
    input: "pre_fc_norm_hidden.weight"
    input: "const_1.0_f32"
    output: "v_pre_fc_norm_hidden.Add_2"
    name: "pre_fc_norm_hidden/Add_node_2"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/pre_fc_norm_hidden: OffsetRMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'OffsetRMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'pre_fc_norm_hidden\']"
    }
  }
  node {
    input: "hidden_states"
    input: "v_pre_fc_norm_hidden.Add_2"
    output: "v_pre_fc_norm_hidden.RMSNormalization_3"
    name: "pre_fc_norm_hidden/RMSNormalization_node_3"
    op_type: "RMSNormalization"
    attribute {
      name: "epsilon"
      f: 1e-06
      type: FLOAT
    }
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/pre_fc_norm_hidden: OffsetRMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'OffsetRMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'pre_fc_norm_hidden\']"
    }
  }
  node {
    input: "v_pre_fc_norm_embedding.RMSNormalization_1"
    input: "v_pre_fc_norm_hidden.RMSNormalization_3"
    output: "v_Concat_4"
    name: "Concat_node_4"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "v_Concat_4"
    input: "fc.weight_t"
    output: "v_fc.MatMul_6"
    name: "fc/MatMul_node_6"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/fc: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'fc\']"
    }
  }
  node {
    input: "rotary_emb.cos_cache"
    input: "position_ids"
    output: "v_rotary_emb.Gather_7"
    name: "rotary_emb/Gather_node_7"
    op_type: "Gather"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/rotary_emb: DefaultRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'DefaultRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'rotary_emb\']"
    }
  }
  node {
    input: "rotary_emb.sin_cache"
    input: "position_ids"
    output: "v_rotary_emb.Gather_8"
    name: "rotary_emb/Gather_node_8"
    op_type: "Gather"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/rotary_emb: DefaultRope"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'DefaultRope\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'rotary_emb\']"
    }
  }
  node {
    input: "attention_mask"
    input: "const_1_i64"
    output: "v_CumSum_9"
    name: "CumSum_node_9"
    op_type: "CumSum"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "v_CumSum_9"
    input: "const_1d_2"
    output: "v_Unsqueeze_10"
    name: "Unsqueeze_node_10"
    op_type: "Unsqueeze"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "inputs_embeds"
    output: "v_Shape_11"
    name: "Shape_node_11"
    op_type: "Shape"
    attribute {
      name: "end"
      i: 2
      type: INT
    }
    attribute {
      name: "start"
      i: 1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "attention_mask"
    output: "v_Shape_12"
    name: "Shape_node_12"
    op_type: "Shape"
    attribute {
      name: "end"
      i: 2
      type: INT
    }
    attribute {
      name: "start"
      i: 1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "v_Shape_12"
    input: "v_Shape_11"
    output: "v_Sub_13"
    name: "Sub_node_13"
    op_type: "Sub"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "v_CumSum_9"
    input: "v_Sub_13"
    input: "v_Shape_12"
    input: "const_1d_2"
    output: "v_Slice_14"
    name: "Slice_node_14"
    op_type: "Slice"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "v_Slice_14"
    input: "const_1d_3"
    output: "v_Unsqueeze_15"
    name: "Unsqueeze_node_15"
    op_type: "Unsqueeze"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "v_Unsqueeze_15"
    input: "v_Unsqueeze_10"
    output: "v_GreaterOrEqual_16"
    name: "GreaterOrEqual_node_16"
    op_type: "GreaterOrEqual"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "attention_mask"
    input: "const_1d_2"
    output: "v_Unsqueeze_17"
    name: "Unsqueeze_node_17"
    op_type: "Unsqueeze"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "v_Unsqueeze_17"
    output: "v_Cast_18"
    name: "Cast_node_18"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 9
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "v_Cast_18"
    input: "v_GreaterOrEqual_16"
    output: "v_And_19"
    name: "And_node_19"
    op_type: "And"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "v_And_19"
    input: "const_0.0_f32"
    input: "const_-3.4028234663852886e+38_f32"
    output: "v_Where_20"
    name: "Where_node_20"
    op_type: "Where"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "v_Where_20"
    input: "const_1d_2"
    output: "v_Unsqueeze_22"
    name: "Unsqueeze_node_22"
    op_type: "Unsqueeze"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "layers.0.input_layernorm.weight"
    input: "const_1.0_f32"
    output: "v_layers.0.input_layernorm.Add_23"
    name: "layers.0/input_layernorm/Add_node_23"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/input_layernorm: OffsetRMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'OffsetRMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'input_layernorm\']"
    }
  }
  node {
    input: "v_fc.MatMul_6"
    input: "v_layers.0.input_layernorm.Add_23"
    output: "v_layers.0.input_layernorm.RMSNormalization_24"
    name: "layers.0/input_layernorm/RMSNormalization_node_24"
    op_type: "RMSNormalization"
    attribute {
      name: "epsilon"
      f: 1e-06
      type: FLOAT
    }
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/input_layernorm: OffsetRMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'OffsetRMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'input_layernorm\']"
    }
  }
  node {
    input: "v_layers.0.input_layernorm.RMSNormalization_24"
    input: "layers.0.self_attn.q_proj.weight_t"
    output: "v_layers.0.self_attn.q_proj.MatMul_26"
    name: "layers.0/self_attn/q_proj/MatMul_node_26"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention/q_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\', \'q_proj\']"
    }
  }
  node {
    input: "v_layers.0.self_attn.q_proj.MatMul_26"
    input: "const_1d_6_layers.0/self_attn/Reshape_node_27_materialized"
    output: "v_layers.0.self_attn.Reshape_27"
    name: "layers.0/self_attn/Reshape_node_27"
    op_type: "Reshape"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\']"
    }
  }
  node {
    input: "v_layers.0.self_attn.Reshape_27"
    output: "v_layers.0.self_attn.Split_28_0"
    output: "v_layers.0.self_attn.Split_28_1"
    name: "layers.0/self_attn/Split_node_28"
    op_type: "Split"
    attribute {
      name: "num_outputs"
      i: 2
      type: INT
    }
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\']"
    }
  }
  node {
    input: "v_layers.0.self_attn.Split_28_1"
    input: "const_1d_7_layers.0/self_attn/Reshape_node_29_materialized"
    output: "v_layers.0.self_attn.Reshape_29"
    name: "layers.0/self_attn/Reshape_node_29"
    op_type: "Reshape"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\']"
    }
  }
  node {
    input: "v_layers.0.input_layernorm.RMSNormalization_24"
    input: "layers.0.self_attn.k_proj.weight_t"
    output: "v_layers.0.self_attn.k_proj.MatMul_31"
    name: "layers.0/self_attn/k_proj/MatMul_node_31"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention/k_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\', \'k_proj\']"
    }
  }
  node {
    input: "v_layers.0.input_layernorm.RMSNormalization_24"
    input: "layers.0.self_attn.v_proj.weight_t"
    output: "v_layers.0.self_attn.v_proj.MatMul_33"
    name: "layers.0/self_attn/v_proj/MatMul_node_33"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention/v_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\', \'v_proj\']"
    }
  }
  node {
    input: "v_layers.0.self_attn.k_proj.MatMul_31"
    input: "const_1d_8_layers.0/self_attn/Reshape_node_34_materialized"
    output: "v_layers.0.self_attn.Reshape_34"
    name: "layers.0/self_attn/Reshape_node_34"
    op_type: "Reshape"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\']"
    }
  }
  node {
    input: "layers.0.self_attn.q_norm.weight"
    input: "const_1.0_f32"
    output: "v_layers.0.self_attn.q_norm.Add_35"
    name: "layers.0/self_attn/q_norm/Add_node_35"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention/q_norm: OffsetRMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\', \'OffsetRMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\', \'q_norm\']"
    }
  }
  node {
    input: "v_layers.0.self_attn.Split_28_0"
    input: "v_layers.0.self_attn.q_norm.Add_35"
    output: "v_layers.0.self_attn.q_norm.RMSNormalization_36"
    name: "layers.0/self_attn/q_norm/RMSNormalization_node_36"
    op_type: "RMSNormalization"
    attribute {
      name: "epsilon"
      f: 1e-06
      type: FLOAT
    }
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention/q_norm: OffsetRMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\', \'OffsetRMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\', \'q_norm\']"
    }
  }
  node {
    input: "layers.0.self_attn.k_norm.weight"
    input: "const_1.0_f32"
    output: "v_layers.0.self_attn.k_norm.Add_37"
    name: "layers.0/self_attn/k_norm/Add_node_37"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention/k_norm: OffsetRMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\', \'OffsetRMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\', \'k_norm\']"
    }
  }
  node {
    input: "v_layers.0.self_attn.Reshape_34"
    input: "v_layers.0.self_attn.k_norm.Add_37"
    output: "v_layers.0.self_attn.k_norm.RMSNormalization_38"
    name: "layers.0/self_attn/k_norm/RMSNormalization_node_38"
    op_type: "RMSNormalization"
    attribute {
      name: "epsilon"
      f: 1e-06
      type: FLOAT
    }
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention/k_norm: OffsetRMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\', \'OffsetRMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\', \'k_norm\']"
    }
  }
  node {
    input: "v_layers.0.self_attn.q_norm.RMSNormalization_36"
    input: "const_1d_7_layers.0/self_attn/Reshape_node_39_materialized"
    output: "v_layers.0.self_attn.Reshape_39"
    name: "layers.0/self_attn/Reshape_node_39"
    op_type: "Reshape"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\']"
    }
  }
  node {
    input: "v_layers.0.self_attn.k_norm.RMSNormalization_38"
    input: "const_1d_7_layers.0/self_attn/Reshape_node_40_materialized"
    output: "v_layers.0.self_attn.Reshape_40"
    name: "layers.0/self_attn/Reshape_node_40"
    op_type: "Reshape"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\']"
    }
  }
  node {
    input: "v_layers.0.self_attn.Reshape_39"
    input: "v_rotary_emb.Gather_7"
    input: "v_rotary_emb.Gather_8"
    output: "v_layers.0.self_attn.RotaryEmbedding_41"
    name: "layers.0/self_attn/RotaryEmbedding_node_41"
    op_type: "RotaryEmbedding"
    attribute {
      name: "num_heads"
      i: 2
      type: INT
    }
    attribute {
      name: "rotary_embedding_dim"
      i: 4
      type: INT
    }
    attribute {
      name: "interleaved"
      i: 0
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\']"
    }
  }
  node {
    input: "v_layers.0.self_attn.Reshape_40"
    input: "v_rotary_emb.Gather_7"
    input: "v_rotary_emb.Gather_8"
    output: "v_layers.0.self_attn.RotaryEmbedding_42"
    name: "layers.0/self_attn/RotaryEmbedding_node_42"
    op_type: "RotaryEmbedding"
    attribute {
      name: "num_heads"
      i: 1
      type: INT
    }
    attribute {
      name: "rotary_embedding_dim"
      i: 4
      type: INT
    }
    attribute {
      name: "interleaved"
      i: 0
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\']"
    }
  }
  node {
    input: "v_layers.0.self_attn.RotaryEmbedding_41"
    input: "v_layers.0.self_attn.RotaryEmbedding_42"
    input: "v_layers.0.self_attn.v_proj.MatMul_33"
    input: "v_Unsqueeze_22"
    input: "past_key_values.0.key"
    input: "past_key_values.0.value"
    output: "v_layers.0.self_attn.Attention_43_0"
    output: "present.0.key"
    output: "present.0.value"
    name: "layers.0/self_attn/Attention_node_43"
    op_type: "Attention"
    attribute {
      name: "is_causal"
      i: 1
      type: INT
    }
    attribute {
      name: "kv_num_heads"
      i: 1
      type: INT
    }
    attribute {
      name: "q_num_heads"
      i: 2
      type: INT
    }
    attribute {
      name: "softcap"
      f: 0.0
      type: FLOAT
    }
    attribute {
      name: "scale"
      f: 0.35355338
      type: FLOAT
    }
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\']"
    }
  }
  node {
    input: "v_layers.0.self_attn.Reshape_29"
    output: "v_layers.0.self_attn.Sigmoid_44"
    name: "layers.0/self_attn/Sigmoid_node_44"
    op_type: "Sigmoid"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\']"
    }
  }
  node {
    input: "v_layers.0.self_attn.Attention_43_0"
    input: "v_layers.0.self_attn.Sigmoid_44"
    output: "v_layers.0.self_attn.Mul_45"
    name: "layers.0/self_attn/Mul_node_45"
    op_type: "Mul"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\']"
    }
  }
  node {
    input: "v_layers.0.self_attn.Mul_45"
    input: "layers.0.self_attn.o_proj.weight_t"
    output: "v_layers.0.self_attn.o_proj.MatMul_47"
    name: "layers.0/self_attn/o_proj/MatMul_node_47"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/self_attn: Qwen35Attention/o_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'Qwen35Attention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'self_attn\', \'o_proj\']"
    }
  }
  node {
    input: "layers.0.post_attention_layernorm.weight"
    input: "const_1.0_f32"
    output: "v_layers.0.post_attention_layernorm.Add_49"
    name: "layers.0/post_attention_layernorm/Add_node_49"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/post_attention_layernorm: OffsetRMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'OffsetRMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'post_attention_layernorm\']"
    }
  }
  node {
    input: "v_fc.MatMul_6"
    input: "v_layers.0.self_attn.o_proj.MatMul_47"
    input: "v_layers.0.post_attention_layernorm.Add_49"
    output: "v_layers.0.post_attention_layernorm.RMSNormalization_50"
    output: "val_0"
    output: "val_1"
    output: "val_2"
    name: "node_SkipSimplifiedLayerNormalization_1"
    op_type: "SkipSimplifiedLayerNormalization"
    attribute {
      name: "epsilon"
      f: 1e-06
      type: FLOAT
    }
    domain: "com.microsoft"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/post_attention_layernorm: OffsetRMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'OffsetRMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'post_attention_layernorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.rewriter.rule_name"
      value: "AddRMSNormToSkipNorm"
    }
  }
  node {
    input: "v_layers.0.post_attention_layernorm.RMSNormalization_50"
    input: "layers.0.mlp.gate_proj.weight_t"
    output: "v_layers.0.mlp.gate_proj.MatMul_52"
    name: "layers.0/mlp/gate_proj/MatMul_node_52"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/mlp: MLP/gate_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'MLP\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'mlp\', \'gate_proj\']"
    }
  }
  node {
    input: "v_layers.0.mlp.gate_proj.MatMul_52"
    output: "v_layers.0.mlp.Sigmoid_53"
    name: "layers.0/mlp/Sigmoid_node_53"
    op_type: "Sigmoid"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/mlp: MLP"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'MLP\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'mlp\']"
    }
  }
  node {
    input: "v_layers.0.mlp.gate_proj.MatMul_52"
    input: "v_layers.0.mlp.Sigmoid_53"
    output: "v_layers.0.mlp.Mul_54"
    name: "layers.0/mlp/Mul_node_54"
    op_type: "Mul"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/mlp: MLP"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'MLP\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'mlp\']"
    }
  }
  node {
    input: "v_layers.0.post_attention_layernorm.RMSNormalization_50"
    input: "layers.0.mlp.up_proj.weight_t"
    output: "v_layers.0.mlp.up_proj.MatMul_56"
    name: "layers.0/mlp/up_proj/MatMul_node_56"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/mlp: MLP/up_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'MLP\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'mlp\', \'up_proj\']"
    }
  }
  node {
    input: "v_layers.0.mlp.Mul_54"
    input: "v_layers.0.mlp.up_proj.MatMul_56"
    output: "v_layers.0.mlp.Mul_57"
    name: "layers.0/mlp/Mul_node_57"
    op_type: "Mul"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/mlp: MLP"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'MLP\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'mlp\']"
    }
  }
  node {
    input: "v_layers.0.mlp.Mul_57"
    input: "layers.0.mlp.down_proj.weight_t"
    output: "v_layers.0.mlp.down_proj.MatMul_59"
    name: "layers.0/mlp/down_proj/MatMul_node_59"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/layers.0: Qwen35DecoderLayer/mlp: MLP/down_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'Qwen35DecoderLayer\', \'MLP\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'layers.0\', \'mlp\', \'down_proj\']"
    }
  }
  node {
    input: "norm.weight"
    input: "const_1.0_f32"
    output: "v_norm.Add_61"
    name: "norm/Add_node_61"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/norm: OffsetRMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'OffsetRMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'norm\']"
    }
  }
  node {
    input: "val_2"
    input: "v_layers.0.mlp.down_proj.MatMul_59"
    input: "v_norm.Add_61"
    output: "mtp_hidden"
    output: "val_3"
    output: "val_4"
    output: "val_5"
    name: "node_SkipSimplifiedLayerNormalization_2"
    op_type: "SkipSimplifiedLayerNormalization"
    attribute {
      name: "epsilon"
      f: 1e-06
      type: FLOAT
    }
    domain: "com.microsoft"
    metadata_props {
      key: "namespace"
      value: ": Qwen35MtpModel/norm: OffsetRMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'Qwen35MtpModel\', \'OffsetRMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'norm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.rewriter.rule_name"
      value: "AddRMSNormToSkipNorm"
    }
  }
  name: "main_graph"
  initializer {
    dims: 16
    data_type: 1
    name: "pre_fc_norm_embedding.weight"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  initializer {
    data_type: 1
    name: "const_1.0_f32"
    raw_data: "I\325K<"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "pre_fc_norm_hidden.weight"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 16
    dims: 2
    data_type: 1
    name: "rotary_emb.cos_cache"
    raw_data: "\220\270-<\035\366l\273\276\001\277\273\035D\200\274ta\031=\241v\331;\322\221X<\336\373\245\274P\343a\275\367\231\277;\251y_\273\313\\\';\037\270\205;f\033\341\274\334\036\327;\013\214\313\271,\031\316\2744f7\273s\207&\274DhV\274\241!N\274;m\005\275\016\255\001\273\246\203\237\273\224\231 \274i\004U\275\001\202.<J\025\304<\245\350\354\273\023@\361<P\375\310\273\005\310\255;"
  }
  initializer {
    dims: 16
    dims: 2
    data_type: 1
    name: "rotary_emb.sin_cache"
    raw_data: "\217,Z;J\362\013\274}}\007\273\206\335\251<\255\300\240\274\267\365\202\274\013f7\275\271\003\217\274+D\216<\246\214A\273>\'\"<$\241\341<\241=A\274\200Y\263;s\371I\271\030\243\276\273\307\236\231\274\2664\016<\346\300\222;\322\241\207;\375\334\210<~\216R\275S\177)8\206\3235\274[t\'\274\246\355\250;\251\255\224\272}\243u\274Ksj\274IS\363\274d\316\232;\016\373\020<"
  }
  initializer {
    data_type: 7
    name: "const_1_i64"
    raw_data: "\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 1
    data_type: 7
    name: "const_1d_2"
    raw_data: "\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 1
    data_type: 7
    name: "const_1d_3"
    raw_data: "\000\000\000\000\000\000\000\000"
  }
  initializer {
    data_type: 1
    name: "const_0.0_f32"
    raw_data: "\010H\020\275"
  }
  initializer {
    data_type: 1
    name: "const_-3.4028234663852886e+38_f32"
    raw_data: "~}\256<"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "layers.0.input_layernorm.weight"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 4
    data_type: 7
    name: "const_1d_6"
    raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 3
    data_type: 7
    name: "const_1d_7"
    raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 4
    data_type: 7
    name: "const_1d_8"
    raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 8
    data_type: 1
    name: "layers.0.self_attn.q_norm.weight"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 8
    data_type: 1
    name: "layers.0.self_attn.k_norm.weight"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "layers.0.post_attention_layernorm.weight"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "norm.weight"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 32
    dims: 16
    data_type: 1
    name: "fc.weight_t"
    raw_data: "\243\010\035<\227e3\274`\241\037<\330\224{;\rp5\275t\"\006\274K:\200<\342\303\242;\345\333\372<\202.C<\376h]\274\\\223\261<toN<\rC\222\272u\261\355\273\344,\255\274}\214\251\273\315\n\265\273\2673^;\177\366\001=B)\236;2ay\274B\351\246\272o\340\313<\224\212=<\213\375\275\274\211}\261;\256HB:\002}\035<RM\036=\023\223\331\274\370\313R\275c\264\375\274>\207;<\002\207\230<\333\'8;R\036\363<\202\271\"<K\252\252<\375\351 \274!7\007\275\342v[<\216\361\006\275\216\336A\274\"=\216\274\345\353\201;@6\'<\302\362G\275\320\006c<\216*X;\036\243\353<r\251\245\274\036\274\321\274\025\217\207\273e\266\227<\244\371\242\273~\t\274<p\010\350;e\312N\274wW\300\273\023\326^\273\023\177\2738\2632\341\273\\5\277\274d]1\275\367P\221\274\313\177\026;\325n\034;S\322`<IV\304<X\265\307\273\225\331\035\272f\033\225\273\367-\266<,:\367<I\000\007\274\006\210\206<\265\032\271\274\215\014\235:\335\221\216\274\245Am\275\212\321\261\274\030d\271;\367T2<\227+\001\275;2\314\272\370\253\315\273\344\220\312\274]\033z;g\004\014<\371\2341\274{(\036=\316\360{<\330W\321\273;\255\225<\007A\244<\353=9=\322\346B;\275@\375\274\251\332\016<[\010\240\273\356\214*<M\241\214\274\203d\213<\306x\302\273Wa\017\275sm^<Z\307\224\274\025\177\375<\207\020\305\273YE6\274O\353\271<\004\245\326<+\215z\274\2522\341<\th;\274\204UI\274\213~\317<p\'\341<\263\362a\273\016\007\315<\363\345\304;\213x\332\274\320\247\255<al\036\273\374\245\033<\010~\214\272\260\027\"\275\302a\321\272\373e\344;\202\035\243\273\367\212\001\275\342kL<\'A\340<X\222\243\274W\310\241<\346\317\t\274\311\262\024\275\230\375)\274\212`\304\274\3000\'\275]9\302\274\304(;;\1774 \272\314Hl\274\324\343\227<-\333\247;\213d*\274\324\307\270\274\017W(\275\t\300S<\307\0054\274\362\231\376\272-\3020\267\002\354 =\346\210\264\272\364\352\013=\356\251\360<j\311\365<\211\226\372\273\220\013\217\272\002\357\327\273\371C\003=2DI=7l\323\274\022P\235\274\211]n\274\005\357#\270\325(\325<\245\221B\273\237P\023\274\255,\267<IJ(\273PU\241\274\256B\314<)\002C;\302\230\224<\376\036p\274x\247\374\273\302E/\274\231\310*\274\2143v<.\243\3569\375\253\304<\004\315f\274u$\320\274F2\225<\010\215\200\274\301\326:;E\224\253<\030F!\273\315\356\022<f\332\336<\330\207\207\274`Li<A\303\200\274\335\215\332<nA.=\357\313\333<[\024\025=\267\275c\274\317\253T\273s\230\000=\323\334\024=\322\262s<Id\323<\013CD;\331\245\374:\347\327=:\002\351\305\272\033\000\227\274\3636\017\273\312\327\237\274\313\344\340;!\331;=s7\036\274\301\255\345\274\\\344a\275\030\024\245\274\222)\312\273e\205\246\273\000\361\035=Q\240\232\272\351\314\306\274t\337R\274[\2002\275p[M;\264\271:\274W \237\274\247\224)\274\322\2575<\\\3065=\3340\317\274l\253\324<\364\332\026\274;\261\374\273+\345\376;+*\366\273\341_\221;\362)\224\273\304\021\241\273\214\302d\274\245 1\273\307^\216\274@\241e<q{\202<\357xD<\023\022\231\274\233\210Z<\0164\227\274E^\037\273\263\232\261<\231\177\235\274\222\256\036=\230X\215<\3425\005\275\267H\210\274CS\376;\001\245s:\nk(\275K\213\350\274ST\335\274\362y\211\274\327\370Y\275J)q:L\217\340<\306\351\026\275\256o\375<\351\037\223\272f\014\265\273\212E}\274\014\222\2368\301\027\031\275\357dA\274\003h\227\274\333\261q\274&\222\376\272\0161F\274\217*W<\214\324\347;\362F\277\274\004\030\260\274\262\244\320<oO\r<\303\205\376<\027-r\274W\351\232\274e\356e\273\3029\260\274\233\221\310<02\332<<Hl9\347\332\366\273gk\310\274\324;\006\275^/D=\331\010\010=\004\035\316\274\345C\330\273\022\220G\274\356*\203;\270\253\317<\"\270;\274\314)T\273\216\302O<\222\317\235\274:\030\207\272\276\250\037\275~=\245\274\271\003\270<b\321\221\274t$\000=\013\365\001\274\233\213\330<\330\222\307\273\324\321\010\274\267\267x<\023[\224;\347\\\037:\211\3342\274\226\205\202<\256\322\304<4\321\367<6\346\036\273\222S\371\272\')\265\274\371\213\265<\017N\222<\243\245\373<\341\231\232<\234\317]\274\323\302R\2747\200i<t\267\251<\234\245\332\274/A\025\274)\337\363;\010\363\224<\227~\n;T\351\277<\205\332z\273\262L\224;\312\254\202\274\266\211\250;+o\177<Fua\272\252/\260\274]\026\263<%4\265<\240\376T\274G\3625:\242\364\211\273\024\200\273;\002\350\013\273]\263};\037K\026=\376L\350\274\227\222\262\274\213\027=<\323\241\271;\370\256\204\2742~d=\030t\275\274X\0348<\375X\222;\025\334\322<CY\022\275p\335\260<N\202\274\274UP\375\273\370^\253;\373J/\274)N\345<\217%)\275=V\211<*\217\001\274\222\320\224\274\035\306\360\274\027\177\"<D\202\004\274\346(\001=\236\272\345\274&\307\266\274\256`%;}w\240<d\221\334\273\274)\376\274\0164}\2743\032p<\342\311\301;\3737\311\274\313\344}\274\320i\375\273k\236\013\273\001M\262<\245A+\274\262Xa=\270\325\366:\022{\202<B>p\2747\242#;\2333\252<\311\265\201\2742Tp<\315\306J\274\207I\232\274\311RU<\331\020\244\274\000O\316\272\372\325\221\274D\212\261<\036\247\314;Q\025\221\273\257+\356\273\014\366\334<B6\025\274\320\265\224=biO\274\255E\016\274P\307\225<@\366+<\234\312N;\346]\236:~\251{\274\007\356?<`\2059<\357\215\215<o\254\360<\216\311\321:rS1\274\270\034w;f\r\356;\352\037\305\274a)I<4I\206\274\372\301\002=\241\375\'=\373\310\334\2741\272\014\275\024W\364;\260\222\016\275d\312\211\274\345\n\364<+\r\355<\227\304&<\336M6\273\206\013\312\274\205\017\020\275xWR;|\353\272<\215x\255<\006\177N\273\016?K;\207\237\224\274j14<\365\377\314<\022\370\234\274\273\371\376;\352\307%\275lK\\\274`S`<&\262\244;\327oU\273\302\305\223<\320\220\332<\\\276\305\274F:\000=\231\227\005\274\013\335[\274\227\266\211<\256\223\300<\331\375\326:I{\t<\363\024K=\300\000\'=2E\352;\273)z;\200F\211<\217j\322\274\276x\030\275*\217\347\274u>\355<UPc=\r\224\t\274\335c\031:\334\r\'<b\033\220\274V\222\201\273#|\235\274\307\327~<\300\017<\273%\263\344<S\325\004\274sF,<\370\002\025=\250\301\000=\361\225\032\274\3769,;\365w\311<\017\211\220\274\0237,\273ei\360<\353/\276<I\366\270<\242\363I\273\212H\023=f\310\207\274P\371\325<\220A\177<\254z`<0P\220\272\351V8\273"
  }
  initializer {
    dims: 16
    dims: 32
    data_type: 1
    name: "layers.0.self_attn.q_proj.weight_t"
    raw_data: "F\377\276<\033mW<\020\251\236\274r7\256<\030\377-\274Y\021o<\373\331m\274<op\274V\r\220\272I\362N\274\323\023\025<h\177\r=~\017\265<\233\006\335<\017w\331<\227\033\252;\353\303\002\275>\007y\274\035M\305\274 A\373\274\032q\001\274\211v\"\275\317\240t<9\022\234\274E\0140<\252h\257\274^\260\r\275\360)\230<\303?y\274\211\301\'=\336W\365\274E\260@\274@\022\002<\222;j9\020\261\266\274\230\202\227;\331\237\345<][\025\272\227\'\355<\t\211\241\271\330\177\374<g\243\n<\233\374\003\275\217W\204<\3762\363<o\010\265<\013\017\035\274\362C\374\273\000GC\275S\275\363\274\356\0149\274S\345\264<\"\013D\274\200\374\'<\363+\312;;\004\364<\233\271|\274\t1=<\342\347\302;R\340m<\326\005(<\324\372\257\273Km\037<\257\246%\274\353\267\256<\246/\377;/\326\334<5Q\005<\001\266L\272\345\234t\273\211\221\331;&N\206\274\217\t/\274\354\002\333\273\240P@=\345\274&;\304L\250<gM\006\274[6\242<X\265\322\274K\330\222\274FQ:;\346nv\274\214\315\226<!\t\275;\013\224\244<\306\005\275<;\032\272\274N\000\322<x\204\225\274\\o{;\002\352\2269\333#_;i\364H<\336\034\336\274\246\300\271\273\245\003\251\273\3663\223\273\206\231R<\365%\363;\263\223w\274\315\351\223;Mm\230\2730\177l\274~\2149;\2304\371\2726@\021\273wx\0149\324y\331\273\\\217\331<\346\236\203<\327\321\232\272\334\2644<\005\325\242\274\245\021\363:\262e\032\275\354\316^<\271G\010\275\325\3521\274\014\203\324:\244\311\264<\030\273\245\274\233\003\265;\017\350=\274\376\310\230\273\3634\330\274\353n\t\275k\355\250;\320\212\244;\273a\017\275\324\223\203<\327\225\032=\345CU<\327\373\017=\351\317\352\273\022\377\033\275\247\202g<\353\020\311\273+E\266\274 \034\372\273\'q\037=sXW;[\200\204\274\016s\242<y\224P<\372B\227;\263\302\240<q\306#\274\342\340\r\275\r\300D\274\022A$\274\340i\003\275]\333\223<\264\237];\334\341`\270\356\023H<\013h\371<\200v\245<w\330\032<As.\275\241Lf<[ZJ;\020.\214<\013\212\364\274\336\366B\274\'$\352;h9\231<\032\t\223<\351\244\211;6\230\227\274\313\240G<\306\\\275\274V\027\200\274B\212e\274F\366\036\275\342\t\037=W\025\225\274n\352\\<\327\215@\274\242y\307\274\222\010\010<j\004@\273\250\032\235<\027\024\346<\363]F<\311\013\t;@\277!<\336\342\356<?r\243\273u\223A\275\035\266\324\274p\310N=\351z\004\274\242l\360\2730\325)\274\206\200\233<\340\005\350; \324\255\274\373\006\217\274\262\241\214\274TF\221\274K\030\203<l\247\242\274\373\237\305\273\347\271\273;{\317\345<\224\347\265\274;jW\273\211\267\224\273{\001\203<j\237\020<S\250r\274^T\004=\006O\035<\336)V\274\234\225\267<\241l*\274\322*$=\276T\361<\021!\020;\301\226[=\227F\001\274\000T\346\274\257\005k\273\340\023\300<\216\257l\274.\351h\274\331\2310\274<\345\360\2733\315\223;\255\357\005\275/\234&\272\262\226\025<3W\252:\326r\247<Z\330\226=\242\246\\:\344T\342<+\217n\273\341MH\274\253k\022\275\247\0042\274\311\203A<\272\352\006\275\244\355\264\274w\255\273<\246\305\367\273\307\364\013\274\363\330\207<\342Z\226<[qS=f#\214\274\371\332\375\272\013\245\235\2740\355\307<\230\234\260\274\234\275\031=\253\342\032\275WH\335<\220\277\217<\256\227\307:W(\027\275\370\215\227<\"g\246\274\345xD\272u\347a<5\247a<X\344<8\273\367\234;yh\004\275\375m$<\345\255*\275\327>\212;\373\025\227:\204:W;r\340E=p\361\014\2744\261\272\273\313)#\274\031Qn<\3339\271\274\260\213\364\274\333h\205<\"\361\355<\275\014\244<\351j\256\274w/\207\275\343y\376\274^B\247<\301\000&\271\375\334\275\273\255\'\274\274\3339\252\273\206\033\220\271o_\020<\250\315\r=\034\231\362\273\2570\313\274G\314l:m7\307\272\305\214/;f\215\265<EAv\273\351\200\204\274%\237\233<gO\332\273S[\255\273\301\337\346<\206\312\360\274\214\020b\274\\%5<\320\000);\"?(=\263N\016\275\374\273E:V\027\233;\217\343D=\035&2\274\363\025x\2747~\207<\274\273A<\372,\232<\352v\341<\352\204<<^n\332\274\273j\205\274\312\365+\275\272\377\204\273\347\221\021=F\211\004<\243\234\014\274%\212\360\273dq/<\317th<\357\274\210<\275,\211\2742\026\013\275\262r\262\274u|\307\274G\224\224\274\363L\256<=\n\215<\202\244\272;\276\312\275<\024H\\\272`;\210;\342\344\377\273\312\375J\274\014\177\212:\250\331\023\275\031\205\225<\366\306\224<\220s\314\274\n\372\371\274\353\033,\274\304\242\007=\220_(=g(\211\274\373\0100=\222\030\177;3\002.\274b\336\255\274\225\373\031;\336f\201\274\2063T\274\364\235\376<\336e?<+\273L<\327\263\177\274@5\316\274\202\316=<9\221k\274\222\001\227<{;+:\300\271\212;\013d\231\274+\013U\274W>\371\273\",O\274]V\360\273\024\300\r\274\257I\010\274\334\032\005\274!\312\223<YA\245<\264*\233\274\024\303\341<\217\200+\275\222\237P;#:p<.\036\206<\354\022\201\274\035_\234\274\374SJ<\335\231(<\207\317\337\273\025\304_\274\246A0=\357\267\275\273\362\001d\274/p\004\275\235\206,;79j\273r\204\033:\267\337\235\272b\350z=\222;\343\274(\033\026\275\244\251\307\274`\'\2478\235p\205<uv\030;\301\224Y<o[\t<j\371\204\274\0056]<\025\024\243\274C\274\215<^\241\266<\316\277e<\370\276o<\246\004c<\220\237\224\274H\036\025\273\304\202\340;\\\323\021\273\236Yq<\333\321\235<\313\262$\274\313\355\267\274^\310\342<B\201\274<\236\366K\274\020\340\n\274\005\357\373<\036\237\345\274B]\304:G\366\205\273\257\366&;\203\232\235\273\365Bf\273\334\236,\274W\324\321\272Cs\373\273b\233\252\274{\337$<a\234\254\273\'P4\274\252\333\311:\235\336p<\306,\253\274\3745\230<G{W<\237Z\207;\307qD<\005AM\274\361o\2077\371k\";3\327\264<$\337\221<\274\354;\273\036\3179\274\3053T\274E\306\200\274\202dJ\275\227\363z<\351\353\034\274xR\305<\354\037q\274k#t\274\215\213\224<S\033E\274\213&\223<\035\340a<x\361|\274\357\373N\274\317\375\243\274@\260B;+\270P\273M3)\274\200\316\356\272\346\353U:\020<5\273\'T\221\273Mp\310\273\245\214\\;d\3563\275\216q*\274\355\\\227\274\276\006\244\274\016\277\303<7\331\010=\253\2157\275\026\006\020\275\216@\302;\375\360\272;\265\262\023\275?{\213\273;\337\351\274fe\035=\t5\311:\371u\335;A\324\025\275\036\273\372\274\300\3250\274\241\251\003;i.~\274\360\227<=\r3\261\274T\315M<<&m<\233{\270\274"
  }
  initializer {
    dims: 16
    dims: 8
    data_type: 1
    name: "layers.0.self_attn.k_proj.weight_t"
