ir_version: 8
producer_name: "onnx-genai tiny-gemma4-vlm fixture"
graph {
  node {
    output: "flat_shape"
    name: "node_Constant_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
        name: "flat_shape_value"
        raw_data: "\001\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\004\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "pixel_values"
    input: "flat_shape"
    output: "pixels_flat"
    name: "node_Reshape_1"
    op_type: "Reshape"
  }
  node {
    input: "pixels_flat"
    output: "image_features"
    name: "node_ReduceMean_2"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: 1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  name: "tiny_gemma4_vision_encoder"
  input {
    name: "pixel_values"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "image_features"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 13
}
