ir_version: 8
producer_name: "onnx-genai tiny-codec fixture"
graph {
  node {
    output: "pair_shape"
    name: "node_Constant_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
        name: "pair_shape_value"
        raw_data: "\001\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "waveform"
    input: "pair_shape"
    output: "pairs"
    name: "node_Reshape_1"
    op_type: "Reshape"
  }
  node {
    input: "pairs"
    output: "codes"
    name: "node_ReduceMean_2"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  name: "tiny_codec_encoder"
  input {
    name: "waveform"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  output {
    name: "codes"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 13
}
