ir_version: 8
producer_name: "onnx-genai tiny-diffusion"
graph {
  node {
    input: "sample"
    input: "cond"
    output: "summed"
    op_type: "Add"
  }
  node {
    input: "summed"
    input: "half"
    output: "denoised"
    op_type: "Mul"
  }
  name: "tiny_diffusion_denoiser"
  initializer {
    dims: 1
    data_type: 1
    name: "half"
    raw_data: "\000\000\000?"
  }
  input {
    name: "sample"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "cond"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "denoised"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  value_info {
    name: "half"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 13
}
