ir_version: 8
producer_name: "onnx-genai tiny-diffusion"
graph {
  node {
    input: "sample"
    input: "t"
    output: "denoised"
    op_type: "Add"
  }
  name: "tiny_diffusion_denoiser_step"
  input {
    name: "sample"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "t"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "denoised"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 13
}
