ir_version: 8
producer_name: "onnx-genai tiny-diffusion"
graph {
  node {
    input: "x"
    input: "cond"
    output: "x_sum"
    op_type: "Add"
  }
  node {
    input: "x_sum"
    input: "half_m"
    output: "x_next"
    op_type: "Mul"
  }
  node {
    input: "y"
    input: "x"
    output: "y_sum"
    op_type: "Add"
  }
  node {
    input: "y_sum"
    input: "half_m"
    output: "y_next"
    op_type: "Mul"
  }
  name: "tiny_diffusion_denoiser_multi"
  initializer {
    dims: 1
    data_type: 1
    name: "half_m"
    raw_data: "\000\000\000?"
  }
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "cond"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "x_next"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "y_next"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  value_info {
    name: "half_m"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 13
}
