ir_version: 8
producer_name: "onnx-genai tiny-diffusion"
graph {
  node {
    input: "latent"
    input: "two"
    output: "scaled"
    op_type: "Mul"
  }
  node {
    input: "scaled"
    input: "one"
    output: "image"
    op_type: "Add"
  }
  name: "tiny_diffusion_vae"
  initializer {
    dims: 1
    data_type: 1
    name: "two"
    raw_data: "\000\000\000@"
  }
  initializer {
    dims: 1
    data_type: 1
    name: "one"
    raw_data: "\000\000\200?"
  }
  input {
    name: "latent"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "image"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  value_info {
    name: "two"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  value_info {
    name: "one"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 13
}
