{
  "chat_template": "{% if tools %}<tools>\n{{ tools | tojson }}\n</tools>\nWhen you call a tool, respond with <tool_call>{\"name\": ..., \"arguments\": ...}</tool_call>.\n{% endif %}{% for message in messages %}<|im_start|>{{ message.role }}\n{{ message.content }}<|im_end|>\n{% endfor %}{% if add_generation_prompt %}<|im_start|>assistant\n{% endif %}",
  "eos_token": "<|im_end|>"
}
