ir_version: 11
producer_name: "mobius"
producer_version: "0.1.0"
graph {
  node {
    input: "sample"
    input: "pos_embed.proj.weight"
    input: "pos_embed.proj.bias"
    output: "v_pos_embed.proj.Conv_0"
    name: "pos_embed/proj/Conv_node_0"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/pos_embed: PatchEmbed/proj: Conv2d"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'PatchEmbed\', \'Conv2d\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'pos_embed\', \'proj\']"
    }
  }
  node {
    input: "v_pos_embed.proj.Conv_0"
    output: "v_pos_embed.Shape_1"
    name: "pos_embed/Shape_node_1"
    op_type: "Shape"
    attribute {
      name: "end"
      i: 1
      type: INT
    }
    attribute {
      name: "start"
      i: 0
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/pos_embed: PatchEmbed"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'PatchEmbed\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'pos_embed\']"
    }
  }
  node {
    output: "v_pos_embed.Shape_2"
    name: "node_Constant_0"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 32
      type: INTS
    }
  }
  node {
    input: "v_pos_embed.proj.Conv_0"
    output: "v_pos_embed.Shape_3"
    name: "pos_embed/Shape_node_3"
    op_type: "Shape"
    attribute {
      name: "end"
      i: 3
      type: INT
    }
    attribute {
      name: "start"
      i: 2
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/pos_embed: PatchEmbed"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'PatchEmbed\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'pos_embed\']"
    }
  }
  node {
    input: "v_pos_embed.proj.Conv_0"
    output: "v_pos_embed.Shape_4"
    name: "pos_embed/Shape_node_4"
    op_type: "Shape"
    attribute {
      name: "end"
      i: 4
      type: INT
    }
    attribute {
      name: "start"
      i: 3
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/pos_embed: PatchEmbed"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'PatchEmbed\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'pos_embed\']"
    }
  }
  node {
    input: "v_pos_embed.Shape_3"
    input: "v_pos_embed.Shape_4"
    output: "v_pos_embed.Mul_5"
    name: "pos_embed/Mul_node_5"
    op_type: "Mul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/pos_embed: PatchEmbed"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'PatchEmbed\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'pos_embed\']"
    }
  }
  node {
    input: "v_pos_embed.Shape_1"
    input: "v_pos_embed.Shape_2"
    input: "v_pos_embed.Mul_5"
    output: "v_pos_embed.Concat_6"
    name: "pos_embed/Concat_node_6"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/pos_embed: PatchEmbed"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'PatchEmbed\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'pos_embed\']"
    }
  }
  node {
    input: "v_pos_embed.proj.Conv_0"
    input: "v_pos_embed.Concat_6"
    output: "v_pos_embed.Reshape_7"
    name: "pos_embed/Reshape_node_7"
    op_type: "Reshape"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/pos_embed: PatchEmbed"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'PatchEmbed\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'pos_embed\']"
    }
  }
  node {
    input: "v_pos_embed.Reshape_7"
    output: "v_pos_embed.Transpose_8"
    name: "pos_embed/Transpose_node_8"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/pos_embed: PatchEmbed"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'PatchEmbed\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'pos_embed\']"
    }
  }
  node {
    input: "timestep"
    output: "v_Cast_10"
    name: "Cast_node_10"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "v_Cast_10"
    input: "const_1d_0"
    output: "v_Unsqueeze_11"
    name: "Unsqueeze_node_11"
    op_type: "Unsqueeze"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "v_Unsqueeze_11"
    input: "v_Unsqueeze_12"
    output: "v_Mul_13"
    name: "Mul_node_13"
    op_type: "Mul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "v_Mul_13"
    output: "v_Cos_14"
    name: "Cos_node_14"
    op_type: "Cos"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "v_Mul_13"
    output: "v_Sin_15"
    name: "Sin_node_15"
    op_type: "Sin"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "v_Cos_14"
    input: "v_Sin_15"
    output: "v_Concat_16"
    name: "Concat_node_16"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\']"
    }
  }
  node {
    input: "adaln_single.linear_1.weight"
    output: "v_adaln_single.linear_1.Transpose_17"
    name: "adaln_single/linear_1/Transpose_node_17"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/adaln_single: TimestepEmbedding/linear_1: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'TimestepEmbedding\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'adaln_single\', \'linear_1\']"
    }
  }
  node {
    input: "v_Concat_16"
    input: "v_adaln_single.linear_1.Transpose_17"
    output: "v_adaln_single.linear_1.MatMul_18"
    name: "adaln_single/linear_1/MatMul_node_18"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/adaln_single: TimestepEmbedding/linear_1: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'TimestepEmbedding\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'adaln_single\', \'linear_1\']"
    }
  }
  node {
    input: "v_adaln_single.linear_1.MatMul_18"
    input: "adaln_single.linear_1.bias"
    output: "v_adaln_single.linear_1.Add_19"
    name: "adaln_single/linear_1/Add_node_19"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/adaln_single: TimestepEmbedding/linear_1: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'TimestepEmbedding\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'adaln_single\', \'linear_1\']"
    }
  }
  node {
    input: "v_adaln_single.linear_1.Add_19"
    output: "v_adaln_single._silu.Sigmoid_20"
    name: "adaln_single/_silu/Sigmoid_node_20"
    op_type: "Sigmoid"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/adaln_single: TimestepEmbedding/_silu: SiLU"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'TimestepEmbedding\', \'SiLU\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'adaln_single\', \'_silu\']"
    }
  }
  node {
    input: "v_adaln_single.linear_1.Add_19"
    input: "v_adaln_single._silu.Sigmoid_20"
    output: "v_adaln_single._silu.Mul_21"
    name: "adaln_single/_silu/Mul_node_21"
    op_type: "Mul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/adaln_single: TimestepEmbedding/_silu: SiLU"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'TimestepEmbedding\', \'SiLU\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'adaln_single\', \'_silu\']"
    }
  }
  node {
    input: "adaln_single.linear_2.weight"
    output: "v_adaln_single.linear_2.Transpose_22"
    name: "adaln_single/linear_2/Transpose_node_22"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/adaln_single: TimestepEmbedding/linear_2: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'TimestepEmbedding\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'adaln_single\', \'linear_2\']"
    }
  }
  node {
    input: "v_adaln_single._silu.Mul_21"
    input: "v_adaln_single.linear_2.Transpose_22"
    output: "v_adaln_single.linear_2.MatMul_23"
    name: "adaln_single/linear_2/MatMul_node_23"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/adaln_single: TimestepEmbedding/linear_2: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'TimestepEmbedding\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'adaln_single\', \'linear_2\']"
    }
  }
  node {
    input: "v_adaln_single.linear_2.MatMul_23"
    input: "adaln_single.linear_2.bias"
    output: "v_adaln_single.linear_2.Add_24"
    name: "adaln_single/linear_2/Add_node_24"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/adaln_single: TimestepEmbedding/linear_2: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'TimestepEmbedding\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'adaln_single\', \'linear_2\']"
    }
  }
  node {
    input: "caption_projection.weight"
    output: "v_caption_projection.Transpose_25"
    name: "caption_projection/Transpose_node_25"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/caption_projection: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'caption_projection\']"
    }
  }
  node {
    input: "encoder_hidden_states"
    input: "v_caption_projection.Transpose_25"
    output: "v_caption_projection.MatMul_26"
    name: "caption_projection/MatMul_node_26"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/caption_projection: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'caption_projection\']"
    }
  }
  node {
    input: "v_caption_projection.MatMul_26"
    input: "caption_projection.bias"
    output: "v_caption_projection.Add_27"
    name: "caption_projection/Add_node_27"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/caption_projection: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'caption_projection\']"
    }
  }
  node {
    input: "v_adaln_single.linear_2.Add_24"
    output: "v_transformer_blocks.0.norm1._silu.Sigmoid_28"
    name: "transformer_blocks.0/norm1/_silu/Sigmoid_node_28"
    op_type: "Sigmoid"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/norm1: AdaLayerNormZero/_silu: SiLU"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'AdaLayerNormZero\', \'SiLU\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'norm1\', \'_silu\']"
    }
  }
  node {
    input: "v_adaln_single.linear_2.Add_24"
    input: "v_transformer_blocks.0.norm1._silu.Sigmoid_28"
    output: "v_transformer_blocks.0.norm1._silu.Mul_29"
    name: "transformer_blocks.0/norm1/_silu/Mul_node_29"
    op_type: "Mul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/norm1: AdaLayerNormZero/_silu: SiLU"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'AdaLayerNormZero\', \'SiLU\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'norm1\', \'_silu\']"
    }
  }
  node {
    input: "transformer_blocks.0.norm1.linear.weight"
    output: "v_transformer_blocks.0.norm1.linear.Transpose_30"
    name: "transformer_blocks.0/norm1/linear/Transpose_node_30"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/norm1: AdaLayerNormZero/linear: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'AdaLayerNormZero\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'norm1\', \'linear\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.norm1._silu.Mul_29"
    input: "v_transformer_blocks.0.norm1.linear.Transpose_30"
    output: "v_transformer_blocks.0.norm1.linear.MatMul_31"
    name: "transformer_blocks.0/norm1/linear/MatMul_node_31"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/norm1: AdaLayerNormZero/linear: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'AdaLayerNormZero\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'norm1\', \'linear\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.norm1.linear.MatMul_31"
    input: "transformer_blocks.0.norm1.linear.bias"
    output: "v_transformer_blocks.0.norm1.linear.Add_32"
    name: "transformer_blocks.0/norm1/linear/Add_node_32"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/norm1: AdaLayerNormZero/linear: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'AdaLayerNormZero\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'norm1\', \'linear\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.norm1.linear.Add_32"
    output: "v_transformer_blocks.0.norm1.Split_33_0"
    output: "v_transformer_blocks.0.norm1.Split_33_1"
    output: "v_transformer_blocks.0.norm1.Split_33_2"
    output: "v_transformer_blocks.0.norm1.Split_33_3"
    output: "v_transformer_blocks.0.norm1.Split_33_4"
    output: "v_transformer_blocks.0.norm1.Split_33_5"
    name: "transformer_blocks.0/norm1/Split_node_33"
    op_type: "Split"
    attribute {
      name: "num_outputs"
      i: 6
      type: INT
    }
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/norm1: AdaLayerNormZero"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'AdaLayerNormZero\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'norm1\']"
    }
  }
  node {
    input: "v_pos_embed.Transpose_8"
    input: "transformer_blocks.0.norm1.norm.weight"
    input: "transformer_blocks.0.norm1.norm.bias"
    output: "v_transformer_blocks.0.norm1.norm.LayerNormalization_34"
    name: "transformer_blocks.0/norm1/norm/LayerNormalization_node_34"
    op_type: "LayerNormalization"
    attribute {
      name: "epsilon"
      f: 1e-06
      type: FLOAT
    }
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/norm1: AdaLayerNormZero/norm: LayerNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'AdaLayerNormZero\', \'LayerNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'norm1\', \'norm\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.norm1.Split_33_1"
    input: "const_1d_0"
    output: "v_transformer_blocks.0.Unsqueeze_35"
    name: "transformer_blocks.0/Unsqueeze_node_35"
    op_type: "Unsqueeze"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\']"
    }
  }
  node {
    input: "const_1.0_f32"
    input: "v_transformer_blocks.0.Unsqueeze_35"
    output: "v_transformer_blocks.0.Add_36"
    name: "transformer_blocks.0/Add_node_36"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.norm1.norm.LayerNormalization_34"
    input: "v_transformer_blocks.0.Add_36"
    output: "v_transformer_blocks.0.Mul_37"
    name: "transformer_blocks.0/Mul_node_37"
    op_type: "Mul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.norm1.Split_33_0"
    input: "const_1d_0"
    output: "v_transformer_blocks.0.Unsqueeze_38"
    name: "transformer_blocks.0/Unsqueeze_node_38"
    op_type: "Unsqueeze"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.Mul_37"
    input: "v_transformer_blocks.0.Unsqueeze_38"
    output: "v_transformer_blocks.0.Add_39"
    name: "transformer_blocks.0/Add_node_39"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\']"
    }
  }
  node {
    input: "transformer_blocks.0.attn1.to_q.weight"
    output: "v_transformer_blocks.0.attn1.to_q.Transpose_40"
    name: "transformer_blocks.0/attn1/to_q/Transpose_node_40"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn1: DiffusionSelfAttention/to_q: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'DiffusionSelfAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn1\', \'to_q\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.Add_39"
    input: "v_transformer_blocks.0.attn1.to_q.Transpose_40"
    output: "v_transformer_blocks.0.attn1.to_q.MatMul_41"
    name: "transformer_blocks.0/attn1/to_q/MatMul_node_41"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn1: DiffusionSelfAttention/to_q: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'DiffusionSelfAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn1\', \'to_q\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.attn1.to_q.MatMul_41"
    input: "transformer_blocks.0.attn1.to_q.bias"
    output: "v_transformer_blocks.0.attn1.to_q.Add_42"
    name: "transformer_blocks.0/attn1/to_q/Add_node_42"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn1: DiffusionSelfAttention/to_q: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'DiffusionSelfAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn1\', \'to_q\']"
    }
  }
  node {
    input: "transformer_blocks.0.attn1.to_k.weight"
    output: "v_transformer_blocks.0.attn1.to_k.Transpose_43"
    name: "transformer_blocks.0/attn1/to_k/Transpose_node_43"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn1: DiffusionSelfAttention/to_k: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'DiffusionSelfAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn1\', \'to_k\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.Add_39"
    input: "v_transformer_blocks.0.attn1.to_k.Transpose_43"
    output: "v_transformer_blocks.0.attn1.to_k.MatMul_44"
    name: "transformer_blocks.0/attn1/to_k/MatMul_node_44"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn1: DiffusionSelfAttention/to_k: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'DiffusionSelfAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn1\', \'to_k\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.attn1.to_k.MatMul_44"
    input: "transformer_blocks.0.attn1.to_k.bias"
    output: "v_transformer_blocks.0.attn1.to_k.Add_45"
    name: "transformer_blocks.0/attn1/to_k/Add_node_45"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn1: DiffusionSelfAttention/to_k: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'DiffusionSelfAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn1\', \'to_k\']"
    }
  }
  node {
    input: "transformer_blocks.0.attn1.to_v.weight"
    output: "v_transformer_blocks.0.attn1.to_v.Transpose_46"
    name: "transformer_blocks.0/attn1/to_v/Transpose_node_46"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn1: DiffusionSelfAttention/to_v: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'DiffusionSelfAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn1\', \'to_v\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.Add_39"
    input: "v_transformer_blocks.0.attn1.to_v.Transpose_46"
    output: "v_transformer_blocks.0.attn1.to_v.MatMul_47"
    name: "transformer_blocks.0/attn1/to_v/MatMul_node_47"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn1: DiffusionSelfAttention/to_v: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'DiffusionSelfAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn1\', \'to_v\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.attn1.to_v.MatMul_47"
    input: "transformer_blocks.0.attn1.to_v.bias"
    output: "v_transformer_blocks.0.attn1.to_v.Add_48"
    name: "transformer_blocks.0/attn1/to_v/Add_node_48"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn1: DiffusionSelfAttention/to_v: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'DiffusionSelfAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn1\', \'to_v\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.attn1.to_q.Add_42"
    input: "v_transformer_blocks.0.attn1.to_k.Add_45"
    input: "v_transformer_blocks.0.attn1.to_v.Add_48"
    output: "v_transformer_blocks.0.attn1.Attention_49"
    name: "transformer_blocks.0/attn1/Attention_node_49"
    op_type: "Attention"
    attribute {
      name: "is_causal"
      i: 0
      type: INT
    }
    attribute {
      name: "kv_num_heads"
      i: 2
      type: INT
    }
    attribute {
      name: "q_num_heads"
      i: 2
      type: INT
    }
    attribute {
      name: "scale"
      f: 0.25
      type: FLOAT
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn1: DiffusionSelfAttention"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'DiffusionSelfAttention\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn1\']"
    }
  }
  node {
    input: "transformer_blocks.0.attn1.to_out.0.weight"
    output: "v_transformer_blocks.0.attn1.to_out.0.Transpose_50"
    name: "transformer_blocks.0/attn1/to_out/0/Transpose_node_50"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn1: DiffusionSelfAttention/to_out: Sequential/0: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'DiffusionSelfAttention\', \'Sequential\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn1\', \'to_out\', \'0\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.attn1.Attention_49"
    input: "v_transformer_blocks.0.attn1.to_out.0.Transpose_50"
    output: "v_transformer_blocks.0.attn1.to_out.0.MatMul_51"
    name: "transformer_blocks.0/attn1/to_out/0/MatMul_node_51"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn1: DiffusionSelfAttention/to_out: Sequential/0: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'DiffusionSelfAttention\', \'Sequential\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn1\', \'to_out\', \'0\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.attn1.to_out.0.MatMul_51"
    input: "transformer_blocks.0.attn1.to_out.0.bias"
    output: "v_transformer_blocks.0.attn1.to_out.0.Add_52"
    name: "transformer_blocks.0/attn1/to_out/0/Add_node_52"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn1: DiffusionSelfAttention/to_out: Sequential/0: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'DiffusionSelfAttention\', \'Sequential\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn1\', \'to_out\', \'0\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.norm1.Split_33_2"
    input: "const_1d_0"
    output: "v_transformer_blocks.0.Unsqueeze_53"
    name: "transformer_blocks.0/Unsqueeze_node_53"
    op_type: "Unsqueeze"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.attn1.to_out.0.Add_52"
    input: "v_transformer_blocks.0.Unsqueeze_53"
    output: "v_transformer_blocks.0.Mul_54"
    name: "transformer_blocks.0/Mul_node_54"
    op_type: "Mul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\']"
    }
  }
  node {
    input: "v_pos_embed.Transpose_8"
    input: "v_transformer_blocks.0.Mul_54"
    input: "transformer_blocks.0.attn2.norm.weight"
    input: "transformer_blocks.0.attn2.norm.bias"
    output: "v_transformer_blocks.0.attn2.norm.LayerNormalization_56"
    output: "val_0"
    output: "val_1"
    output: "val_2"
    name: "node_SkipLayerNormalization_1"
    op_type: "SkipLayerNormalization"
    attribute {
      name: "epsilon"
      f: 1e-06
      type: FLOAT
    }
    domain: "com.microsoft"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn2: _DiTCrossAttention/norm: LayerNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'_DiTCrossAttention\', \'LayerNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn2\', \'norm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.rewriter.rule_name"
      value: "AddLayerNormToSkipLayerNorm"
    }
  }
  node {
    input: "transformer_blocks.0.attn2.to_q.weight"
    output: "v_transformer_blocks.0.attn2.to_q.Transpose_57"
    name: "transformer_blocks.0/attn2/to_q/Transpose_node_57"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn2: _DiTCrossAttention/to_q: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'_DiTCrossAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn2\', \'to_q\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.attn2.norm.LayerNormalization_56"
    input: "v_transformer_blocks.0.attn2.to_q.Transpose_57"
    output: "v_transformer_blocks.0.attn2.to_q.MatMul_58"
    name: "transformer_blocks.0/attn2/to_q/MatMul_node_58"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn2: _DiTCrossAttention/to_q: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'_DiTCrossAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn2\', \'to_q\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.attn2.to_q.MatMul_58"
    input: "transformer_blocks.0.attn2.to_q.bias"
    output: "v_transformer_blocks.0.attn2.to_q.Add_59"
    name: "transformer_blocks.0/attn2/to_q/Add_node_59"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn2: _DiTCrossAttention/to_q: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'_DiTCrossAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn2\', \'to_q\']"
    }
  }
  node {
    input: "transformer_blocks.0.attn2.to_k.weight"
    output: "v_transformer_blocks.0.attn2.to_k.Transpose_60"
    name: "transformer_blocks.0/attn2/to_k/Transpose_node_60"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn2: _DiTCrossAttention/to_k: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'_DiTCrossAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn2\', \'to_k\']"
    }
  }
  node {
    input: "v_caption_projection.Add_27"
    input: "v_transformer_blocks.0.attn2.to_k.Transpose_60"
    output: "v_transformer_blocks.0.attn2.to_k.MatMul_61"
    name: "transformer_blocks.0/attn2/to_k/MatMul_node_61"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn2: _DiTCrossAttention/to_k: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'_DiTCrossAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn2\', \'to_k\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.attn2.to_k.MatMul_61"
    input: "transformer_blocks.0.attn2.to_k.bias"
    output: "v_transformer_blocks.0.attn2.to_k.Add_62"
    name: "transformer_blocks.0/attn2/to_k/Add_node_62"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn2: _DiTCrossAttention/to_k: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'_DiTCrossAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn2\', \'to_k\']"
    }
  }
  node {
    input: "transformer_blocks.0.attn2.to_v.weight"
    output: "v_transformer_blocks.0.attn2.to_v.Transpose_63"
    name: "transformer_blocks.0/attn2/to_v/Transpose_node_63"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn2: _DiTCrossAttention/to_v: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'_DiTCrossAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn2\', \'to_v\']"
    }
  }
  node {
    input: "v_caption_projection.Add_27"
    input: "v_transformer_blocks.0.attn2.to_v.Transpose_63"
    output: "v_transformer_blocks.0.attn2.to_v.MatMul_64"
    name: "transformer_blocks.0/attn2/to_v/MatMul_node_64"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn2: _DiTCrossAttention/to_v: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'_DiTCrossAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn2\', \'to_v\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.attn2.to_v.MatMul_64"
    input: "transformer_blocks.0.attn2.to_v.bias"
    output: "v_transformer_blocks.0.attn2.to_v.Add_65"
    name: "transformer_blocks.0/attn2/to_v/Add_node_65"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn2: _DiTCrossAttention/to_v: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'_DiTCrossAttention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn2\', \'to_v\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.attn2.to_q.Add_59"
    input: "v_transformer_blocks.0.attn2.to_k.Add_62"
    input: "v_transformer_blocks.0.attn2.to_v.Add_65"
    output: "v_transformer_blocks.0.attn2.Attention_66"
    name: "transformer_blocks.0/attn2/Attention_node_66"
    op_type: "Attention"
    attribute {
      name: "is_causal"
      i: 0
      type: INT
    }
    attribute {
      name: "kv_num_heads"
      i: 2
      type: INT
    }
    attribute {
      name: "q_num_heads"
      i: 2
      type: INT
    }
    attribute {
      name: "scale"
      f: 0.25
      type: FLOAT
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn2: _DiTCrossAttention"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'_DiTCrossAttention\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn2\']"
    }
  }
  node {
    input: "transformer_blocks.0.attn2.to_out.0.weight"
    output: "v_transformer_blocks.0.attn2.to_out.0.Transpose_67"
    name: "transformer_blocks.0/attn2/to_out/0/Transpose_node_67"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn2: _DiTCrossAttention/to_out: Sequential/0: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'_DiTCrossAttention\', \'Sequential\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn2\', \'to_out\', \'0\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.attn2.Attention_66"
    input: "v_transformer_blocks.0.attn2.to_out.0.Transpose_67"
    output: "v_transformer_blocks.0.attn2.to_out.0.MatMul_68"
    name: "transformer_blocks.0/attn2/to_out/0/MatMul_node_68"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn2: _DiTCrossAttention/to_out: Sequential/0: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'_DiTCrossAttention\', \'Sequential\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn2\', \'to_out\', \'0\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.attn2.to_out.0.MatMul_68"
    input: "transformer_blocks.0.attn2.to_out.0.bias"
    output: "v_transformer_blocks.0.attn2.to_out.0.Add_69"
    name: "transformer_blocks.0/attn2/to_out/0/Add_node_69"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/attn2: _DiTCrossAttention/to_out: Sequential/0: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'_DiTCrossAttention\', \'Sequential\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\', \'attn2\', \'to_out\', \'0\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.attn2.to_out.0.Add_69"
    input: "val_2"
    input: "transformer_blocks.0.norm1.norm.weight"
    input: "transformer_blocks.0.norm1.norm.bias"
    output: "v_transformer_blocks.0.LayerNormalization_71"
    output: "val_3"
    output: "val_4"
    output: "val_5"
    name: "node_SkipLayerNormalization_2"
    op_type: "SkipLayerNormalization"
    attribute {
      name: "epsilon"
      f: 1e-06
      type: FLOAT
    }
    domain: "com.microsoft"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\']"
    }
    metadata_props {
      key: "pkg.onnxscript.rewriter.rule_name"
      value: "AddLayerNormToSkipLayerNorm"
    }
  }
  node {
    input: "v_transformer_blocks.0.norm1.Split_33_4"
    input: "const_1d_0"
    output: "v_transformer_blocks.0.Unsqueeze_72"
    name: "transformer_blocks.0/Unsqueeze_node_72"
    op_type: "Unsqueeze"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\']"
    }
  }
  node {
    input: "const_1.0_f32"
    input: "v_transformer_blocks.0.Unsqueeze_72"
    output: "v_transformer_blocks.0.Add_73"
    name: "transformer_blocks.0/Add_node_73"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.LayerNormalization_71"
    input: "v_transformer_blocks.0.Add_73"
    output: "v_transformer_blocks.0.Mul_74"
    name: "transformer_blocks.0/Mul_node_74"
    op_type: "Mul"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.norm1.Split_33_3"
    input: "const_1d_0"
    output: "v_transformer_blocks.0.Unsqueeze_75"
    name: "transformer_blocks.0/Unsqueeze_node_75"
    op_type: "Unsqueeze"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\']"
    }
  }
  node {
    input: "v_transformer_blocks.0.Mul_74"
    input: "v_transformer_blocks.0.Unsqueeze_75"
    output: "v_transformer_blocks.0.Add_76"
    name: "transformer_blocks.0/Add_node_76"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer_blocks.0\']"
    }
  }
  node {
    input: "transformer_blocks.0.ff.linear_1.weight"
    output: "v_transformer_blocks.0.ff.linear_1.Transpose_77"
    name: "transformer_blocks.0/ff/linear_1/Transpose_node_77"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
    metadata_props {
      key: "namespace"
      value: ": DiTTransformer2DModel/transformer_blocks.0: _DiTBlock/ff: DiffusionFFN/linear_1: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'DiTTransformer2DModel\', \'_DiTBlock\', \'DiffusionFFN\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
