ir_version: 11
producer_name: "mobius"
producer_version: "0.1.0"
graph {
  node {
    input: "transformer.wte.weight"
    input: "tokens"
    output: "v_transformer.wte.Gather_0"
    name: "transformer/wte/Gather_node_0"
    op_type: "Gather"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel/wte: Embedding"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\', \'Embedding\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\', \'wte\']"
    }
  }
  node {
    input: "transformer.wpe.weight"
    input: "pos_port"
    output: "v_transformer.wpe.Gather_1"
    name: "transformer/wpe/Gather_node_1"
    op_type: "Gather"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel/wpe: Embedding"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\', \'Embedding\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\', \'wpe\']"
    }
  }
  node {
    input: "attn_mask_port"
    output: "v_transformer.Cast_3"
    name: "transformer/Cast_node_3"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 9
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\']"
    }
  }
  node {
    input: "v_transformer.Cast_3"
    input: "const_1d_0"
    output: "v_transformer.Unsqueeze_4"
    name: "transformer/Unsqueeze_node_4"
    op_type: "Unsqueeze"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\']"
    }
  }
  node {
    input: "tokens"
    output: "v_transformer.Shape_5"
    name: "transformer/Shape_node_5"
    op_type: "Shape"
    attribute {
      name: "end"
      i: 1
      type: INT
    }
    attribute {
      name: "start"
      i: 0
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\']"
    }
  }
  node {
    input: "tokens"
    output: "v_transformer.Shape_6"
    name: "transformer/Shape_node_6"
    op_type: "Shape"
    attribute {
      name: "end"
      i: 2
      type: INT
    }
    attribute {
      name: "start"
      i: 1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\']"
    }
  }
  node {
    input: "attn_mask_port"
    output: "v_transformer.Shape_7"
    name: "transformer/Shape_node_7"
    op_type: "Shape"
    attribute {
      name: "end"
      i: 2
      type: INT
    }
    attribute {
      name: "start"
      i: 1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\']"
    }
  }
  node {
    input: "v_transformer.Shape_5"
    input: "v_transformer.Shape_6"
    input: "v_transformer.Shape_7"
    output: "v_transformer.Concat_8"
    name: "transformer/Concat_node_8"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\']"
    }
  }
  node {
    input: "v_transformer.Unsqueeze_4"
    input: "v_transformer.Concat_8"
    output: "v_transformer.Expand_9"
    name: "transformer/Expand_node_9"
    op_type: "Expand"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\']"
    }
  }
  node {
    input: "v_transformer.Expand_9"
    input: "const_1d_0"
    output: "v_transformer.Unsqueeze_10"
    name: "transformer/Unsqueeze_node_10"
    op_type: "Unsqueeze"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\']"
    }
  }
  node {
    input: "v_transformer.wte.Gather_0"
    input: "v_transformer.wpe.Gather_1"
    input: "transformer.h.0.ln_1.weight"
    input: "transformer.h.0.ln_1.bias"
    output: "v_transformer.h.0.ln_1.LayerNormalization_11"
    output: "val_0"
    output: "val_1"
    output: "val_2"
    name: "node_SkipLayerNormalization_0"
    op_type: "SkipLayerNormalization"
    attribute {
      name: "epsilon"
      f: 1e-06
      type: FLOAT
    }
    domain: "com.microsoft"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel/h.0: _GPT2DecoderLayer/ln_1: LayerNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\', \'_GPT2DecoderLayer\', \'LayerNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\', \'h.0\', \'ln_1\']"
    }
    metadata_props {
      key: "pkg.onnxscript.rewriter.rule_name"
      value: "AddLayerNormToSkipLayerNorm"
    }
  }
  node {
    input: "v_transformer.h.0.ln_1.LayerNormalization_11"
    input: "transformer.h.0.attn.q_proj.weight_t"
    output: "v_transformer.h.0.attn.q_proj.MatMul_13"
    name: "transformer/h.0/attn/q_proj/MatMul_node_13"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel/h.0: _GPT2DecoderLayer/attn: Attention/q_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\', \'_GPT2DecoderLayer\', \'Attention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\', \'h.0\', \'attn\', \'q_proj\']"
    }
  }
  node {
    input: "v_transformer.h.0.ln_1.LayerNormalization_11"
    input: "transformer.h.0.attn.k_proj.weight_t"
    output: "v_transformer.h.0.attn.k_proj.MatMul_15"
    name: "transformer/h.0/attn/k_proj/MatMul_node_15"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel/h.0: _GPT2DecoderLayer/attn: Attention/k_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\', \'_GPT2DecoderLayer\', \'Attention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\', \'h.0\', \'attn\', \'k_proj\']"
    }
  }
  node {
    input: "v_transformer.h.0.ln_1.LayerNormalization_11"
    input: "transformer.h.0.attn.v_proj.weight_t"
    output: "v_transformer.h.0.attn.v_proj.MatMul_17"
    name: "transformer/h.0/attn/v_proj/MatMul_node_17"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel/h.0: _GPT2DecoderLayer/attn: Attention/v_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\', \'_GPT2DecoderLayer\', \'Attention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\', \'h.0\', \'attn\', \'v_proj\']"
    }
  }
  node {
    input: "v_transformer.h.0.attn.q_proj.MatMul_13"
    input: "v_transformer.h.0.attn.k_proj.MatMul_15"
    input: "v_transformer.h.0.attn.v_proj.MatMul_17"
    input: "v_transformer.Unsqueeze_10"
    input: "cache_k_in.0"
    input: "cache_v_in.0"
    output: "v_transformer.h.0.attn.Attention_18_0"
    output: "cache_k_out.0"
    output: "cache_v_out.0"
    name: "transformer/h.0/attn/Attention_node_18"
    op_type: "Attention"
    attribute {
      name: "is_causal"
      i: 1
      type: INT
    }
    attribute {
      name: "kv_num_heads"
      i: 2
      type: INT
    }
    attribute {
      name: "q_num_heads"
      i: 2
      type: INT
    }
    attribute {
      name: "softcap"
      f: 0.0
      type: FLOAT
    }
    attribute {
      name: "scale"
      f: 0.35355338
      type: FLOAT
    }
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel/h.0: _GPT2DecoderLayer/attn: Attention"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\', \'_GPT2DecoderLayer\', \'Attention\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\', \'h.0\', \'attn\']"
    }
  }
  node {
    input: "v_transformer.h.0.attn.Attention_18_0"
    input: "transformer.h.0.attn.o_proj.weight_t"
    output: "v_transformer.h.0.attn.o_proj.MatMul_20"
    name: "transformer/h.0/attn/o_proj/MatMul_node_20"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel/h.0: _GPT2DecoderLayer/attn: Attention/o_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\', \'_GPT2DecoderLayer\', \'Attention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\', \'h.0\', \'attn\', \'o_proj\']"
    }
  }
  node {
    input: "val_2"
    input: "v_transformer.h.0.attn.o_proj.MatMul_20"
    input: "transformer.h.0.ln_2.weight"
    input: "transformer.h.0.ln_2.bias"
    output: "v_transformer.h.0.ln_2.LayerNormalization_22"
    output: "val_3"
    output: "val_4"
    output: "val_5"
    name: "node_SkipLayerNormalization_1"
    op_type: "SkipLayerNormalization"
    attribute {
      name: "epsilon"
      f: 1e-06
      type: FLOAT
    }
    domain: "com.microsoft"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel/h.0: _GPT2DecoderLayer/ln_2: LayerNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\', \'_GPT2DecoderLayer\', \'LayerNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\', \'h.0\', \'ln_2\']"
    }
    metadata_props {
      key: "pkg.onnxscript.rewriter.rule_name"
      value: "AddLayerNormToSkipLayerNorm"
    }
  }
  node {
    input: "v_transformer.h.0.ln_2.LayerNormalization_22"
    input: "transformer.h.0.mlp.up_proj.weight_t"
    output: "v_transformer.h.0.mlp.up_proj.MatMul_24"
    name: "transformer/h.0/mlp/up_proj/MatMul_node_24"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel/h.0: _GPT2DecoderLayer/mlp: FCMLP/up_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\', \'_GPT2DecoderLayer\', \'FCMLP\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\', \'h.0\', \'mlp\', \'up_proj\']"
    }
  }
  node {
    input: "v_transformer.h.0.mlp.up_proj.MatMul_24"
    input: "transformer.h.0.mlp.up_proj.bias"
    output: "v_transformer.h.0.mlp.up_proj.Add_25"
    name: "transformer/h.0/mlp/up_proj/Add_node_25"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel/h.0: _GPT2DecoderLayer/mlp: FCMLP/up_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\', \'_GPT2DecoderLayer\', \'FCMLP\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\', \'h.0\', \'mlp\', \'up_proj\']"
    }
  }
  node {
    input: "v_transformer.h.0.mlp.up_proj.Add_25"
    output: "v_transformer.h.0.mlp.Gelu_26"
    name: "transformer/h.0/mlp/Gelu_node_26"
    op_type: "Gelu"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel/h.0: _GPT2DecoderLayer/mlp: FCMLP"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\', \'_GPT2DecoderLayer\', \'FCMLP\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\', \'h.0\', \'mlp\']"
    }
  }
  node {
    input: "v_transformer.h.0.mlp.Gelu_26"
    input: "transformer.h.0.mlp.down_proj.weight_t"
    output: "v_transformer.h.0.mlp.down_proj.MatMul_28"
    name: "transformer/h.0/mlp/down_proj/MatMul_node_28"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel/h.0: _GPT2DecoderLayer/mlp: FCMLP/down_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\', \'_GPT2DecoderLayer\', \'FCMLP\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\', \'h.0\', \'mlp\', \'down_proj\']"
    }
  }
  node {
    input: "v_transformer.h.0.mlp.down_proj.MatMul_28"
    input: "transformer.h.0.mlp.down_proj.bias"
    output: "v_transformer.h.0.mlp.down_proj.Add_29"
    name: "transformer/h.0/mlp/down_proj/Add_node_29"
    op_type: "Add"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel/h.0: _GPT2DecoderLayer/mlp: FCMLP/down_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\', \'_GPT2DecoderLayer\', \'FCMLP\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\', \'h.0\', \'mlp\', \'down_proj\']"
    }
  }
  node {
    input: "val_5"
    input: "v_transformer.h.0.mlp.down_proj.Add_29"
    input: "transformer.ln_f.weight"
    input: "transformer.ln_f.bias"
    output: "v_transformer.ln_f.LayerNormalization_31"
    output: "val_6"
    output: "val_7"
    output: "val_8"
    name: "node_SkipLayerNormalization_2"
    op_type: "SkipLayerNormalization"
    attribute {
      name: "epsilon"
      f: 1e-06
      type: FLOAT
    }
    domain: "com.microsoft"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/transformer: _GPT2TextModel/ln_f: LayerNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'_GPT2TextModel\', \'LayerNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'transformer\', \'ln_f\']"
    }
    metadata_props {
      key: "pkg.onnxscript.rewriter.rule_name"
      value: "AddLayerNormToSkipLayerNorm"
    }
  }
  node {
    input: "v_transformer.ln_f.LayerNormalization_31"
    input: "lm_head.weight_t"
    output: "out_logits"
    name: "lm_head/MatMul_node_33"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": GPT2CausalLMModel/lm_head: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'GPT2CausalLMModel\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'lm_head\']"
    }
  }
  name: "main_graph"
  initializer {
    dims: 32
    dims: 16
    data_type: 1
    name: "transformer.wte.weight"
    raw_data: "\311\312t\2743\375\316<\263\002\301\2744\3548\274\274\316\273;&\036K\274e!\332<>\024\227\273P\223 <\264\344\230\274\034\026]\274\247\\w<L\'\331\274\276\201\261<F\312\317\274j=\356<i\312a\274\374\374\252\274vL\216<G\320,\275n-\307<F\314\263;\317t\206\274\341\0038=k=\301\273|z`\274&B\025\275\010\373\032<W\221`<\313\253U\273d\353\213;D\215\'\275\217,L;$\301\261\273l\331\222\272\220\020y<T\316J<\233\"\207<\352\035>\272\337\253\034\274\275\214\021\275\2546\315\274{\201{<\251\267\032\275]\256,\275\373\252\343<\334iq\274\226\006\200<\307\200\252;p\374\311\274\375y\027;U$\024\275\377\001\220\274 \361\t;S\335@<yCk<\007\370\000<\034\211\000\274}\313\215\274\224\240\030;8,\032=\346\216c</\343\355<\253\325\014=\361\214\236<\316\211^\274\251u3;\\\3300;\374\034\255; \342b\274\023\313\362\274\342\364\352<\333\022\220\273&S\277\272|[\222\274O}\213:\037\344\203<\374P\021<\212jh\274\327\274Q\274\351\211\251;,K\013\273\247\325\025\274N\213\322\274L2\373;\2000W;\353\343\333<&\212\346:\236\267\247\274\212\324\177\274i\373\n\273\205z\';R\223\306\274\246[9\274\312\216\350<\303_\000\275\\\334b\274\260\3374<E\277\201<C]\023\274\255]\212\274\307\364\255<D\0221\274\355f\253\274\345\223\224<\376q.<\241n\235\274B\213`=<\022\263<\023\203\261\274\206u\227<\276\371.\274\263\313\034=\364[E\275\315E=<\204\026\236<\2736b<P\245\334\273\001\251\030=\200\3527\274\363\215j<\241&\267<\337(\231\274;G\326\272\277a\202\273}\261\201\274\"\224\006\275\222e\362\273rj*\274\364\255\242:\023\000\245<\004[\202<\342\307\026<\313\257\205\274\2649\240:\030,\\\274\246j\301\273Rr\034\275\3560x<d\274\217<Y\312\347\273\267\2001\272\206.\202\2738A_\274t\004\246;\233\261\014\275\257\241j=\\\327\211<\234\023\300<0\234u\275l\001U\273\307\014\034\275\225\346\377\273\204S\212;\344HR\275n\240\224<\005Ak\2749\250q\274X\353\003:<\300\325:\355\314\022\274\277<\222<\246n\253;8\002Z\274\253P\316;h\030\033<\335G\022=\367\3637\273\204.\275\274\351mB\274\006\014\375<b\211\023<.\272\253\274\020\277\233\273\253\364l:\177Y\023\274\3114Y\274\342=\014\275-g\265<\342q\223<\260\356\001=Wg\351;s\324\256\274\304W\231<\260\217{\273\347\3428<\350\273\033<\274\301U;u\247\t=#\312\365;0 j<7\2052\274\024\025)<\312\225D\275\017\256D<\270\265\232\274\001%\350\273\206G:<UQ\006\274\371\200U\275\313\242\037\275\241m\252\273\"\251m<\245\366X<i\024\000\274\t\313U;\334{(\275\251\2035\274\212\376\254<\325\260\365\274\370\255\0069F\206\024=\332\340\226\274j\362\361\272w<F9\267&A\274YL\215<\201f\215\274o9a\274\036RY;\013\007\'<\256}\240\2744M]:\306\274\033\275r]\377\272R\300\353\273\273\005@\274G\370i\274\024\256{<w\320\031=\342B\346<\377\207\242;]:;<}y\255<\376y\314\274!)\330\273\303\313z;7\033\343\273\265\314\341\2744z\257<%\0042;\316m%=\265;:\274\223#\326;\032\034\241\273y:\005;O\333p<@\256\344\273\202\274*=\330\206\327;`\362\026=\001\325\002:\234.\262\273\265\217{<i\n\027<\333\267\177;\271(\027\275[\0167\274\327\023A<`\0332\274\004\035\234\273\225\322\017\274\nV\036\273\334\023\246<\247\264\032=\307&\000\274 u\230<\360\315\247<`\033&\274\001\t\004\273\010\016\203<\204\365c\273\202e\343\273o\3131\273I\223[<]\353\250;\224aj<\320\000\037<d\235<\274\355\353\023=\246#\235\274rN\000=\363|q<W\224\323<\t\017\022=5\347\355;\213\251J=\326\311\257\270\361} \274\347\030\"\274iN\036\273\226p/\275\205\375\305\272\353W\n<\3164\227<\261\345\013\275\220\264p\274\252\\\017\274i\020\312:\276Xp<\231\261\304<\330\310C=\023\217\007\275P\377\376;V\250\234\273\035\203<\274b\337\265<\001.\364<y+\204<\335\232\r\274\251l\367\274\364\n\003\273[\305\036\275-&\250<\006\254\277<\220-4=\025\266\302\274%\210q\274\213`\2108\347O\262;\220\264\200\273\315\246;<\262\302\030=%\270\277\274\302\246\n;`bC;\357B\211\272n\007\373;p\230\255\273\004\362\013=Y.\354\273,Pf\273\331\200\"\274]\336l<\230\325\344\274\252H\314<\027\022\024\274\255{\200\273\333\032\272\274gU\336<\373\234\004=\315RL\274\217\275\n=9e\007\275F\210\333\274~Q\331<\202\207\314\274\'\236\240<\374\273W\274\201L\255\274O\235\025=\302P\250\274[\210\355;a\371\263<\200\212\367\272\205#\332\273}\207N<\342c-\273\033\3074\274\266\354\245\274*_\002<B\227M<\260\325h\274\'\206\310;\355\236\212\274\362L\326\273 \033\351\274A\364\374;*\022\275\274-\342\243<tO\034\273\235\027a=\304\314\030\273\335\332\001<\371\364\250\273\"}\233\274\245\'\312\273\336\325\356\273D\036\216<G\352Y\274=\341:</\274O;\245\242\243\274g\353w<\313\256\364\273\305r\356\273\367E-=p\304\'<\227\202\004;w\342\020=\317\226\212;\t\372\310\274\316\006\332\274E\t \272\260\036*\274\013\264\247<-\213\312<\275\016\025<\346V\245<\335A<9\317\262\375<\371E\003\274F=\300\274=\037\217\273\002\373\300<\"\242!\274am\266\272\353\351\364;\031\370\027\275\366c\023=\207\327\215\273\220W\222\274\036\343\226<\2453\201\274\221\333\235\274\347\202\007=\331s\321\274\2051\255\273\270\032\365<\306\310\221<\200\332s;{\2302=e-[<I<\010;\361\301\227<\374\005\250<\256%\232\273\3561P\274Y#\241\274\200\240\262\274R\252o<\'\224\216<\325\260\325\274\017\202\341<{\316\355\273\326%(\273\276\351\271<\251]\240<\027ek<\374\364\307\273.\365K<\027\330x<[\3319;nFj<\213\305\336<\364R\336\272\035\316t\275`<M<\232\000\025=2\r~<\0029-=9\200/\274j\241\277\273\246\327\010\274\236-.<\276\303K=+\324X\274\252\001#;\223,<\275\333[\201\274\315\361\236\274\263\340r\274\362C\234;`\010\271;X\365\226\274\324\307_<Q0#\274\204\000\241\274\273\275\225\272<\275\346\273\221B\216;JfE\273w\331\"\273\304f\244<\300\177\257\274tT\347<\322?3\275\224\203f\274\242\307 <\353\346k\273\301_\241<\365\366\242<\241\273L\274\236\344\255<\253\376=\273\364D\021<N\363\\\275\373\217_<6\030\212<\373#\374\274\202\212/<\023\271\366;r\323\r=\34516<Uc\315;1\263\013\274\245\342+<\314\252\2049\251h\374\272\262\233\221\274y\271\311\273\000\304!\274\031c<<3\300C<!\023\264\273\315\032\311\2748UY:\306\366r\274)\347(;3 \244\274\253\371B<g7\010="
  }
  initializer {
    dims: 16
    dims: 16
    data_type: 1
    name: "transformer.wpe.weight"
    raw_data: "J\313=\275\346\204\345\274\244L\337\273\307\\e\274b\317><p\017T\2752\311\216\273[V\221<\242k\340\274a^l<B\007\226\274\0068]\274\347T\277<C\177~:\242pI\273\3043R\2720v&<]oB\274\276\010\236\273>\325\303\274\360,!<\320._\274I<\330\273\025\373\267\272\210\334\227\274$\002f\273S\313F\274\224=\316<\230E\2579\246\000E=\033\021#\274\331\210\230<X\222[\274\r\231\201\273\205b\355;f \014={e\302<\256TG\274\367\216+\274\rqB;\204\332\332;\363\363n\274\031<\332\274\'=B=\n\225*\274\225\0205\273\240\231\t\273\334\365I\274\304pC\274\350\324\200\274\323\236\245<R\212L:\333\227\024\272\373\375\327:k\027\277<\244<O\274\220w\301<]\"\254\272{\003\020\270\251Z\363<\234(\244<\203\\\370<b\364\355<\035\237\016=\271\253\203<\205\010\226<\257\204\034\274oN\303\274\363\033\007<$Y\235\274\005\3354\274\237\246\007;\362.\202\273\365\355\272:\\\263v<}o\024=\207\317!\274K\006\246\274\344\323W\274\036d\343<\371\345\350\274\345\210|\274\223\'\340\273\365y\037\274\241G\321<t\360\026\273\224R\330<\233\"\317;\227\230\205\274y\023\311\274\266x-\274Yj0\273\023\363e<#\272\352</&\205\272\235\003\323\274\230\324\262\272\252\207\354<\242l!;\317\031j\273\362A\332\273\374\203\342\274/\017\036=\253o6<\231V\371<\305\355v<B\364 =\263\037z;\315\377A\275*\307\211=+\033\235\274\266\362\201<(\242\001;\013S\010\275\023\374\230\274\212p6\274y\336\3259%\334\363<E\350e\274EoQ\274\363<\202<\230?k<\324\253\301\273f\340<\271=}\346\2747\350\226<x\210\036=v[\237\273\345\375r\2752m\305:\307\235\375;\236\210\021\273!\232\025;\373\266\022\274\266\334\037;\3263\022\274\270W\325<\211\235V;\341\302(\273%\247\374<!\262\246\274\214\326\334\274\252\230P<\241\262\256\274-H\2579gx\212<8c\364\273\r\215-<\235\320\025<\022)5\274f-\217<\345tP=7\272\263\274\374\212\231<,\027\232\272\307\252m\274>\001\270<`\344(\274\275t\233\274/\036\250\2743~\366<\215|=<e\227C;}u]\274\316\363\021=\255\243!\274\014\232^=\211d\002\275)\030\371<\356\346B<\342\200\270<)t\002\275\204\031\033\274\223\257\316<\306\250\353\274=}\365<\205\361L\275\353\3524\274d\273W\274\266\032\000=Y\333?;7\267l=\225F\025\274\2257\327\272\356\343\"\275\025>\367<\202~\315;L\304\346\273\006\274\277\274k\r\006\275>\200\375\274\003\374y<S$\021\274\202I\035=\tS\363<\3578\262\274\336\335\301\274D\357K\273\302\310\030<\024V\253\2739\232\373\274\251\322\260;\326\320/\275$^\2558\344\032\";=\036\030\275\224|\t<d\035\230\273X\263i\274\256\252\277<=\226C\275\267\034\377<\005\t\302;\274\363\342\274\215\274\010\275\246\027\323\274t\224H<\320w\257<SUF\274V\230\216\273)\002i\274+\035\275\272\265\367\265\273\323\n\236<\022\034\207;\'\032\017\275LQ\374;\017~*;\013$\222\274<3@\274 \033\234\274\335N\342;\271*\332\273\"\032\245<n\347\211\274U\311\357;\325\325\031=\335v\"=\227\314\266;\331\247e<\000\r\334\273d\037\030\274\205\200\257<\025\350\324<\231\271l<\240\026j<\020\312`\274\252\342\254\273\2354\212\275\017(\000\275\245\333J=J\0132\274^\336\353<&%\001=\313e\332<\311\034\203<"
  }
  initializer {
    dims: 1
    data_type: 7
    name: "const_1d_0"
    raw_data: "\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "transformer.h.0.ln_1.weight"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "transformer.h.0.ln_1.bias"
    raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "transformer.h.0.ln_2.weight"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "transformer.h.0.ln_2.bias"
    raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 32
    data_type: 1
    name: "transformer.h.0.mlp.up_proj.bias"
    raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "transformer.h.0.mlp.down_proj.bias"
    raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "transformer.ln_f.weight"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "transformer.ln_f.bias"
    raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 16
    dims: 16
    data_type: 1
    name: "transformer.h.0.attn.q_proj.weight_t"
    raw_data: "o\036:\275\275\335\307<\336GF<\207\034\"=8\262\322;$\205\t\275V\303\220<\3000\r\274\373^\250\274\241\271a\273r\274\237;\264\345\3119\267\330\252<\362\251\016<..N\274\317|&<g\301\310;\223\372.\274\376c>\274\3139\"\275d\023:\275\251\264\227\274\233\352\027=\254\340\177:^i\014\274\022\336\222\2743\226\341\274\213M$\273\267\373\264\273\241\r\306\274\035\376\261\274p\374\251\274\363\335\351\274\030\014\212\272e\326\371\274\246?\236\273O\034\230\274\362\236q<\230\314\31399\377\300<\211_\202;!\005\236\273\331\366\236\274)\360\261\273\351@\363<\353\262\266;P|\212\274sn\021=\204d)\274\340E\271<f|\244\273kZ(\275}\263\310<K\216\200:j\\i\273\357`U<\365\303\326<\217\306\032=\364\207T=\304\266\272;%\026\357;\260\256\351<\373\026\n=K\343\247\274\245\371\320\274\271q!\274C\025\000\275y\350D<\240 \325\273\257J\255<}\213\010\275o\210\201\274\341E\352\272\356\203\207<\344Q#9T1\304\274\"%\001\274\022\351\255\274\356J%:)\245 <\205.\302\274$\370\316<\236-\332\272L\246\345\2744XN\275\211\025\007=\2525)\275\336%\232<\320\243Y;\034\256\375\274\363\'\303<\371\307\251<&\ts<\367\033u;\322\347\226<\005\035\272<V\277\206;}\002Q\274$db\274{\205J\275\035Z]\274\360\344\353;\020\307\\\273\'\212\217\274\206\3334\274JMN;\001\341V;\022\320\271<L\267\232\274\217\000\253<\3700\324<6\322\211\274\312\216?<\2202~<\026@\217\274\335\357<\274\274\305\324;\240\245\000=\031\244\277<\331\327R<]nS<a\205\352<\362j\312<\023\217\370\273\212c\205\274\366\001\251;X\200a=\315\274\023<\211\273\321:\225;\033<\031\304^<3\335\375\273\267\262\206\274\357E\204<\377)\225<\0340\226\271h\327\016=\362\351\356;\201\246\323;\247\035\342\2737\027\027<\267\037i\273\302\367\217:8\252\201:i\034\241;AY\274\273$/7;\307\335\031<\373\355\337;G+\014=\300\234s\274\357><\272\333\371\274\274\377\236\214;\2575\024<\263\306\200\274\201\326X<\313\364\245\274\344X\214\275\364\304\225\270i\371`\274\035\014\344;\245\214F<\217Z\315\274|f\252;\360\277\017;3$\261<\006\341\265<\000\233\271\274\253qj;\345\363\034\275\275\251\000\274 a0\274f\241\314\273O\233!\274\324T\036<\216;G\272\301\307\313\272}\370T\275\025\000\267<$\270#<|\\K;l\331`\274\222O\034<&&\026\275\215\237\204\274\273[\031\274d\243\020=\327\205\340\273\222\"t\273@u\275\274\257\225\020<*\336\352<G\355 \274,\340\332<u\256E\274\215\031%\274\230`\362\274\366\231\222\274o\331b<=}x;\344\226\210<\204\230\230\274\340\025\376\273])\213<\3477O\274\207\350B<\207\354q;4\354\346<\312\360\357<\331)\221<\352-\303\274\034\230\366;KEo<\247\035\"\274\202X+\2755\0344\273@\345!<\362\207\010\272\'\224\351\272\032h\220\274\025\300\331<B\"\026\275r\rW\274\213\027D\274\207\3214\272\271f\350<\002T\251<1\305\202\274/\265\257\274A\313\320\273\231`\330<\351c5:\247K\t\274Y\266\245\274VY\003\273\273\320\266\274\357\363\205\274.T\340:\376\361\301<\t\330C<>\215\240\274\246t\232;\001\241e;\007\371\206\274(\372\205\273\216\r(;xk\324\2749\261\010\275\376\346V\274\316\252\336\272.-\310\273\026\234\251<]\307\272\274\260j\014=\300\371\034<"
  }
  initializer {
    dims: 16
    dims: 16
    data_type: 1
    name: "transformer.h.0.attn.k_proj.weight_t"
    raw_data: "^\227|\274W\373\211<P\221\357\273\000%%<\347\241\214\274\226E\t<;\025\277:\302Yb;\277\024\005=\\\315\377\273\316\tJ\274\224\264\321\274k\301n\274>\304\263:\221\n\202<\342[Q\274~Z\274\273t\030\254;!\353j;\343\272|\274v:\230\274+\035\037\275\217I\020\274\217\212f<\326\207\n=\024s\026<x\220\262\274-\037\014<\351E&\273\264\250E<7\237\030<[\301\220<=\263\303;\217\2522<\t\246\221\273\242\266U<\2026#<\315\364\001\274p\246\037\275\2208V<yY\311\2743i]\274\351\n\251\273D2\032\273)\343\274:\316\277\270\274D\267\000=\342 \033=d\216\037\274\3666\025<\275^q=2g\341:R\356\304<M\365\244;)\220\030=~\214\203<\365I\374\273_\035\002\275\332\340\022\275\215n\020<\276\367\243<+\221#\274\364\276\013=\347o\305;S<f\273\2551*\275\370wk<@\345\001=\201\225%<\352\310x\273\366`\010\275f\301\322\273e\310 \273\274\335\327<\244\201\264\273\344\377H\274nk\354\273\344(\"\273RD\316\274\220*U<\220S\027\274M\017\234\274\233\373\216\273*\220\234<\234?\252<g\306\000=\256\375\031\275\3027L<D7R;\023\243k;\373N\243<g6c\271\267\215\017\274\242\006\227<\262\345\242\273\035\206\263;,\343\325\274\335m\267:E\240P<\233r\210;\250\244\240\274t\213\342<{\240\260\274\304\275 <2\'\311\274C6\177;\273\001\243\273\202\274\377\274\025l\305<\031K#;sZ\312\274p.\241\274|\220\325\274\226\267\017\275mh/\275\357\270\220\274\263|};{0u\274\271\344\024:\331\360\n\275\334\243;\274\021m\002=\2671f\274cv\221<b\267?\274^7\316\274\007\0348;El\254<\317\2202\272dY\206\273\202sA\274\252.\307\274\204/E\275T\032\241<\'Q\273<\320.\023<\002\354\007=w`/=t0\362\274\251$\000\275k\347\263:^\300\354\2749\356\001=3\216I<[\202\300\274\013\342\247\272\316L\035<\233l\202;\007}Q\275\220\035\036=\001c\254\274\245\323\243<\313\257\201\272\\\036\336\274\036\035W\274x\320B\272;\010\334\274\300\363\213<\001\343{\2743%\263\274\357\344\020\274 UJ<\0267\242<\025Z\301<\374\023\032\274f \367\27421\'<\277s\202\273A\'H;\206\253\221\274W\246\226;\263+\003\275\353+\277;E(D\274\317\326\"\274\362\210\221\274\224P\034\274U~G=\\\313\270\273\360\213&=\344\026\307\274\276{\256;3o\314<y\021E<&+H\275oJ\266<~\243\315<\311\323\304<\371\324\274;\364\205\276<;\323,<\325\373\217\273\031\025\253\273\247\271!\274j\251\314\274x%\253\274\022\365c;4\351\334;\346\210L\274\367V&\274\277\245\013\274\027\304\236\273\340\257\013\275dR\330\274O\r7\274\254cV\273\315\307\241<\247o\277<\351\033\323<\364\351\326\274\354&\034=\351o\246\274{\301P\274\341\006\3639{\243C\2748A\255\274m\262\304\274\371\345\215\274\333\022H\274.\217\261\2742_\351<\200\"\314\273\275\351K<\005\354\226<\363>\211\273]\207 \274n\360\264\273\342\034\253\272\356\213B\273\036\217\311\274A\305A=\317J\010<\213\251\250;\335(\014\274iZ\265;o\006y\274\354\360\\\273\252?\021=\320\007m\271\202\362\254<s\226\325<\017\362\221\274R`H\274-\210+<\300\3041\274 g_<\251\316:=s\335\300<\000l(<nJf<a\221A\271t\374);Bfa\274\270\3264\273\3369\000\275\364EO<"
  }
  initializer {
    dims: 16
    dims: 16
    data_type: 1
    name: "transformer.h.0.attn.v_proj.weight_t"
    raw_data: "[A\275\273;\210\336<F\330\035\274t9\265\273\320\347+<+\223\314\274B\243$<W +\274}\363\000<\275U\307\274O\274\315<\177\367\037\273\310\376\000\274i\210.\273s\310.=\206\301G\274\257\207\020<\353\2318\275\215\364\023\274\302\003\013;r\315\363\274\017\2660=\344\317H<\034\354\324<\374\242#\274\310\311\010\275\006\333\302<\330_\035\273\207\312}<\3315:<\206Z\373<\216(\324\274[\325n\274jJ\211\271\202\354X\274\341\273b\273\344\202\004\275KC\364\274\334O&\273n\257D\274J&A<\306^\214\274l\363u\274\2017\304\272Iuj<\240\'\300:\317\356\302\272\271\236\027;\357\'\216\273\266\314\244<\000 \010\274\320\376$\274K\032\331\273\363\001\200\274%X\203\267\315\221\241\273\375\210\247\272\251\'\031<\224\327\030\275++\234<I2(\273G\341\213\273\352r\303\274&\313\257<\317\272\371<[;:<\302\032\037\275o\351Y\274\331\024\037\275\017i\006=\345\344\215\273(\312\023\272\363\006\311<\305n\250\274\006[\006\275\211\214\\\272\300\263\344\272\234\3762\2737}\347\274v\n\251\274\375\003\315\274C-\025<\224\352\376\274\215\311\270\274\204\032\307\274\207\016\377<B\364\321<\373%Z;\014\335f\274\256O\310;\271\004\237;\353o\325<\333\320\220\274\231\367\356\272~p\354\273\333\252\327\274\341(U<\264j5<8\034)\273\327\331\032\275^V\270\274\2318\000<\206\020k;N\231/\274&\305\201\274\235\273#\275\353C\237<8\201\352\273T\177l;]\307\230\274m\361\016\274\013\034\202\274\004\315/<d{\214\274\357\221\202<8j\321\274$\207\214\274I\217{;\235\r\037\275\3351\323<\226\272\001\274\3143\364\273\314\242\177;\036\t\016\275\246\354O<\267i\223\274\227\313E<\227\243\t<\277[\007<\326\310\023\274`\033\231\2749)\014<\260hR\274;b]<\231\352\206\272]\\\270\272\273A\336<dX\310\274\257s\035\275f\267^<\234[\014<\334\233I<t@\203;\n\317K\274\2135\223<\340 \016=\345\234\021<\020\221\020<\306\374~\274O|\216;\235P\312:\315\027\034<\242)\021<P/\021\273\260$\376\274)\377d\274\346M_</A\340<\3249\2219\245\220\301\274\354\\[<AA}\2740HK<\254\004\021=\253\322>\275@b\216\272\324:\277\274dj\347<&\377\346<\351\023\251<\341\004\001\275\257P\221<$\301\250<\235e\250<\277\327\002;\306\034\233<\227G\377\273\244\234\n\274\2333\r<\211\363\355<\\\250\340\274\013\232\017\273\322\317\342\274\336\007\313\274\360X\022<\357\003\205<\016\032\272\274\324\345\246;S\254M<4\021\200\274=\022\210\274n\203\027\275\373\317\017=Ew;\274\3618\013=\235~7;i\250\027\274\327\250\374\273\271\246\315;\371\267[\275\006s#\275~\027\323<\367\342\002\275n\255\222;>,\261<\030Q\252<+j\341;\362x\333<\251i\225\274\266K,;\214\271\214\273PdN;\213@\304\273\007\215\036\274-\\\237<\227\324\007=\301\032\334\274\024\223n\274\201\235\327<2\2158\274\206\367 <\013\275\353<\023E}\274\364\253\223\273\330\030E<\247\004\361<l\222\364;T\005\220:\312O\336<#Ai;l\265\216\274\367\000==\220\350\r\275\036P\317\271pl2=g$\252<\311\001\362\273\224\2768:\302\273\177\274\356\301f\274$\256U\274\233ce<}c\n=\033\254)<\335\277\037\274\025+\010=\006\t\232;\036S\314<\344S2\272\264\017\t\275e\253\371\272\336\013C<\306\003.<\0276\377<GG\225<.j\273<"
  }
  initializer {
    dims: 16
    dims: 16
    data_type: 1
    name: "transformer.h.0.attn.o_proj.weight_t"
    raw_data: "\333j?\274W\312(=\274\250R\274\306\204\301\273\247\372\246<\2234\357;=\373\325\274w\243\371\272\251\030Y\272aR\350<C\356\226\274\302l\253<{C\277<\253j)\275\362\200\201\274l\220\037\274\307\335\207\274B\266B\274\031\2728\274\265\240_<\234\357\3739G\t\276\274\247\032\316:\202(E\273\252\214\314\274\301\342\366<\256\376\335\272\270\013\022\274\313\300\003\275\232\205\014\275\367\027\223<\357\004\365\274\277\007#\275r\000\321\273\2574F=\234{\242\274/\000\250\274\200\n\025;\324H\"\274/\31358Sf\376\273\235o\260\274BW\256\2737\331\253\274U\375\273<\227\304B<\230\003\\9\316\237\210;<X\340;\0006e\274Sb=<\005\212\335;\246Y7\272\2073\252<R\225^\273\234\362\247<.\273\237\274#\351\373\27341G<\'\224\010=\206J\262; $\333\273\247\177\260</Q\345\274)an<\220\367\260\274\335\300\241<\3119\354;G\350\020<\013P\326\273w\261:\275\376\203\374<\214\004\324\274x\037\'=\311\t`<\020K\371;\233\257\367\266;\364\023\274\251\351f<\027A1<\316B\217<\223\234\266\272\367\256\247\274b\322\021=\256Y \275\346d\344\274e\275\346\273W\256\035<\300\230_<\332/\234\274MuF<l\030^;\035\024\307<@\000#\274r\361\356\274@\331\203<D\'\231<\374{\001\273\334\216~<\202I\031\274\236)\r\274\241\351\200\274\242\177H;\352\200,< \367\374<\227g]<&K\004\272\255\355\001<\366<\000<(\027\022=\312\265\"\272\344>1=;`o<\273\325\206\273\2628\214<\335\260\275\274\322\322\301<|ue\273D^M\273 \004\232\274\306d\336\273\262\202w<@l2<X\315\'\274\300y5;\tK\265<\305\336<;i\303 \272\223\036G;\204\355\231;\200\006W\274\203\240\234\274\220\226\225\274\306\027p<\333\0223<\374P]\273\336\2225=\0330\030<\222[\032=#\223\355<\017,y\274n\n\217;\351\204K\274\211\306\310<\377v\025\275uB\271\274\317\210\\<\342\334\226\273\247\022\251\273\205]\031\275\034\317F\275]\312\250\273\245\360:=\225\313\372<\204,\223\273\264b\247\274Vt\003<\3401\277\274\"\323\337<\362W\374\274F\030\002<\312\330e\274h\223\017;\000y\371;\002\352\241\274D\367\201<#\313\350\273\256\344`\274P\254\006<\004<\330\272>\374\304<\247vu\274\376\013P\274\317\201\024=\270\256K\274T\n\237<)\254\235;\360\2422\273\271\022\207\274%c/\275v\225)\274\220;\311\273\327\320\337<Jp,=\362\2559;\001\251\006=\327\032]\274\257\315\243;S\322\254\274\202\274\270;\311\212\007<\230\002\231\274M\360)\274\3534\317;\336r\344<\312\214f\273j\023\352<\243\027\230\273\264\220\267\274\234Y\232<\206@\t<\364\332J<.\216\273;\013\276@\274\305\002\203\274J\"\004=\336/5<\262\316\237\274$\271\222<\'\200\231<\027\350\376:\263\232\311\271\265s\326<\2274\232\274i\204\234<6\221,<\327\252\035\274CA!\275\022`b\274\236\262\343;\262\273\277\273\3559\223<\240\2160\274\004=\252<2\257\257\274\271\372\035\274\302]f\274\300\325l\272\002\251\340\274+T\205\274i\204E\274r-&<\375L\305\274\330\367/\273\202\341\330\274\366\370/=Sc/<\264\216\237<\217\020\356<\375\262\2209$\275\036\274K\033c<I\261\026<\2529R\273\351\255\211<F\240$\273\350\275\210\274\005g\362\274R\341\212\274\240\320\235<\370p\275\271\334E\"\273[Q\373;\017/\275<6\\\006\273|\010\016\274"
  }
  initializer {
    dims: 16
    dims: 32
    data_type: 1
    name: "transformer.h.0.mlp.up_proj.weight_t"
    raw_data: "g\005%\274\217\351X\275NH\207\274\013\236H<\240\n*=3\374\325:\3359\r\275\027\265\372\274\301\343_<\360l\342\272\036\301\257<<\310\177\272\355\244@\275\376\217\303<\016\301Z<\211\343(=\263\305\237:\300\303\246\274\313qS\274q[\206;7\277\213<\037\205\223;\206U\200\274\304\032\004\275f%\007\274U\026\215\274\242\235W\273[\274\346<\245\036\237\275;o9;r\315\207\274 \271\214<,\034T;[a\032\271\212\371\320\274\271\260\350\272\305\252-\274 \317\035<\223\3303<\216\354\371\273J $<WC\274\272\022\202\023\274\252a\037\275=+f<)7\227\274\242R\331\274yhR<\017\000\374<|\237A<\217\004\215\273i\251\024<\006b\020\275\"\030\360\274s\260\214\273\367\330\207;4\345\225\274\265l\262\273\347f!<\311\333D\273\306@\364<-\314\272<\351h\245<\355\332\000\275\306?\206<\"\3346<\rQ\216:-\034\264\274\265\302\330\274\207\301\024\275\210\311\032<\310\351\234\273\252\326J=\212xx\274T\230\276\274\002\316\234\274\302\224\252\273\213\333\357\274\005\030\354\274\252\367\357\273f&B\273\371F\357\274\206\327/\2740\023\026\275!r\313;\271\207\266<\302Z\010<\250\303\020\275\212\274c\274\230\373n;\246\233i\274\352\331N;\227\262\r\274e+v;y\036\233\274\301\346\206;\235\271x\273 9\214=\360\206J<&\370#<E\302$\274\247#\035<\2271\027<y\'\275<\273\t\371<\031\n\300\274/\331\341\274\376\210\002<\231\226\224<\024\221\020\275b\001\232<\rm\247\274\022$\316\273`\340\257<i\3757;\033\212\206<\362\300\320\273\357\027\240\274b\025\277;\346\235\004\274\364\241\320<i\242\375;? !=o+\240<\022\300\331:\330\253\310:\026\000\232<\016);\273q\360\014=\273\273k<\031G+;\035\344\363\273\310\263\002<\204\2010\271\t\023\240\274-\230\241\275\2578\244\273\013\346\203\273\240\255\203\274\226t\260\273F\215h<\274\006\000\275I\014\330<\366\003\001\275\342\333\n<I\361\227\274\355:\272\270\324\016:</\017\003\274\341\300\003\2745\326>=\323n\023=\362 \260\273\026\324$<\336\267\320\274\005\215\032;\360\222\030=g\211\r<7\211\347:NW\032\275\327\333\317\272m\305\000\274\377\342\030\275iZ\277;\317w\260\274m\204\230:\276\007\252\274\002J\215; >2\274\273C\231<\340\016\340\274\255 \007\274\225\312\177\274\212P\310;m\036\207\274\241\221\253;\026Z\030\275\315\272\304\273\212\006<\272\250F\203\274/`\261\2737qI\274\024\030P\275\014\234\342\273$\352\272;i\222\255;\233\357\361\2738\245j\274\341J0\274Z\235\036\275\002\t\257<\331\346:<\006\007x\274\030\256\271<\224\326\252<N\272\202\2744&L\274\005\346=\275\260\2225\274\326\240+<[r\274\273~\347\366\274\'\271\200<\214\307\001<TQ\027\274&\355N<x\277*<9\030\202<.\205\324;\020\300\362\273f\320\303<\231<\265<\007\020\016<\007:%\275\271\322i;\\`\031\271\336\226\254\274\035\020\276;\264\252\250<\"ym<\017\330H=e$I<\213M\272:\014\\\377<\331t><\213\2675;\030\r\220;)\251\306\274\203\025\"<\\p\016=\312y\022\274\1777\"\274\373\003I\2732\204\325<\034\377E\274\0243\246<\333\000\023\274\230\276\221\273iaY\274\000\232\224<6\313\000\275eqb\273G\336\016\275\327\r,<\202\204\260;\267\014\031\274\257\212\213<\270\376@<\322pO\274\231\30617P\270/\273\341\361\307:\002\034\244<\374bZ<\317W/<\300c\003<\223Xt\273\202\315\006\275\207l\026=`{E:p\3218\273W\326\347\273}\315m\274\302\235\336\273\235\313\215<\212\004H\274\026.\034\275\377e\006;\200\t\277\274pmy\273\312\257\007<v\345\006<\036\237\030<F\331z<.\312\242\273\033\242\020\274P\205\262\274a\025\270\273\240;\267<tO\227\274\317\330\224<8\305z\274\347\374\331<i\\A;\274\230\t=\322i\222;\210\324\037<T\356\013=\014\261\316\274\227\305\224\272;\245\270<od\325;\001\354_<\026\014\"<\362\305\006=5\303\215<\034X\"\274&\021\225;/v\366\274=\361x\274\307\335\203<\356\332h\2740\341\177\274E\027\342<K^\314<;\326\375;\204\345U<\313\331\210;\025\016\370\273)\n\354\2746A\245<|\312\226\272X\360N<\267\266\321;j0K;G\230\236<k\252S\274B[\304;\332=\022\275:\303\202\271+\261\004\274\215\303J<\311\355\240\274\215\213\246\274\205y\247<\233\313\206\274\226\263\022\274i\037[;%2G\274\242\020f;\233f\261\273\221\342\216<O\017\326\274\237\302\023<\227,\373\272x\240#\274\224\245F;\235\267j\274\3379\202<cFu\274\\o\333\272%q\346\273]\\\331;\347H\206<\272 \025=`\275g:`\232\023;<\370\003<\212\023p<\347\316\321<\2020o\274\036\263#\273\216\274\246;2l\334\274\"5\214\273\n\312I\274B0\205<\241*\236:*\211\270\273\360\"{<\240\317\023<\300\237<<\313\362\304\273\005\277<<S\277\331\273\352\330{<#\310\362\274\260y,\274\361i\216<\033\356f\274\264\346\234\274\327\373\006;\374f\202<0\r\001=\312h\236\274\271\022;\272\340s\013<H)\036\275k\370\217\274R\361\225;nB\203\270\301\"\374\273~=\214\2747\216\220<Ps\t=\001\223\355;\224e\221;\205\356\246;A4p\274\371\025\177<\355\025\240\274\333\275f\273&\"h<\035\332\312\274\300e\214;\226\364\244\274\322\262\003<\271&+\274\240\014y\2749P\037<\374\272\002=P\241\362\273\370{\342\274XL\005=\',\371\274@\264A;a\320\260:\010\225\211<\243\006{<\236\307p;+\255\346\272\227Il\273\340Ei\274\213\2613\275w\226}\274N\353\375\271\245\2572\275\271\246\000\274P\231\321\272\2576.\274\360}9<{\266\323<\216$\000\273?\346\240\274ly\231\273\362\230F;\335\3233\274!2\223\274=\235\330<r\253\021\275\311\266\232\273\275+=\274y\021B\274\353\030\004\275s\0372=\306\352\027\274\\\341|\274\270:5=\335\314\035\274\301N\351;\024\255J=m\224\204;\206\331\013<\306\030\033\2747\026\020\275^[\263\273\257\273\274\274\324\302D=\016\324\250<\003!k\274\2234\300<\214\321\016=.zT;\031\241\236<|\226\206<\260^\215\274\360s\220;\360Z\255<f!\356\274`\262\212\274\270~_\272+\270\352\273\004\016\337<\"\302\223\274\320\334\307\273\314\256\025<\256;\266<\000\277\337\274\245A\244<2\260\323\273B\211\225<\214\\\347<\247\246\226<\034y <+\214\334\273\333a\016;\3244\204\274\260\0001<\304\366\r=Ko\317<\251z\327<\t\212+=\251E\006\275\323\002\211<jVx\273pf\360\274@&\002\275Rc\261<\303,n:\035\317T\274\211w\020\275\220\316\202< \021\355\274\276\210{\274\013\260q\274\275\232&\2734\271\221\272\3762\001<+\r\303\274\352\026\336\273\007d\323\273\237#\221\274\315\304\021<\345\304f\274)\340t\2747\\C<\000\247\036=\313\316r\274\020\365\300\274\224\257\025;\252/\264\273`:\007\275"
  }
  initializer {
    dims: 32
    dims: 16
    data_type: 1
    name: "transformer.h.0.mlp.down_proj.weight_t"
