ir_version: 8
producer_name: "onnx-genai tiny-whisper fixture"
graph {
  node {
    input: "input_features"
    output: "features_time_major"
    name: "node_Transpose_0"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      type: INTS
    }
  }
  node {
    input: "features_time_major"
    output: "mel_mean"
    name: "node_ReduceMean_1"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    output: "pair_shape"
    name: "node_Constant_2"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 7
        name: "pair_shape_value"
        raw_data: "\001\000\000\000\000\000\000\000\004\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "mel_mean"
    input: "pair_shape"
    output: "frame_pairs"
    name: "node_Reshape_3"
    op_type: "Reshape"
  }
  node {
    input: "frame_pairs"
    output: "frame_mean"
    name: "node_ReduceMean_4"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  node {
    output: "hidden_shape"
    name: "node_Constant_5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
        name: "hidden_shape_value"
        raw_data: "\001\000\000\000\000\000\000\000\004\000\000\000\000\000\000\000\004\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "frame_mean"
    input: "hidden_shape"
    output: "encoder_hidden_states"
    name: "node_Expand_6"
    op_type: "Expand"
  }
  name: "tiny_whisper_encoder"
  input {
    name: "input_features"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 80
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  output {
    name: "encoder_hidden_states"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 13
}
