ir_version: 8
producer_name: "onnx-genai tiny-tts-nested-prefill fixture"
graph {
  node {
    input: "codec_embed"
    input: "frame_codes"
    output: "gathered"
    name: "node_Gather_0"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "sum_axes"
    name: "node_Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: "sum_axes_value"
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "gathered"
    input: "sum_axes"
    output: "codec_sum"
    name: "node_ReduceSum_2"
    op_type: "ReduceSum"
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "codec_sum"
    input: "text_embed"
    output: "inputs_embeds"
    name: "node_Add_3"
    op_type: "Add"
  }
  name: "tiny_tts_nested_prefill_step_embedder"
  initializer {
    dims: 64
    dims: 8
    data_type: 1
    name: "codec_embed"
    raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\000@\000\000\000@\000\000\000@\000\000\000@\000\000\000@\000\000\000@\000\000\000@\000\000\000@\000\000@@\000\000@@\000\000@@\000\000@@\000\000@@\000\000@@\000\000@@\000\000@@\000\000\200@\000\000\200@\000\000\200@\000\000\200@\000\000\200@\000\000\200@\000\000\200@\000\000\200@\000\000\240@\000\000\240@\000\000\240@\000\000\240@\000\000\240@\000\000\240@\000\000\240@\000\000\240@\000\000\300@\000\000\300@\000\000\300@\000\000\300@\000\000\300@\000\000\300@\000\000\300@\000\000\300@\000\000\340@\000\000\340@\000\000\340@\000\000\340@\000\000\340@\000\000\340@\000\000\340@\000\000\340@\000\000\000A\000\000\000A\000\000\000A\000\000\000A\000\000\000A\000\000\000A\000\000\000A\000\000\000A\000\000\020A\000\000\020A\000\000\020A\000\000\020A\000\000\020A\000\000\020A\000\000\020A\000\000\020A\000\000 A\000\000 A\000\000 A\000\000 A\000\000 A\000\000 A\000\000 A\000\000 A\000\0000A\000\0000A\000\0000A\000\0000A\000\0000A\000\0000A\000\0000A\000\0000A\000\000@A\000\000@A\000\000@A\000\000@A\000\000@A\000\000@A\000\000@A\000\000@A\000\000PA\000\000PA\000\000PA\000\000PA\000\000PA\000\000PA\000\000PA\000\000PA\000\000`A\000\000`A\000\000`A\000\000`A\000\000`A\000\000`A\000\000`A\000\000`A\000\000pA\000\000pA\000\000pA\000\000pA\000\000pA\000\000pA\000\000pA\000\000pA\000\000\200A\000\000\200A\000\000\200A\000\000\200A\000\000\200A\000\000\200A\000\000\200A\000\000\200A\000\000\210A\000\000\210A\000\000\210A\000\000\210A\000\000\210A\000\000\210A\000\000\210A\000\000\210A\000\000\220A\000\000\220A\000\000\220A\000\000\220A\000\000\220A\000\000\220A\000\000\220A\000\000\220A\000\000\230A\000\000\230A\000\000\230A\000\000\230A\000\000\230A\000\000\230A\000\000\230A\000\000\230A\000\000\240A\000\000\240A\000\000\240A\000\000\240A\000\000\240A\000\000\240A\000\000\240A\000\000\240A\000\000\250A\000\000\250A\000\000\250A\000\000\250A\000\000\250A\000\000\250A\000\000\250A\000\000\250A\000\000\260A\000\000\260A\000\000\260A\000\000\260A\000\000\260A\000\000\260A\000\000\260A\000\000\260A\000\000\270A\000\000\270A\000\000\270A\000\000\270A\000\000\270A\000\000\270A\000\000\270A\000\000\270A\000\000\300A\000\000\300A\000\000\300A\000\000\300A\000\000\300A\000\000\300A\000\000\300A\000\000\300A\000\000\310A\000\000\310A\000\000\310A\000\000\310A\000\000\310A\000\000\310A\000\000\310A\000\000\310A\000\000\320A\000\000\320A\000\000\320A\000\000\320A\000\000\320A\000\000\320A\000\000\320A\000\000\320A\000\000\330A\000\000\330A\000\000\330A\000\000\330A\000\000\330A\000\000\330A\000\000\330A\000\000\330A\000\000\340A\000\000\340A\000\000\340A\000\000\340A\000\000\340A\000\000\340A\000\000\340A\000\000\340A\000\000\350A\000\000\350A\000\000\350A\000\000\350A\000\000\350A\000\000\350A\000\000\350A\000\000\350A\000\000\360A\000\000\360A\000\000\360A\000\000\360A\000\000\360A\000\000\360A\000\000\360A\000\000\360A\000\000\370A\000\000\370A\000\000\370A\000\000\370A\000\000\370A\000\000\370A\000\000\370A\000\000\370A\000\000\000B\000\000\000B\000\000\000B\000\000\000B\000\000\000B\000\000\000B\000\000\000B\000\000\000B\000\000\004B\000\000\004B\000\000\004B\000\000\004B\000\000\004B\000\000\004B\000\000\004B\000\000\004B\000\000\010B\000\000\010B\000\000\010B\000\000\010B\000\000\010B\000\000\010B\000\000\010B\000\000\010B\000\000\014B\000\000\014B\000\000\014B\000\000\014B\000\000\014B\000\000\014B\000\000\014B\000\000\014B\000\000\020B\000\000\020B\000\000\020B\000\000\020B\000\000\020B\000\000\020B\000\000\020B\000\000\020B\000\000\024B\000\000\024B\000\000\024B\000\000\024B\000\000\024B\000\000\024B\000\000\024B\000\000\024B\000\000\030B\000\000\030B\000\000\030B\000\000\030B\000\000\030B\000\000\030B\000\000\030B\000\000\030B\000\000\034B\000\000\034B\000\000\034B\000\000\034B\000\000\034B\000\000\034B\000\000\034B\000\000\034B\000\000 B\000\000 B\000\000 B\000\000 B\000\000 B\000\000 B\000\000 B\000\000 B\000\000$B\000\000$B\000\000$B\000\000$B\000\000$B\000\000$B\000\000$B\000\000$B\000\000(B\000\000(B\000\000(B\000\000(B\000\000(B\000\000(B\000\000(B\000\000(B\000\000,B\000\000,B\000\000,B\000\000,B\000\000,B\000\000,B\000\000,B\000\000,B\000\0000B\000\0000B\000\0000B\000\0000B\000\0000B\000\0000B\000\0000B\000\0000B\000\0004B\000\0004B\000\0004B\000\0004B\000\0004B\000\0004B\000\0004B\000\0004B\000\0008B\000\0008B\000\0008B\000\0008B\000\0008B\000\0008B\000\0008B\000\0008B\000\000<B\000\000<B\000\000<B\000\000<B\000\000<B\000\000<B\000\000<B\000\000<B\000\000@B\000\000@B\000\000@B\000\000@B\000\000@B\000\000@B\000\000@B\000\000@B\000\000DB\000\000DB\000\000DB\000\000DB\000\000DB\000\000DB\000\000DB\000\000DB\000\000HB\000\000HB\000\000HB\000\000HB\000\000HB\000\000HB\000\000HB\000\000HB\000\000LB\000\000LB\000\000LB\000\000LB\000\000LB\000\000LB\000\000LB\000\000LB\000\000PB\000\000PB\000\000PB\000\000PB\000\000PB\000\000PB\000\000PB\000\000PB\000\000TB\000\000TB\000\000TB\000\000TB\000\000TB\000\000TB\000\000TB\000\000TB\000\000XB\000\000XB\000\000XB\000\000XB\000\000XB\000\000XB\000\000XB\000\000XB\000\000\\B\000\000\\B\000\000\\B\000\000\\B\000\000\\B\000\000\\B\000\000\\B\000\000\\B\000\000`B\000\000`B\000\000`B\000\000`B\000\000`B\000\000`B\000\000`B\000\000`B\000\000dB\000\000dB\000\000dB\000\000dB\000\000dB\000\000dB\000\000dB\000\000dB\000\000hB\000\000hB\000\000hB\000\000hB\000\000hB\000\000hB\000\000hB\000\000hB\000\000lB\000\000lB\000\000lB\000\000lB\000\000lB\000\000lB\000\000lB\000\000lB\000\000pB\000\000pB\000\000pB\000\000pB\000\000pB\000\000pB\000\000pB\000\000pB\000\000tB\000\000tB\000\000tB\000\000tB\000\000tB\000\000tB\000\000tB\000\000tB\000\000xB\000\000xB\000\000xB\000\000xB\000\000xB\000\000xB\000\000xB\000\000xB\000\000|B\000\000|B\000\000|B\000\000|B\000\000|B\000\000|B\000\000|B\000\000|B"
  }
  input {
    name: "frame_codes"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "text_embed"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  output {
    name: "inputs_embeds"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 13
}
