ir_version: 8
producer_name: "onnx-genai tiny-tts-nested-preembed fixture"
graph {
  node {
    input: "inputs_embeds"
    output: "embeds_mean"
    name: "node_ReduceMean_0"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "vocab_index"
    input: "embeds_mean"
    output: "diff"
    name: "node_Sub_1"
    op_type: "Sub"
  }
  node {
    input: "diff"
    input: "diff"
    output: "diff_sq"
    name: "node_Mul_2"
    op_type: "Mul"
  }
  node {
    input: "diff_sq"
    output: "logits"
    name: "node_Neg_3"
    op_type: "Neg"
  }
  node {
    input: "inputs_embeds"
    output: "emb_shape"
    name: "node_Shape_4"
    op_type: "Shape"
  }
  node {
    output: "batch_index"
    name: "node_Constant_5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        name: "batch_index_value"
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "sequence_index"
    name: "node_Constant_6"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        name: "sequence_index_value"
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "axes_zero"
    name: "node_Constant_7"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: "axes_zero_value"
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "emb_shape"
    input: "batch_index"
    output: "batch"
    name: "node_Gather_8"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "emb_shape"
    input: "sequence_index"
    output: "sequence"
    name: "node_Gather_9"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "batch"
    input: "axes_zero"
    output: "batch_vec"
    name: "node_Unsqueeze_10"
    op_type: "Unsqueeze"
  }
  node {
    input: "sequence"
    input: "axes_zero"
    output: "sequence_vec"
    name: "node_Unsqueeze_11"
    op_type: "Unsqueeze"
  }
  node {
    output: "one"
    name: "node_Constant_12"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: "one_value"
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "head"
    name: "node_Constant_13"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: "head_value"
        raw_data: "\004\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "hidden"
    name: "node_Constant_14"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: "hidden_value"
        raw_data: "\010\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "batch_vec"
    input: "sequence_vec"
    input: "hidden"
    output: "hidden_shape"
    name: "node_Concat_15"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "embeds_mean"
    input: "hidden_shape"
    output: "last_hidden_state"
    name: "node_Expand_16"
    op_type: "Expand"
  }
  node {
    input: "batch_vec"
    input: "one"
    input: "sequence_vec"
    input: "head"
    output: "cache_shape"
    name: "node_Concat_17"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "cache_axis"
    name: "node_Constant_18"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        name: "cache_axis_value"
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "embeds_mean"
    input: "cache_axis"
    output: "mean_cache"
    name: "node_Unsqueeze_19"
    op_type: "Unsqueeze"
  }
  node {
    input: "mean_cache"
    input: "cache_shape"
    output: "current_key"
    name: "node_Expand_20"
    op_type: "Expand"
  }
  node {
    input: "current_key"
    input: "value_offset"
    output: "current_value"
    name: "node_Add_21"
    op_type: "Add"
  }
  node {
    input: "past_key_values.0.key"
    input: "current_key"
    output: "present.0.key"
    name: "node_Concat_22"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 2
      type: INT
    }
  }
  node {
    input: "past_key_values.0.value"
    input: "current_value"
    output: "present.0.value"
    name: "node_Concat_23"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 2
      type: INT
    }
  }
  name: "tiny_tts_nested_preembed_talker"
  initializer {
    dims: 1
    dims: 1
    dims: 64
    data_type: 1
    name: "vocab_index"
    raw_data: "\000\000\000\000\000\000\200?\000\000\000@\000\000@@\000\000\200@\000\000\240@\000\000\300@\000\000\340@\000\000\000A\000\000\020A\000\000 A\000\0000A\000\000@A\000\000PA\000\000`A\000\000pA\000\000\200A\000\000\210A\000\000\220A\000\000\230A\000\000\240A\000\000\250A\000\000\260A\000\000\270A\000\000\300A\000\000\310A\000\000\320A\000\000\330A\000\000\340A\000\000\350A\000\000\360A\000\000\370A\000\000\000B\000\000\004B\000\000\010B\000\000\014B\000\000\020B\000\000\024B\000\000\030B\000\000\034B\000\000 B\000\000$B\000\000(B\000\000,B\000\0000B\000\0004B\000\0008B\000\000<B\000\000@B\000\000DB\000\000HB\000\000LB\000\000PB\000\000TB\000\000XB\000\000\\B\000\000`B\000\000dB\000\000hB\000\000lB\000\000pB\000\000tB\000\000xB\000\000|B"
  }
  initializer {
    data_type: 1
    name: "value_offset"
    raw_data: "\000\000\000?"
  }
  input {
    name: "inputs_embeds"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "sequence_len"
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  input {
    name: "past_key_values.0.key"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "past_sequence_len"
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "past_key_values.0.value"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "past_sequence_len"
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "logits"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "sequence_len"
          }
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  output {
    name: "last_hidden_state"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "sequence_len"
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  output {
    name: "present.0.key"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "total_sequence_len"
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "present.0.value"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "total_sequence_len"
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 13
}
