ir_version: 10
graph {
  node {
    input: "attention_mask"
    output: "cast_input_ids"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "cast_input_ids"
    output: "current_kv"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    output: "logits"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        dims: 1
        dims: 2
        data_type: 1
        raw_data: "\000\000\000\000\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "current_kv"
    output: "present.0.key"
    op_type: "Identity"
  }
  node {
    input: "current_kv"
    output: "present.0.value"
    op_type: "Identity"
  }
  input {
    name: "input_ids"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "sequence"
          }
        }
      }
    }
  }
  input {
    name: "attention_mask"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "total"
          }
        }
      }
    }
  }
  input {
    name: "position_ids"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "sequence"
          }
        }
      }
    }
  }
  input {
    name: "past_key_values.0.key"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "past"
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "past_key_values.0.value"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "past"
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "logits"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "present.0.key"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "total"
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "present.0.value"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "total"
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  value_info {
    name: "cast_input_ids"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "total"
          }
        }
      }
    }
  }
  value_info {
    name: "current_kv"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "total"
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 11
}
