ir_version: 8
producer_name: "onnx-genai WP4 fixture"
graph {
  node {
    input: "embedding_table"
    input: "input_ids"
    output: "routed_sequence"
    name: "node_Gather_0"
    op_type: "Gather"
  }
  name: "tiny_position_state_embedding"
  initializer {
    dims: 32
    dims: 1
    data_type: 1
    name: "embedding_table"
    raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
  }
  input {
    name: "input_ids"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "prompt_sequence"
          }
        }
      }
    }
  }
  output {
    name: "routed_sequence"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "prompt_sequence"
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 12
}
