ir_version: 11
producer_name: "onnx-genai-tests"
graph {
  node {
    input: "lm_table"
    input: "input_ids"
    output: "logits"
    name: "target_logits"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "hidden_table"
    input: "input_ids"
    output: "hidden_states.0"
    name: "target_hidden"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "input_ids"
    output: "ids_shape"
    name: "ids_shape"
    op_type: "Shape"
  }
  node {
    input: "ids_shape"
    input: "idx0"
    output: "batch_dim"
    name: "batch_dim"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "ids_shape"
    input: "idx1"
    output: "seq_dim"
    name: "seq_dim"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "batch_dim"
    input: "kv_heads_const"
    input: "seq_dim"
    input: "head_dim_const"
    output: "new_kv_shape"
    name: "new_kv_shape"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "new_kv_shape"
    output: "new_kv_zeros"
    name: "new_kv_zeros"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        name: "new_kv_fill"
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "past_key_values.0.key"
    input: "new_kv_zeros"
    output: "present.0.key"
    name: "present_0_key"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 2
      type: INT
    }
  }
  node {
    input: "past_key_values.0.value"
    input: "new_kv_zeros"
    output: "present.0.value"
    name: "present_0_value"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 2
      type: INT
    }
  }
  node {
    input: "past_key_values.1.key"
    input: "new_kv_zeros"
    output: "present.1.key"
    name: "present_1_key"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 2
      type: INT
    }
  }
  node {
    input: "past_key_values.1.value"
    input: "new_kv_zeros"
    output: "present.1.value"
    name: "present_1_value"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 2
      type: INT
    }
  }
  name: "tiny_gemma4_target"
  initializer {
    dims: 32
    dims: 32
    data_type: 1
    name: "lm_table"
    raw_data: "q\370\"?*\336\234\277\330vn>\266\275f\277\376\034\026\277\324S\216>\231/N?]z\261?\216]M\277C:O?\342\271\212\274\362P\220\277\361*\260>Q\310\013\277\261\262\301>\313\214\327\276@2>?\324TL\277\000\224<\275\036\000\353\276\312\237u>#pg\277\271\022_\276f\201\027?\003\022\301?@\024\030?k\206\273?4\177\021>\032\035\323>\265\305\364?\362B\247?\320\027\\\277^\324l?M\213\211?\032\302\240\277\344\324\236>\203\'\237?\327\372\200>\017\342^\276\254\250\311\277i\243.?\372\366\363\277\206\205\235?\t\212\014?\2369=\300\372\342j\277x\376\217?8I\002?\032\235\277\277\233\020\024\277\371]\'?\250\324\363\277\"\204\271\277\034=\270>\324\221\247\276\255\203\243\2773\330\254=P\277\346=\262\315\013?v\202\211?\022 \343\277p{\262\277J\2446?\203\3064\276\020l\007>\211/\266>\312\205c>!h\\\276\004\004#\276\333\374\230?\272\221+?\256t\305?f\271\276=\225\353\342=\253\253w?\250p\236?\302\316\343\276.T\244?\362\314m\276a\302\017\300\312\0249\300\270\207\320>\023\374\204\276\016a\320\277\205\016\244>*a\"\277\014n\243\276\360N\325\277\213t\253\277\\\026\203\277\226d\221\277w\014,\277/\230\004\300\316NI?\221\343\253?\253\335/?\277QV?\340/\211\277bv\023\300\375\257\264>b|\324?#\001\266>J\2647@\001\023\210?\0050\007?\215\362H\276\361\313O\277\350c\332\277.);?\342\n:\277?\033*?9V0?\302\230%?\016E\340\276\377A\247?\271\263s?/\003\253<\245\241\r?\356c\315\276D\260\346>h\221??\272\272\355>3\020\241=\241*|\276\370\340\034@\246\033\260=\233\202\237?L\332\351\2761\360\226=\0332H\276p\3172\300\257m0?\360\020\311?\2431\255\277\\\236\205\276\246Jy?\375B\344>\262\241\037?d\022W\276\255\025\000?\344\254c\277\232\275\322>\231\203\350\275,\"\037\300W\247\201>\361\327\350\276\215\311l\277:\305n\277\311f\222\277\314\226\252\276ox1\277\216\014\234>y\255\255?\203W\027\277\264 \030?\205\370\207\277E\344\307>\002\251\344>@\013G\276\027\203\250\277\305.f?R#u?m4\270?\254<\205?n\342\312\277\320\005\004\277\265\003e\277x\232-\276\307P\336>l\177\021\276\252\014\235=\223\361\024>\367-\317\276\337ei\277Z@G?\025*\203\276\\\3525\2778!\036\277V\215*?sM\370\277U\' <\204w\006\277\024\241H\300DG<\276MzJ\276\250\237\201\277\201c\235\276G\341N\277\344fz\275f\254 ?\227<\207\277On\024\277\345\204o?\256u\213\277\356\271\271\277Z\267r\277\367R\314>%\355\262\276t\024\264\277\306.\201?\346z\002>\002\251\014\277\003\277\264\275\236Qb?\2542\014?sK\310\277L\244\313=\331\342H\277\262\373#\276\033\304\024\277\315c.?\342\336j\275\261\020\000>tQ\025\2777\206\241?X\310:?\322^\203\277L\206V\277e\324d?\243\342.?S\314Y\276\365a`\277\2637\214>i>\367>\314\233`\277l\322\030\277!\261e\273\353 \346\275\310F\234\277\350\311\323\276a\357\030\277\034w\303\277]\340P?\362 \222?\245\220\315\276^\217\320\2772Q?\277\377\321\312\277\364\303\220\277\225|\210?\266\365&?\005\270\020?UJh?\2463\253\276\212d)?\014\261\215\277\027|\276\276Pwf\275U\336\362=\307\222\342>G\201\205?\217=\005\277\322\233\206?H\025\206\277X\253\277?Q{\264\277\347\235\242?9\332/\276V:\335>3\030\026?\230\244\"\277n\241o\277\221\303i>\305\347\356\277\303\2157\277\037\223\202=\037k,\276\317\243\r\277I\376\325\277\247\330\265?\372\002\242?@\336\022\300\013\374k\277\372\324\366\276\371Z;\277\263\001 ?\002E\034?u\240\210>\207\336\341\277\314\372\036>\265{\213\276\326Y\023\277@\r\257>\007\025\244?\373^\036\276\315\nM\276(\3703?J\017B\277Z\245\002?\250\343>\275\200\nh\277Ij\351>\026(\262\275\007TH?\017\227\262>7e\351>\025\265\262\276\272e\257\277\233\215\323\275\260\305\221>&\230\030\300\273\312\320?\351$\250?;\310\376\2771\253\355=\016l\203?\002\267l?\032\221\360>gE\325?y\202\364\275nN\031\300e\004\227\276\371\257M?S\366\001?N\nX>\267\371\337>\021\246\370\2770\325m?\362\"\316>\276\330\370>D\221\266\277\305\014n=\200\236\354\275i8\005\300\216i\327?\223M*?l\032v\277J}\372\276\361\351\315?\027\277\021?\213\026\255\277\355\nJ>7\247\353\276X_i?Ok\304\277\206\027\301>\230\207\000?\262\367*?\2706\007\277`\336\034?M\306\311>\240DL\277\311\251\243\277\016\224\361\2763\335\256>\242),?\333>C\277\303`\221=\240\342\025?\023\273W\277\361N}>O\357\213\277\001\267\370\276\264\370\342\276M\306\251<p\340\323\2777F\257\277,\177\270?\346}-?\252\351\215\277\371\236\250<\343;\252\277\265)\277\277\300T\262<em\266\277\204G\370\276\206Mc?\031o\221\277\214\207\241=\312\210\270?1\263\207=\342\341^;\232\027\206?h-\014\277/\213)@\373\240\306?\230\250A\277\372u\"\2771\004#>\334*y?\246\313\343\276\243\354{?4\256\021?O\212\004?m:\025\273Gs\021\276F\236!\277_\325\307\277\000\200U?S\033H\277\002\370\264\276V\262\200\274\203b\210\277\017\215\362\277\023\272Q\277\2135F\277\251F]?\257\373\304\276\177\025\250\276F\252\003@bf\370\276ax\214\276\345\276\363\275M1\"\277\020(\274?K[t\277\303\377\305\277\366p.\277hQ\367>\333\313[\277\242\037\347>X\230\243>k9\343?\364\316o\277o`\254\276&k\032?\346)9>J\350\323\277\3446\221\277\375\213\207?\235\331\271\276\357\207\302>\272y9\276\274\265d?*=\026\277\306\016,?\370{\245?\252kb\276\027\326\301>4\226\260?>\266V\277zTr\277\224\264+>El\301\277\216\200\316>\r+\037>\347\300\217\276\347F\036?\355^\017?\006\034\213?\236\345L\277c\334\306?\342\344\325\276\353\222J\277\356\360\301\276\211\007\226=\367t\026\277\207\346\267?\264\362s\276BAO\276\003\244\275?\024\322\224?S\343??\201\207O>.3\311>\271k\357>\277\250\246?\216\373$?\014U\215\277\346\306b\277\220f\303\276-\366\247=o\016\223\275\2317\023\277]\374@\277\246\362\333\275!\227\025\277\345w\264?\217VR\277\321\274U?\345\177\364?\014\3769?+\363\023?\374\235\215\277\226\255\005\277\232.k\277O\262#\300k\262\227>\026\237J>*\000\247?\t\267\327\277\270\002&\277x\257z?\340.c?\\Q\r\276\307\'\256\277\020Z\367\277\002\276\220\277\270\225\271\275\207\013\243>\240\016_\276\326\346\303>\336I\006>\2143e?\367,\224?\005\003\212\277\370,\250\277g\305\346>\250{\303?\357\315\264>\217\330\321?\302-\222?\205\210\225?F\202\223\277\366\245I<%\307`\277qp\025?\231\363\274\276m\245\346> o^>\304C\207?M\235p\277,#\214?\030\204K\277t\003z\277\303\373\357\276\334\272\307\276\2015\335?\343\341\025?\002\024\203=\332J\313\277G\233O?\007\301?\276*R\003\2769\346\204<[\302\314\276\016\247\r>\356k\304?}\013\301\277\203\316\240\277\3147\'\300D\317a?\007q\001\277\005\033H?\371\317\010?e\370\020\276}X\006?\224\340\007?\256\351\313\275\3515\305\276\t\206\233?E\240L>\360\343\255\277\365\312I\277_\216h>gAq>\237\377Z?\323\t\250?\320tF?\240V\r\277\006\342\300\2756n\214<l\303\213\277g\354\221?e_\367>\n\313,?\'\022\260\277_8P\277wG\231?\301j)\276\2520;?\360\033\310\277&a\252\276\356t%@@\365\002?\325\024\303=\203e\212\277\371\227\n@\274\032\177\276\005\022\034?\315\025\007@\245\240c?J\225\240?\322\032\270\276m\016\247>\320\370\037\277\014\033X\300\234\326=?\0069\226\277o,8\277/\r1?\r\'\221?x\210\347\275\027\326\"=I~ \276\336\250\032\276\335\346G\277\027)\337\277s\327\202\276\252k\246=\002\260^\277w\233\374?\376t\014\300\n\3271@x\354Z\277s\306C>\245\026\312\277p\212\022\300\\\321\027\276\332\311\005\277\034\004\235\277\354bO\276\336\027\307\277\332\tS<\214\211\003\277\2065\350=_\004L\276\226\005W?}`\000=\345\300\322\277\366C\036@\265\026\023>\013\226\"\277)\245\246?\021J\263=\260;\236\277\033\367\256\277\204\337\260>\215\353\364?\341$n\272\342\272N\277\231Q\001\276\3305\013\277dp6\276\221y\001\277\201\032O?<N\262\277\"\303\241\277\2130{?\215p\321>uU\312=\207\265\217?\234\253`>\312_@\277oG\362\275U\361\315\276\347\205\301\277\271\245\260\274G\026\255?\373\2115\300\257M\201?\340u\374>4\212\276=\n\260\252=F\340\221\276Y\300\377>\035f\256\276,\026\230?\\\264_\277<HL?\276\201\305>\320\376\244<m\033\025\277\003\204\251?\312\340x\277\250\016\312\277\003#\227\277\227\275\027?;\3318?C\210\223\277\307\316_?\363\030\365>\016[T?\373\0372>`\254\325\273\247\275\211>$>\203\277\317\356\352\276W,\'?_j]?\031I\206\276\000n8\275\365\003\026\276L\370\022@\326\277_>\241\366@>\242\\\'\277\203h3\277\271\246\216\277\343\324P\300@\017\240?\362\324\t\276\255\t\001?\030\351\001\276\375YR\274\374l{>\262\220>?H\215\223?.\364\201\276\243\347\361=\326\3359\276\357U\212\276|a|?K`\265\277\0044\345=\262\021\000@`\236P?\355\203H\277\360\344\261\275\267I\313=R\216`\277\335\272\212\277\200\222S\277\034dp\277.4\224\276\037\014*?\033Y\037\277\312q4=S#\014\300\205\210\356>\303\242\243\2770B\265=#\2740\277\\\264w=L\266;?\256\224\313\276\314%8>\235\002\271?\336e\364\276*\214\230\277\270\245\017\2759\2038\277\302\325\312>\rP\344\276T\255\205?\240)\217?\346\010\316\274Tu\336?\223^\000@\"qp?\365\216\362\277\347\033\017\277\001\216\027?>\316@\277\277\352\254\277\216\345\n\2769\2528\277\001\310\376>\223\337\344=>\317u?\320\031\232\276^\0269>\256o\351\276<\255\246\277\216\303\344>\377\336\227>D[%?n1\231\273\257\346J?\rfH=\276.T?\270\021\233>P:N>\303\260\037\300\251\221<\277j\205\311\277\260\221\373\276_0\371=i\341A\277\301(\035\275\350\221\276\277~\303\371?\337H\217=\007\007\267?Z\000\223?\013\222\261\277K^\201\277\216\342\311\2761\270[?h\345t\277\312 \020@\306\223\352>\263\265\204\276\241\200\334>5T\324?\210\rF?\356\217*>\273\354u\277\213)\260?\246\330\005\277\363\005\214>v\225\370\277\224\234v\277\224<\232\277\234v\236\276\276\207\252=\306\300\300?\215\204\221?\005\2079?0=$\300{\036^?\362\235\244<W\333\312>\226\341\310?#\360\227?\260(R\277p\355\366?\215\234 \300\275\301\004\277\305,\233\277\017\021\255=h~\211?a/ \277{\230*?\321\334U\275\244\221\353\277g\376S\276\236\234\201>\350M\324?P\332\025\277\271\255V\277O\321\341\276\230u:?J\214\020\277\'\251g?\364\0033?\227\207\232\277\222dC?^\377\034\277\016*\030?\024\320U\277\035\312\013?\275=\024?\227\224\303\277\366\032\264\277\214\003\354\275?\266\025>\227\004_\276(\000\033\277\341c\253>&<g?\207\306#@\306\246\r?\266\331\237\277ud\207\277C\002\201\277g\016D?\353\365v\277]\034_?5\374e\277<V^?s\236\016\277\341&\363\2761*\211\276\032\024\031@\345\326\202\276\354)%>\221Y\035\277\351\360\246?=\026Q\277L\\V>\227\316\214\277^\326\031\277&]G?\216-\023@\240I\\\277\320\tS?\305\271\034>Sf\336>\346\3120@c \233?\300\020A\277R\217\007\300\334\331\231<\232\023\251\276d9\352?\345p4>i\2461\277\242\237T\277+\321\023\300h\236\307?\t\326\331>\256\265\307<\373\230\227?\311Z\353\276\375\343\001\300\021N\340>CRe\276\236;;>A\371D\277O6\014?\357\227\t?N\354\301\276\177\351\273\277\322\024\033@s\341(\277\315\371\233?\273\177\300?^\3310\277\273x\304\276\361W\265\277\301\'.?\007XC\277\323\233\205\277\220\2072?\235c\373\277\200\035\221=\037\321k\2775\276\210\276\317p\225\276\343\245 ?D\363>?\203\322\224\277\222\215N<\375\244d\275rUu?\300h\226\276\241\325\311\277\026\206f\276^m\377<5\325\325\277\004,%\277\231\030\177>\3467W\277\250\177\306\277mbE\277\334\206\337\274?C^\277D\302W?\014\306\213?qv\233\277\022\013\000?\301\230g\277\272\362\350\277w\352h\277\204~\250\277\363\275\357=-\323\273\276\013\027g\277v\220\303\274\346f\351=\355\361\036@|T0?\307\254\007>*\323\006?H4\217>\014\022\240>{)R?\177\351{<\007\n@?1\234\272\276\n\356Y?Z\376\201?\237\216\355\277X\355T?47+?J\001\024@\315\247O?\213\333\311=\354\0051=\332YO?\277\224\t@\230\237\344>o5\031@\3126@\276\346k\350\277\302\234\217?z\274\231>\274\204\277>\227\341F\277U\316\244>\350\2733\277\235\362\324=V\217u\277@\360\217?\205\343\022@\210\265\006\300#CX\277\207\341\322?s@*\277E\304\363\277\375\275\357?\003:\023?\371\001\177=\233\024N?G\261\000?\321\tt\277\335\272S\277\002\203\241>\353\301\202?B@F\276\365\322\211\277:\351\205\277\177-\211??p\004\277V\362O>S\017\341\276\000W\332\276gQ\213>\373lD\275\247\341\236\277\237o\302\277\202\345\354?\360X\024?M\307L\276\245\244*\277Q\260K?zz\325\276H\206|\277\225\375\013@\372\351$\277\263\232v?\207\020\375\276\010d4\277q\231\214\277\371Z\025@\267\275\214\277l\356\200\277O\302\'\277s\372\247?\215vm>\330\346\211\277\260\331\221?\267\024Q\277\336\244\245\275\352\317\'?j\003\017?\021\373\005\277\306?\262\2770\243\232\277\323\366,\277\372\361\347\274\n\352\253\277(\322;?"
  }
  initializer {
    dims: 32
    dims: 16
    data_type: 1
    name: "hidden_table"
    raw_data: "\"\033\010\273\326\367\020\275\207\235^\272/\223\370;\321\021\035\275\r\274\354\2740XT\274p\3275\273\000I7\275\274\260\217\274\017\2656\274\354Z\233\273MwQ\274\265\327\021\2741\224\002=\307(\n=p\347\013;X3\202\273\340.\337:\230Qs\273\324,\352\272:5\222<C\267\034;\274\312Y=\234\215\347\273>\302\2159\340c5\2737\006\305\274e\371\270<\034@\227\274\242\221\301\274\305X\322;\216\207\375\274[\217H\275\037\331\\\274 (\305<cb\252\274N\344\217;J\220b\272\312_\365\274\266@y<\027\324Z;\232\272\267\273d\n\206<\021\024\031\274Pk\026\274\374\300\207<lP\326\273T\224\025;\322?;\271\256y\003;j:h<\0034Q;\000\353\363<\200j\207\274n\355\007=\207\274\321<\032\204S:\315\227\334\274\007\213H<\255k\206<|\264?\273V\204\342<\206\210\244\274:%|\274\0101\007\273-\204\245\274\023`^\274U\232\017;\201\373\030\274Cj\353<\350!\303\274\251\344O\273\177\261\276;NM\\<o\225\247<\234s\360:\365S\213:\375\207\375\274\246J\037\274\306\222\330\273\210Q\260<\215\210q<\267\243,\274{*I\275\3545\215\273\371c\2657S\370*\274\363\205\264;\351\'%<\263\336\223\273\n\315-\2741\334\301<-\263%\274<\272\221\274/\200\367\274p\275\246\273F\217\352;h\025\214\273#\r\367\273u\267\037\275\343\236\030\273x\351.\274\016\311\310:\204]\013\275eIu\274A\305l<\206\350\202;\013\'*\275.!\234\274\322H\002\275\014SL<\357`\002\275\221\276\r=\201\205#<<C\337;\273\203\333<\201H\235\273,\\9\274\301`\227:\013\022\250\274@\203F;||\222<w\361\247;\nS\334\272\245\270\332<L\026\246<\244,\231<1p\035<\026\220\021=\205\\\263<:\211\205\274\317\357\311<\344\032\007\275?\010\215\273\003c\362\272m\0276<\t\315,\274\350\216\261<x\237\226<l\3017\274\334\013\322\274\"\372*<\371\311\362<\010\031\220;%Q\322\274q\002\027\275~Y[;2\246\'<?u\356\272\206\233Y\271\234\210(\273\331\"\031\275\037\2234<mH\273<\245\313\225\274\312\356^\273\253F\n=\253\246\026<\365\350\302\274\215\024\263\273p+\212\274\224-\315<\263\366`=\021\202\206\274\r\314\204\274\005[\333\273\252\224\323:\330\226\361\273Y\277\216;\215\016\034\274\267O\360\273O\371^\274\355i\363\274~\367\223;1\225\321\273\353\316\225\274\325\366\002\275\324\025|<\027K&\274:\320\215\274\370\202\023\274\222\334\211\273v\232\265;k\241\364\273qx\021\275G!5<\313\363\341\274\304\014{8\275W\220<\3439O;\313\246P=#\371\277\274q\013\235<\232\033\332\274\034v\325\273\227\246\020\275\331\204\037\274#\037&=\302\366\2009\233\365\300\274\234e\352;\234AZ:\323\245\270;\311\276\257<5\263\321\270\202x(<J\2458\275uu\316:t\254\206;rmo<w\017\305\273_\336\301<\3761\007\274\271\272E<?\035\341\274k<\311:\273\202\r=\nB\223<\365\327r\274\306\202\236\274\203\243\373<\000!\363\273\231\370\007\273\371\254\007\274O\221\211;\327-\237;w\037\250:\262\306b\274\030\352\353\274\"\352\221\273F/\217\274\225\254\036\274\276\203\346\272\366\354\033<\217\316Q\274\366\2775\274s$\035<p\315$=\364\347\203\273\261,F<\230%\304\273\030[\250<\rk\0169\260|\216\274\251\013 \274\207H\211\274\014B0\274\0360;<\314\342\371\274{S5<\200@\006=\324\377\007=N\240\240\274e\327<<\355B\247\274\rs\t\275]\033\203<aB0\274\004\332\021=\234Ka\274\307\277\220\274\253\260{<\t\032\316\274\377\037\303\274\037\222w<\034\014\362\2748b\227<\251\261i\274\335\032\203\274\277g\265<b\233\220<r\353\251;I\002\023\274\233_\316\272UB\267\274\370\225#<W\246\246\272\217zZ=(4\226\274sL\006<\2053<;1\305\321<\364\377\201<m\n\033=\\`\256\274\302\330L\274\327\207c<\027\242\233<\nd?\273\341\177\365:H\223\316<\347+\010=\225\363\t\274\377\347\017\273\270\275\201<\276%\016=\322~\034\274.\252\337\274\'p\003\275Z\230\223\273\022C\'\274\024\310\344\274a\212\271<\363q\320\270#,\237;GS\005\275\322:\370:\211\332\233\274\312\022\200;?\321A\274\004\304\016;\353j\333<\017f\343;I\357\217;\343\2552\274P)\022\275vM\236<\251\305\356\274H\035\212;aCF<\177\033_\275\226\212`\273\216\207\367;\032\234\027<\320OF<\252\375\216\2748\264\005\275\034\346W\274\316\332\r<Xi\265<y\353\201\274\227\026\232<\240\241\334;V\326\266\273\235G\243<\311\362|\2743f8\275]MR\273i\031\330\274\'\031\261\274e\0021=eO\227\274/\024\347:\230\321\334\274\';\004<DA\345<\352m\277<\316a\365<\260\232\320<Rx+< \347\227<^D\265\274\265L^\273)Z\037=u6\000=\211Y\375\273\017\241\251\2739\027\230\271\271k\307<\2004H;\364P\224<o\025{\275\272\345D:\"\025\320;\353f\373\274O\"\321\274\257\365\025\274\240\371\315\274`)\211\273!_\204<\336b\221<\313\231\265\274Ws \275\t\366\227<\256M\324\273\373\207\320\274\234U\316<\325T\n\275\n\\J<KW\200\274_\306\217\272\265\353)\275\037\217]<\246\323\373\273j\033(=\274\032,\273\244\372\354<H\222\365<\230d\000<9\353\024\274q\213\340\273\351\355\257\274xA\227:<\346H<j\210\333\274\263i\230<\260\014\024\2748)\272\274ZRj:^7\213\274[\2278\272yC\351\273\236\363\223\274\022\255\223\273\321\"\204<\2223\316\274\347\021j\274\304\305\242<\342\312:\274\205\177!;\257\361\317\273\314\017`\274\010\027\370<\003\014a\274YI79/vj\273r\265\316<\357\321\006\275|\\\276<#\344\215\274R\267\374\273\322\216W\274\203\371\242;\264\310\230\273B\271\351\274]e\255<bZK\275\317\330x\275\2733}<\306\260\027=?N\251<\313\013\006\275]\310\330\272\036\277\034::\260E<A\370\310\273w\263\314<\211\237\t<\353\315\365<\346\031I=G\352\366<\366\275\377<5[\336;t\331\033:\320^&\274 \013\036\274\375\204\326\274\234\317%<L\304;\274\323\376\024\275\002\334\357\274\361y=<\255\274\262<\032\252\343<S\370\002<\211\204\014<\232_U9\341\005\362:\216\375\334\271\232\260\"=\002\346;;\177%\252\274W\204\216\273\217\250\031\274L\203\035<\234v\347\273\353}.<\273\177Q=\314\360Y\275\321\343u:D\336\344\274\237m\206;_\344.<\311^\236:\035O\010=\366\346\344\274k\275\367\272\326\032\301<\275{\002\273\310r\007\272\025*Q;m\n=<W.\374<\344\334X;1tl<\032l\317;\242\332\330\274e*\030<\206B\346\273\371\254\354\274\323\000\253\274;D\035\275\211\244\000\275E=\271:\344f\360:\214o\373;\026L\035\274\362m@\273Nov<\014\334=;z\301\010\274\322\266\242\273\007\n\261\274:\371\014\273\340\n^<\r$\251\274`\352\"<X&\226<\023\344\251\272\255\031<<\376\374\363:"
  }
  initializer {
    dims: 1
    data_type: 7
    name: "kv_heads_const"
    raw_data: "\002\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 1
    data_type: 7
    name: "head_dim_const"
    raw_data: "\010\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 1
    data_type: 7
    name: "idx0"
    raw_data: "\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 1
    data_type: 7
    name: "idx1"
    raw_data: "\001\000\000\000\000\000\000\000"
  }
  input {
    name: "input_ids"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "sequence_len"
          }
        }
      }
    }
  }
  input {
    name: "attention_mask"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "total_seq_len"
          }
        }
      }
    }
  }
  input {
    name: "position_ids"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "sequence_len"
          }
        }
      }
    }
  }
  input {
    name: "past_key_values.0.key"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_param: "past_seq"
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  input {
    name: "past_key_values.0.value"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_param: "past_seq"
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  input {
    name: "past_key_values.1.key"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_param: "past_seq"
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  input {
    name: "past_key_values.1.value"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_param: "past_seq"
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  output {
    name: "logits"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "sequence_len"
          }
          dim {
            dim_value: 32
          }
        }
      }
    }
  }
  output {
    name: "present.0.key"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_param: "total_seq_len"
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  output {
    name: "present.0.value"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_param: "total_seq_len"
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  output {
    name: "present.1.key"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_param: "total_seq_len"
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  output {
    name: "present.1.value"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_param: "total_seq_len"
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  output {
    name: "hidden_states.0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "sequence_len"
          }
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  value_info {
    name: "lm_table"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 32
          }
          dim {
            dim_value: 32
          }
        }
      }
    }
  }
  value_info {
    name: "hidden_table"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 32
          }
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  value_info {
    name: "kv_heads_const"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  value_info {
    name: "head_dim_const"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  value_info {
    name: "idx0"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  value_info {
    name: "idx1"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  value_info {
    name: "ids_shape"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  value_info {
    name: "batch_dim"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  value_info {
    name: "seq_dim"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  value_info {
    name: "new_kv_shape"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  value_info {
    name: "new_kv_zeros"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_param: "sequence_len"
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 24
}
