ir_version: 11
producer_name: "mobius"
producer_version: "0.1.0"
graph {
  node {
    input: "model.embed_tokens.weight"
    input: "input_ids"
    output: "v_model.embed_tokens.Gather_0"
    name: "model/embed_tokens/Gather_node_0"
    op_type: "Gather"
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/model: TextModel/embed_tokens: Embedding"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'TextModel\', \'Embedding\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'embed_tokens\']"
    }
  }
  node {
    input: "v_model.embed_tokens.Gather_0"
    input: "model.layers.0.input_layernorm.weight"
    output: "v_model.layers.0.input_layernorm.RMSNormalization_1"
    name: "model/layers.0/input_layernorm/RMSNormalization_node_1"
    op_type: "RMSNormalization"
    attribute {
      name: "epsilon"
      f: 1e-06
      type: FLOAT
    }
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/model: TextModel/layers.0: DecoderLayer/input_layernorm: RMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'TextModel\', \'DecoderLayer\', \'RMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'input_layernorm\']"
    }
  }
  node {
    input: "v_model.layers.0.input_layernorm.RMSNormalization_1"
    input: "model.layers.0.self_attn.q_proj.weight_t"
    output: "v_model.layers.0.self_attn.q_proj.MatMul_3"
    name: "model/layers.0/self_attn/q_proj/MatMul_node_3"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/model: TextModel/layers.0: DecoderLayer/self_attn: Attention/q_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'TextModel\', \'DecoderLayer\', \'Attention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'self_attn\', \'q_proj\']"
    }
  }
  node {
    input: "v_model.layers.0.input_layernorm.RMSNormalization_1"
    input: "model.layers.0.self_attn.k_proj.weight_t"
    output: "v_model.layers.0.self_attn.k_proj.MatMul_5"
    name: "model/layers.0/self_attn/k_proj/MatMul_node_5"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/model: TextModel/layers.0: DecoderLayer/self_attn: Attention/k_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'TextModel\', \'DecoderLayer\', \'Attention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'self_attn\', \'k_proj\']"
    }
  }
  node {
    input: "v_model.layers.0.input_layernorm.RMSNormalization_1"
    input: "model.layers.0.self_attn.v_proj.weight_t"
    output: "v_model.layers.0.self_attn.v_proj.MatMul_7"
    name: "model/layers.0/self_attn/v_proj/MatMul_node_7"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/model: TextModel/layers.0: DecoderLayer/self_attn: Attention/v_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'TextModel\', \'DecoderLayer\', \'Attention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'self_attn\', \'v_proj\']"
    }
  }
  node {
    input: "key_cache.0"
    input: "v_model.layers.0.self_attn.k_proj.MatMul_5"
    input: "write_indices"
    output: "updated_key_cache.0"
    name: "model/layers.0/self_attn/TensorScatter_node_8"
    op_type: "TensorScatter"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/model: TextModel/layers.0: DecoderLayer/self_attn: Attention"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'TextModel\', \'DecoderLayer\', \'Attention\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'self_attn\']"
    }
  }
  node {
    input: "value_cache.0"
    input: "v_model.layers.0.self_attn.v_proj.MatMul_7"
    input: "write_indices"
    output: "updated_value_cache.0"
    name: "model/layers.0/self_attn/TensorScatter_node_9"
    op_type: "TensorScatter"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/model: TextModel/layers.0: DecoderLayer/self_attn: Attention"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'TextModel\', \'DecoderLayer\', \'Attention\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'self_attn\']"
    }
  }
  node {
    input: "v_model.layers.0.self_attn.q_proj.MatMul_3"
    input: "updated_key_cache.0"
    input: "updated_value_cache.0"
    input: ""
    input: ""
    input: ""
    input: "nonpad_kv_seqlen"
    output: "v_model.layers.0.self_attn.Attention_10_0"
    name: "model/layers.0/self_attn/Attention_node_10"
    op_type: "Attention"
    attribute {
      name: "is_causal"
      i: 1
      type: INT
    }
    attribute {
      name: "kv_num_heads"
      i: 2
      type: INT
    }
    attribute {
      name: "q_num_heads"
      i: 2
      type: INT
    }
    attribute {
      name: "softcap"
      f: 0.0
      type: FLOAT
    }
    attribute {
      name: "scale"
      f: 0.35355338
      type: FLOAT
    }
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/model: TextModel/layers.0: DecoderLayer/self_attn: Attention"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'TextModel\', \'DecoderLayer\', \'Attention\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'self_attn\']"
    }
  }
  node {
    input: "v_model.layers.0.self_attn.Attention_10_0"
    input: "model.layers.0.self_attn.o_proj.weight_t"
    output: "v_model.layers.0.self_attn.o_proj.MatMul_12"
    name: "model/layers.0/self_attn/o_proj/MatMul_node_12"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/model: TextModel/layers.0: DecoderLayer/self_attn: Attention/o_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'TextModel\', \'DecoderLayer\', \'Attention\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'self_attn\', \'o_proj\']"
    }
  }
  node {
    input: "v_model.embed_tokens.Gather_0"
    input: "v_model.layers.0.self_attn.o_proj.MatMul_12"
    input: "model.layers.0.post_attention_layernorm.weight"
    output: "v_model.layers.0.post_attention_layernorm.RMSNormalization_14"
    output: "val_0"
    output: "val_1"
    output: "val_2"
    name: "node_SkipSimplifiedLayerNormalization_0"
    op_type: "SkipSimplifiedLayerNormalization"
    attribute {
      name: "epsilon"
      f: 1e-06
      type: FLOAT
    }
    domain: "com.microsoft"
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/model: TextModel/layers.0: DecoderLayer/post_attention_layernorm: RMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'TextModel\', \'DecoderLayer\', \'RMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'post_attention_layernorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.rewriter.rule_name"
      value: "AddRMSNormToSkipNorm"
    }
  }
  node {
    input: "v_model.layers.0.post_attention_layernorm.RMSNormalization_14"
    input: "model.layers.0.mlp.gate_proj.weight_t"
    output: "v_model.layers.0.mlp.gate_proj.MatMul_16"
    name: "model/layers.0/mlp/gate_proj/MatMul_node_16"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/model: TextModel/layers.0: DecoderLayer/mlp: MLP/gate_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'TextModel\', \'DecoderLayer\', \'MLP\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'mlp\', \'gate_proj\']"
    }
  }
  node {
    input: "v_model.layers.0.mlp.gate_proj.MatMul_16"
    output: "v_model.layers.0.mlp.Sigmoid_17"
    name: "model/layers.0/mlp/Sigmoid_node_17"
    op_type: "Sigmoid"
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/model: TextModel/layers.0: DecoderLayer/mlp: MLP"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'TextModel\', \'DecoderLayer\', \'MLP\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'mlp\']"
    }
  }
  node {
    input: "v_model.layers.0.mlp.gate_proj.MatMul_16"
    input: "v_model.layers.0.mlp.Sigmoid_17"
    output: "v_model.layers.0.mlp.Mul_18"
    name: "model/layers.0/mlp/Mul_node_18"
    op_type: "Mul"
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/model: TextModel/layers.0: DecoderLayer/mlp: MLP"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'TextModel\', \'DecoderLayer\', \'MLP\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'mlp\']"
    }
  }
  node {
    input: "v_model.layers.0.post_attention_layernorm.RMSNormalization_14"
    input: "model.layers.0.mlp.up_proj.weight_t"
    output: "v_model.layers.0.mlp.up_proj.MatMul_20"
    name: "model/layers.0/mlp/up_proj/MatMul_node_20"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/model: TextModel/layers.0: DecoderLayer/mlp: MLP/up_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'TextModel\', \'DecoderLayer\', \'MLP\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'mlp\', \'up_proj\']"
    }
  }
  node {
    input: "v_model.layers.0.mlp.Mul_18"
    input: "v_model.layers.0.mlp.up_proj.MatMul_20"
    output: "v_model.layers.0.mlp.Mul_21"
    name: "model/layers.0/mlp/Mul_node_21"
    op_type: "Mul"
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/model: TextModel/layers.0: DecoderLayer/mlp: MLP"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'TextModel\', \'DecoderLayer\', \'MLP\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'mlp\']"
    }
  }
  node {
    input: "v_model.layers.0.mlp.Mul_21"
    input: "model.layers.0.mlp.down_proj.weight_t"
    output: "v_model.layers.0.mlp.down_proj.MatMul_23"
    name: "model/layers.0/mlp/down_proj/MatMul_node_23"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/model: TextModel/layers.0: DecoderLayer/mlp: MLP/down_proj: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'TextModel\', \'DecoderLayer\', \'MLP\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'layers.0\', \'mlp\', \'down_proj\']"
    }
  }
  node {
    input: "val_2"
    input: "v_model.layers.0.mlp.down_proj.MatMul_23"
    input: "model.norm.weight"
    output: "v_model.norm.RMSNormalization_25"
    output: "val_3"
    output: "val_4"
    output: "val_5"
    name: "node_SkipSimplifiedLayerNormalization_1"
    op_type: "SkipSimplifiedLayerNormalization"
    attribute {
      name: "epsilon"
      f: 1e-06
      type: FLOAT
    }
    domain: "com.microsoft"
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/model: TextModel/norm: RMSNorm"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'TextModel\', \'RMSNorm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'model\', \'norm\']"
    }
    metadata_props {
      key: "pkg.onnxscript.rewriter.rule_name"
      value: "AddRMSNormToSkipNorm"
    }
  }
  node {
    input: "v_model.norm.RMSNormalization_25"
    input: "lm_head.weight_t"
    output: "logits"
    name: "lm_head/MatMul_node_27"
    op_type: "MatMul"
    metadata_props {
      key: "namespace"
      value: ": QwenCausalLMModel/lm_head: Linear"
    }
    metadata_props {
      key: "pkg.onnxscript.class_hierarchy"
      value: "[\'QwenCausalLMModel\', \'Linear\']"
    }
    metadata_props {
      key: "pkg.onnxscript.name_scopes"
      value: "[\'\', \'lm_head\']"
    }
  }
  name: "main_graph"
  initializer {
    dims: 32
    dims: 16
    data_type: 1
    name: "model.embed_tokens.weight"
    raw_data: "\013\000\202<K\314><\344\251\342\273\201\347%\274\374\254~;\337\237\206\274R\006\224\274\271\234\360<%\231\360<$;\007\275\367\374\002\273\311\325\207</\366v\272C\'\034;\312N\'\273\373\250\364\273At\205\273\347\316\340\274\351\036\022\273d\007f\274\212\255p\274\342\n\222\274\354\301\344<\365y\370\274p\034}\274\335\276\003\275\376rB<g\322\234\273<\207\217\273A\320\"=\320}\0319\227\321G\274O\252\364<s{d<\205\340)\272\2767\240\274\025\234\231<\341\3606\273,\205\3639\311\321\035<\034\002\023\275E\033\255:^\244:<\027\230\252\274B@\274<\267e\t:2\217\346<\022\376\313;k\231\024<\325\374\333<\246\010\301<\353\345%\275\002\350\034\274\020\272\206\275\377O\007\274`\236\266<\276\021~;\013\237\300<.q\270\274B\265\010\275\000\376Z<\266\254\206\273y\213\372<\004\312\321\274\247\226i\274\316v\337\272\037\240\n\273\340\0072<\326%\020\274\320`D\272i\006\263:\211\2161<w\334\252\274\t\210_<\344?\216<s\010\322\274\002\021E;\234\250\325\274\247\250\023==u\305<\227~\244\273\276$p=\377\231\006<i\2226;\342\004\206<\017\241y\274\334;r\274\315\377\240\274SX\315<\023h\262<iS\307<\226\031\206:M\006\304<\002\321\213<\274|\336<\225\350}<\013\301\264<<,|\274+\233\357<V\266\021< \242\007\274\326\340&\271\275$\017\275\356\036@<\202\220\361\274\367^\347:\342\350Y\273\035S\231<\257\226_;\357\000U\272rk\325;\264\206\311\274\031n\202:\371Nf<2\207\020\2742-t<\3710m<\351\226N<\211\213a<=b?;+\004\350\274\246\340\007=\330~7=\270\331\035=\236j)<y\034\271\274\n\r0\274\335.!<\"\314#<~`\022<\345\2045=\245\337X\274B\252\342<\251H\332;\307\210\273\274\274\305\213;\2030t\273\345\031\302\274>\027\221\274bSU=2\342\373\2746\277\203<x\367z;n|\324\274A>\214<\315Y\253\273\211\321\225<TU)<{\035;<\003\030z;^<>;V\354\200\275o,\210\274\311\267\013:\002\325\n\275Nk\354\274\223\252\244<\030\330\025<n\351\342\273%\005\033<\",\"=\031\315.<n9`\274\271<\374\274r\274\307\273\227\331\212;|\212d\274T\330\177\275#\271\367<G\204Z\270y_\320;\327\353\025\274i\332\177\273E\323\004<\362\303\252;\324=S\274l\367k;\306\020\032=\017\344\313\274>\336\357\273B\2745;\251)\225\274\006\246\217;\001o\326\274u:\327<\353\344\030=\344\345\010<H\221\001\274\375\024r<\207I\013<\r.>\274G!\023=\364\330j<\315\374\264\272\227S*<\335\337,<\276\203\333\274\206\236\361\274\022+\243\274\212\234\376<\212\302^\274\022\310G\274]=\207\274\022\036J\273\272Z\203\274\\nD\275\275\203\002\275?I!\275]g\333\274\242\036X\273\342w\242\274\265\017\342\274WF7\273\324\005\313<\2555\254\274}\377`\273jB\225\274\032\030\221;\257\017;<\365>\013=\226\030\212\273k\245\221\274\024\022\235\274\275\333!\274#\207\374\274\333\016\016\275y\322B\273\272\233\004\275\322\345?\275\266#\217\274\202\030\263:]?*\275WM*=\302\216\336\272\234\360{\273\362;\001;\215\356\210\274m\241$=\347\240=\273\016<@\273\035\274\021\274UbA\272[\032\264\273\215\252\227:\\\324\345;\371\364\273<<A\241\274\024\370\'\273\3627\270\274\302W\302\273#\223\014=\260\306\376<\327\031d<s\226\004\274\200\007\005:\027d2<\206\225\334\273\223\344\253\274\215\302\314<\"h>=\365s\t\274\245:\333\274E\341\266<\324C\036<\220\273\363\273\247\374j\274\367\2134\272\267\010b;m1\242:\201F\247\274\205\376\207;;\366\310\274*7>\273p\321S\273g4o<b\226\250\274\240e\355<\'c\005;y\036Q;\"\241E<\257\274M\274Z4\013<\203\206\215\274\">\241;\314N\033\274H\301\216<\350\215\231;\213\257Q:\227~\217\273o@\006\274\273\353\336<\276\230\220<\0238\305<;\360\364\273\273\337\321\274s\026]\274\"\353\t=|x\254\2749(8\275\364\373\267\274z\315\210;{-:\274\3742\246<\025\320\274<i\242\007\275\366\227\023\274\360\261P\274\324\"\323<o\024\013\275\200\030\352<j\035d\274\245|\2338 \210\301<e\234o;\306m\357\274\3764\024\272\034x\233;\275\267\240\274\007\245\314<\2004\315\272v\020\211\274\205`\230\274\031l\217<\342v+\275\026\314\020\275-\016\035\275\203`\371\274\320.2\273\253Y\341<\360\000~\274\030f\362:o\016\251\274x\345\236\272df\342;=W\t\275\247\001\032=t\256,=\335\337l<vK\020=\371\007\374<\221l\024\275\301\322\241\274\264\276\364\274P\026\247;\0178F\273\354\331\377\273~\361\276\274\317NX\274\252o\274<\273\n\211\274\r\257\261<\256\326W\274k\314q;+\002\365<\014n\241<\367\024K\274Y\253\303\273\267G\240\274\370\241\323\274fa\225;\031$\245\274\r\034\243;\205\2540\275?^\032\274{G\327\274X\363#<$\237S\274\304\226\242\274g\317\027\274\275A\256\274e\335\252<\362\241\207<7\320\211<\005\303\"<\352\316\340\274\202I\333;#6\363;\213k\360;\245\036\304<r\350\036\273e\252J\273\212\343p;3&/=\270h|\274\327\275\273\274\213\350\236;\367\345\257;\222\010e\274\347L+<\025\324\031<DO\221\273\223\346\265<2\271W\275\352_j\273,\016\354<<c\211<;\325\247\273{:\325\273\035\261\231\272\"\224\027\275#\000|;\n8\217:\311\006#\274Yq\003\275\240_\365<\217\005\343\274\300\202\002\275\372& <Lv\316\272\200\212h<B\355+\275\"\030\211\274\246\375H\274n\034\256;\006\005\244\272\336\001E<\224\331A<dP\014\274C\037\234<\2603`;M2\017<\322\301\233<\023\244\r\275&7n\273\202\2525\274\300\177\240\274p\270\255<\231\336\360\274\223\241.=`a\035=+|\221<\266\322\240<e{\374\274+\265^\274\263\266@\274\204\250\313\273\332\362\211<\033%,\274^\354\212<k\305+\274|\200m\274\222Ug<\253E\004\2745qM\271]\337.;D\204\025<\030\362\341\274\211\271C:\3246\225\274W\354\340<\324\342\224<\227\365{<\3711\205<\330\204q\274\301\376\376;}\021\220<a\177\025\274\031\2456<\206/O\272\352&\254<\030\370N=t\"C<\002}\027\275\002\300\356\274Bw\006=\010\322\001=\334\332O\274\261;\017=\276\267\234<\341\223\354<<%\351<\347%\t;\317\034\214\274!?\252<\340\226\323<WG\014;n\255\266<@\035F=\224\341\271<\0131\\\275\017\306I\273\023\211`\273k;\302<\3272\240\273\200\016\"<`\022\025<\320\035\226\273\005J6\274\273\273\254\273\354\340^;\244\244)<\311\017\231;\263b\207\274bv\016=\"\273\360\274\274gJ\272\002\231\315\2724\366G\274;<\3429{\030\337<C\335\357\273\031\343\"\272\211\227\214\274\307.\242<h\236\203\272\004~C=\267\177.\274|\266&\275\210\004\204;\375\201?;\n}V\274\'\207\216\274"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "model.layers.0.input_layernorm.weight"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "model.layers.0.post_attention_layernorm.weight"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 16
    data_type: 1
    name: "model.norm.weight"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 16
    dims: 16
    data_type: 1
    name: "model.layers.0.self_attn.q_proj.weight_t"
    raw_data: "\271\276\005<\226B\023;|Vh<\003Py<d\377\022\274>o\325\274\203v \274\303e\360<\254-V=_D\025=\004\237\260\274]\331\352<.\204\005<w\007\260\273\017RG<F\246\344\274\335\\@<\360F/<\271\272\'\274\306m^\273\302\345\r\274 ;\n==-\326<\2530\231<<\334\245;o<k<w\202\355<\346Mo\274|P\267\2747\247\'\2749\225\220<\233\247\301\274|\271Q<k\033A<N\010 \275\233|\201\274\331BT<\023\014\345\274<(\263\274\334\323\251\274I\243\275<\017xH9\022U\020<I[!\275\035\263\026\275/\2507\274\351\005\365\273\223\214]\274\327\373\241;\2132\304\274f\206\242\274\020\023\t\275=\315\266\273wm\264\274\320\313\230\274\245\323O\274\330\314\250\273]\0148=\247\365%<\247\361G<!\262\353\274\325\226\215\273\'\365\344<\315\021\274<\313\270/:\225\341\213<\264XF<\336\304C<\024>Y\275\206\363\211\273Pu\305<\343^t9\213\256\330:\2259\\\274\024D\270\273\000\261.<\370{.\273\3648\370;\234w\016\273n\277\332\271\327\316\t=\273q\223\274#\222\367\274\022\317\204<\264\260\310;\355lF\2745\313>;.\216\325\274\020\273\031</#\325\274.\256\300;\202\266\330\274G\276\r<\256\000\321\274\214\002\347\273\373\004\347<6.\026=\256\216\354;\312\tc\274K\231\314\274\235\022\013\274\'i\002\274t\231Q<\202N==sB\262<p\230\r<\263\2414\275b\200\255\274!\304p\273\235J\300;\022\337\332\274/\203\332\272\260\227N\273\311_\337\274\370\333u;9O\206<\363\325\311;\233\215$\274\013\r\005\274\227d6\274\362l`\274\226(\037\275\023d\377<\006U\265\274mY \273er%\273\207a\n=\246\205\r<\264\367W<\337\346\224\2741\356\022=\353>B;\240\270\220\274{\'\346<\323\254)\273\362\242\236<s\202\273<D\252\036\274\306OT<\023\324\343\274\241\262D\274\000i\212\274.\200E\274\336O0\274\302\205\253\273yIl<\033I\304\273`JA<R\213\r=^\363\326<\t\002\324<\260\363\227\274\212\206d<s\200\216<\206\261\361\274)\354\360;Kh\237\272\230lo\272\305\336\366\274\274\257s\274e\306j\274\002\277\213<L\214S\274\026\216\240\274\007\315\370;\316?\243<?\362\023\274\002H\362\272\304\240\343\274\005/H\2742h\205\274\317?\205\274RS \275\362j\221<\355\026\232<\342\333\373;\020u\233<JU\364\274?\224\210\270J\246[:\351\200T\274\313\326\257<\213m\323<\246\211(\275\276\313\220<\201n\376\274\325\031\366\271iB\373;|)\343<\346\250M\272]\357\230\273\r\205\0209\376\003\265<Dy\"=2\246\212\274V\326\223\273D<\3178\356\311\277<\237-\212\274\013\022\215;)\360\246<{\326\232:\342\270\r\275:\351\t=x\266\251\274\020\231&\275E\322;\274\035|\363\274\220\021\345\273\220\212[<\367\'\027\274\305\373\312;F\337 \274\222\022\317\273o6#\273\376\212\277\274\204\035\3338\356oO={\003\034\273\251\302G\273f\324f\273\364\222\365<<4k\274\262-\373<\341\302\016\275\336\332\327\274}|\032\275\313\271\373\274\323$\201\274\007c\346\274\246\263}\274b\321K\274\t\226\363\271\324W\210<{SA;\307\322\341:\263\233\336<B\3221\275@\005\336\271\340\262\003<B\237K\273\252\313.=\231\322.=\'#\315\274.\3017<\177\220\223\274\257\240\330\272/,D<\326\346\252\273+\323\024\274\240T\311\273\362\017\366\274%\320\305;\324\020\244<\252\356\\<n\275\242;"
  }
  initializer {
    dims: 16
    dims: 16
    data_type: 1
    name: "model.layers.0.self_attn.k_proj.weight_t"
    raw_data: "\373\342\202<i\276i;\366\262\210\274i\"\267\274,\312\211<\322\344\244;\231\245\2519\263\214\346;\004\371\221\274{Z\005\275BG\001\2744T\367<r \263\273\213\371\031\275\214u\207;\306\2551=Y\361\021\274W\r\252\274\370\273\257<V\321(=\340\321\254;*\247P=\325o6\274\364|{\274\365c\311\274/\303\316\274\323\022\357<\203\311\021=\274\3252\275\271\017I\274\3648\327<\362\020\344<)\323\001\275*\213\277<,Mo\273\216\315\374\274\273e\233;\" \323\273*\321\324<\255\001\010=\244!\310:\305n\256<\241\002/\274\374\350\260;\007L\262;\336\001\203\273\027L\211\274 !\000;\005yM;\004\240\217\273\375@D:\306:\252<\351_\320\274\316:\316\273K\344\013=\322\030\263<\2152\236;Z \017<\200j\245<\000\250!\274\251j\242<A\273x\274\033\251\334\274\223\373\334<K\033\336<biM\274\236\225A;i\022\031=,\341i9\265!w\274\375\010\236<_\300\207<\n\361e\275\031\001\017\274\267\020\326\272Xh}\275\375\306\037\274\002\245\203:\3154\244<A\363{\274\033\035\243\273\274\210b\274b\327#\275R\251Z;.\n\037<[\212\372\273f\024\317;\006\305\313\274\330)\364<a\223\233<`\343\201\273\342\240\022<\321R\231\274\257}\233\272\365\321\307<\370\237\364\274\224\257\354\274Y\275X\275\326\n\223;\212\336o</v\314<n\035\311\274;q\020\275o\235\217\274\016u\206\274Wiz<\325\013\301<\036`\371\273\344\340\202<\232|\225\274r&\201;\317yT<=\347\024;@\'W<\241\323\345\274\027\"\250;P0\027;\2608\324\274\227oA;\2026\230\274d\001\217<\305\r\326<\275\274v<1\t\202;\3737\274\273.pU\272\346\034\006\274\331\331\201:K\203\324\274\375\217<=\027\013\254<\231\211-\274\220\027\346<\\\253\257;\007\250\003\275\301W\007<\020+<9\371\246\225<\206\303\273\2737\266\252:T&\331<\246\262\316<8\200\224\274\320\013\312\274V\354*\2750t\034\273\004\373\252<\267\236S\274V\035(\274\256V\017<M4>\274\216P\227<\246\352<\272\"w;\274\325\263Q<\364\035\005\275\370\204\251<!\030!\275n\253};\331\311\214\274r\335\340<\255\314=;\316;\221\274\\X\366\273WM]<\276\326#\273\315b\275\274I,\274<D\234\013\275K\243\264<\271\354\355:&\377\250<^3:<\005u\005\275D`\007;\224\352]<S\243[;\004\315\023=\276\246S\275s\010T\274\326+1<P\365\020={\206\"=wz\007<\200\007\317:\001\236=;\"\361=\273^\220\234\274\262T\215\274\035\311\223<\251\300\'<]\000\251\273U\255\355;\316\327\245\274\240\211\305<^\216W\274\324_\245\274\346]\330\273s\264\2539\375\251\274<\033\234+\273\377\226\236\274\240\335?\273U-\346\274\225\204\363<\233\354\361<L\014T<\263\035\316\274R[8<\234\227C\273\031\\\010\273e~n<fe\017=\216\006\"<\340\257\251;\262\341\243;@\312\326\274.\302\353\273eO\222<\251KT\274R\362\341<t\371\016=y\277;;@tV8\207[z:\222\005\016\274~\273l\273\231\005\342\274\230u\303<t\362\340\274s\220#=\020\3257;\n[)\274\314\323^\274\3206\224\274\2400\274\274\225pR\275U\260\376\274\020`\333<\336n\241\274\206\374\362\274ko\273\274c\224h\274\252C\313\274\340\036G\275\022\322n<\353\001\307<\035\022\r<\340\221z\273S\216\262\272){=\274\320\177\023<|T\246\274\001~{\274\314\r\332\274;-\027="
  }
  initializer {
    dims: 16
    dims: 16
    data_type: 1
    name: "model.layers.0.self_attn.v_proj.weight_t"
    raw_data: "\247%~<B8[<9R\003=\320\200s\274\2653w\274.@H<\252\024\373\273\241\353\300\274[\232\242\274\240\253\304\273x1\221\274\264\242\257<y\"\034\275\313\357\216;sk\242\2744\266\025\274\217R\217\273\374\367\017<\370e\254;Gh-\275\002U\263\273\000w\025<)_\242<]\014\201\274\031\004\265\274\371\023\034<\2079\261<~\356\034\275+^\311\274Y\267)\274/\252\022\274\004\033\213<\216\376\032<(\262\"\274\264e\031\275\005K\253<\364s\212<o\240p\273\2536\002\274\366\t\021\274\274\224\242<\360v<=\275\307\202\273\r\3062;\000\264\335\274r\357\247\274\341A\203\275\320\006\361\2734(\352:\000\t\255\272n\316%;j\034K\274@C\240<\n\340\010=\313\360\230:\202\026U9oh6<\211M\001=\tI^< \t3\274\374\303\240\272\200\364\376;\020m\205\274\357.\250\274\247\016\324<]\306\020\274\364\\\025<tA3\274`\266\267\274\267|\251\274\347\271\243<\000\261(\275\271\306\235<\275\275\320;\3243\274<\371(\215\274\005\370 <\337$\223\2730\275\244<b5^<U\335\217<^\035\027\273\300j\304\274\014\370L:\322\265$<=\014\252<\004\035 =\276\332W<\332\230\231\274\"\220\225<w\234\232<\263\351\026=\306\021\032=\302\031w;,6\325;\331q\205\274S\2544\275\270+7<\266\t\224:\313\302\026<~\322\303\273\231\323r<$\264\\\274\353\237\026<f\373\341\273\013\'\326<\037\201\2039\204j\t\273\"Ys:\274\0033=\023\212\302\272\002R%\274\353\237\237\274\220\257R\274\210i\236\272)\023\024\275s\367k\273\366\021\242<\210\036\013< =\331\273A\014\247\274\207\371\027\274\3512\256:\324\327:<\275\177\027\274\300\010\310\274\302\304\211<|\313\214;\355\265.\272\257\352i\273Rd\305<=\005B<L\241\367<\354\272\364\273\235\321$\275R\226A\274\265\333=\273\020QB\272[\365\262\274c\206\366<UE~\274\316\207N;\277\224\207\272\322Df:U\227\207\273\324\272\215\274\310\205\226\274{\247G\274\371\353\377\272\323\232\232\274+c\354\273\214\"\220<\303\271\022\275t\016\032:j]\250\274\036\313\201\274c\220j\274\362\316&\274\347k\001\275\363\345z\274\317\375\276\274nKn<t\240\t\273\201\245\007;\311U\2279\034\025l<\224\364J:\007\003\\\274\304\026/\274\234RJ\274\223U\010\274\267\3735\271\005\0201\273\265\2602<\nu\253\274C\313\177\274\234\214\021<K;\2469\034Mh;q\230\211\273A\225\364:3\220c<6\316\035:\026\034\227\274\233\344\037<\230%\216<\201\372W<Jgd\272J\331\353;4a,<\204\022\323\272\204\010\220\274\360\275d;N\232\210<\230:0<!J\270\274\240B\345\274\345\236\'\274\242\034\224\273\270\263\274\273\276M ;yR(\273\rwL\272\307h\343<u\223\202\273\341\257\207<\345s\317\274\355\311\263<4\217-\275\330\207)\2741\235\234<~\256\324\272\020\0046\274\264\230\212\274\246\220\213\273\256\202\233;\240<\357<\000\266\330\274\"\"\360\273;\227V;b\345{<|N-\273\336\230Z\274`\315\244\274b\243\244<s\367$<\031\255\362\273\213\326/=z\371\030\273G\342);\206s\036=\311E\037\274Y,\265\274\'\001\274\273\355\000\033=Ue7<\033\1778\274\216\211\n<Mt\'9\020t\202<[\261*<\221\272\232<I\222\340<x\020\240<\034n\236;\177\230\033\275\226b\036\274Y;\311<\374lB\27582K=i$\250\274\226\255\013=I\251\266\274\344c\266\271\273%A\274\233 \372\273"
  }
  initializer {
    dims: 16
    dims: 16
    data_type: 1
    name: "model.layers.0.self_attn.o_proj.weight_t"
    raw_data: "7X\207\2740\274\t<5\213\026\274\007$\345\274\300D\261<\t\037\202\2748\37179\336\362:=\207\177+\274\0208\033=\371\300\337</\030\250\274\004\3215\274\211\226\211<\330\310P\274B|\n\274\001\335\361<\022<r<\274\244\210\274\345\204>=a?q\2736\254\223\273\313\357\274<B\373\t\273\231*\267<\242T\375\273rV\n<\375z\n=\\\371!;K\303\306<{{\212\2749\353{\274\320\214\224<\223\317\263;\354\002\335<3F\333\273a\315:<\341\210J\274\313\357\202;Vq)=\363o\255<\337I\202<m@ <j\266`<B\033G:\257\231L\274v\013\'\274\373\237\260<\364\320\262\274NLJ\275@\022z<w\243\200\274d\322\274<\r\001\221\274\306o\215<\020\336\243<\300G\024<\345\242\241<\230\222\205\274\301\211!<\024FP\274\231n\037<\356Z\243<^\371\324\274~a7\274n\036\246<\244#\342\274\252\371J\274U\017\314\273\013\320\222\274\311\265\306\273tT\224\273\351\215K\273\201\001\201\271t\2551<\177J\004=\362^\237<\367\236\221<\302\236\013\275\302,a<\242\023\204<[0\346<v\355\247\274\"\302T\274\"a\310;\206\300\226\274\244\007\306\273\r\352\241\274\246\346\222;@\277\330\274+`Y\274\006&\314<k\360\303\274\363B\260\274!AJ\275\267\377_\274\331+f;J\253\244<\240\373\272\2745\247\314\273\306\n\222\2749\"_\274\264\023\t;\303E\035=\364\033\330<\316\243\006;UFZ<\253\360c<\005\267$<\207/\223\274\276\343\031\274\266g\255<A\331\370<=~\340\273l\360M<(g ;^J1<\233Z\r\272{\237\212<\326\364\205:\202\264\262\274R\275\310<W\375O\273\2734\237<\361\377 =\255\376\232\274,\256\"<\262\374\257;\260\234\036\274\223\330\345<\013\027\331\274\336j\302\272R\354\245<\201I\315\274\246xK\2733\206v\274\271rC\274s\367C\270\320{\025\273\024\375\227\274I[\230<Ul\213<\234\217q\274~\246:;#\337\004<\360\345U\274X\300A<L\246\327\273\200\021\204\274\363\305\\\274\342\204\272\274=}<<\355\0165\274 w\007\275|\334\3439\300\262#\274\305\016D<\3755\240;iV\276\2743\251\331;\236\232\223<\367\223*:t\345\340<\375\324\202\273\300\010\256\274\200\322\007\275\361)\216\274g\3353\275!\302\301<J\302\344\273Zv\025<\006\207\271\274\004\216\263<\343L\030<\016\340\266\273\301\001\260\274\313N\253\274\210\n\006\275\220u~:\222\237+\274\025\323`<-5!\274\335\016\004=I\\\302<\024\344\317\271\'\240\274\273_\215\031\274F\222\267<\0016\256\274Ju\376;\316\001\322<\244\331\233<w\027\264<W`\234;\334H\277;\3075\r\274n\022l<\202K\033<\202\357\271\272\312\315V\274;\261d<\376\270\264;}\332\216<\217\314\010\274\346h%<\217\234\250<\245AY\274\230\024\274<\371\352l\274G\250P<\335\233\213<\341R9\274@\371\025=\216r\343\274\207|k<\343\252\235\274\230\002,\274\331_\314\274\n\257\323\274\003\004\210;\227\240\352<-\305\222<\231\363>;\315G\202\273\325rp\274w%\351\274\373a\211\274\206\3632\275\004\r\254\274;<$\274yM\235<]L\334;\322\212\262<U0c\274b\257\031<\200\210l\274\242\225\016\275IU\253\274u\024\237;-\373\246;\260s=\273\304\231&<`t\242<\352\214\357<02\331\274t:\033<\216\241\231\274\263\300\3449I\201\035\274\345\2127;\231h\273\273\376\033\253<\246\256\326<\312\252\311\272\0053\243\272\200I\r:"
  }
  initializer {
    dims: 16
    dims: 32
    data_type: 1
    name: "model.layers.0.mlp.gate_proj.weight_t"
    raw_data: "\204\303\256<\363bz<\241\020\\\274\252ii\274\302\256\221\274W\312\277<\000s)<\275\024\240<L\272V\273\026\311\210\274]\226\214\274\257\305\233<\303x\353\2735\343E\274\367\270\332\273\\\266N\274v\353#\274\026\353\203<\324S\200\274\252SQ\274\245=\334\273I\357\306\273\t\313\236\273\177\246\r\275\223UU=\023\021\250<%\324\245<\225\220\212\2736\215\224;,\372\216\274\034\036\252\271r;\001<\212\"\320<C\025\374<\263\033\025=\340EW\274\227\231\242\274\023\375\252;\307\227\026\275K\206\n</2u\274\265\357\016\273u\016\r<\271\355\305;X\216\261\274\214\267M\274\007\250\214<\335HT\274\320\001\232\274\246\257(\273gJ\242\274\336@w\271\024!\314\274\327p\3449\367\232\241;\0221`\275\n5h\274\324\022\314<\335=\301<\006\271\"\274[\252=<w\"\224\274[\2168\274\241&\333\274\357\372\335\273\315\251\217<\001\002g<\221\000\232;\212\276z\274\371\000\232<\207\024\242:\244\256\016<\033(Y<\034/\325<Uo\315\274S\344j;\n\352q<\220\326\227\273\320\311/\273\020$\027;jY \274\244\307\262<\275\363}\2749\014\253\273\334\207\252<\332\313\013=r\303\276;@y9\275D\343\204<\t\235\262\274\351\275P;b\022\311\273\360-O\2752\244\226<v;\031\275\2536\352;s\253\341<^\360J\274\3021\2249\352\230\257\273t*\317\274\211|\266\274!E}\274\364{0;\270\364e;\206\346L\274\260\036\355\274Cw\004\275\200#~<\303\354\035<\273\n\270<E!d=q\241\024\273\267\302Q<K\304\256\272\2334b\274\223\032\272\273w\344\311<\\D\343\273\235\335u\274&\030\001=\330\260\224<\227|\023\273\227T\350<\247\343\254\274\312\014\311<+Xc\274Y\033\231<&\212>\274;\343\005\274\340VD<\275\316\217<}\215\300\272\206\210%<\331\351\375\273\247\256\\;/\254\201<\301\273\020=\233mM<\302\n\005<\277\334\024\273b\326\347<\264\211\206\273\302\321\027;>\277\207\274\007F\316\273\021c\036\273e\376x<\377o\230\273\016u\001=\363\313U<\017\252\351;\206Pl<\346\\a\273\224v\353\274\302\276\036;g\265\000\274\371\272W\275-8\026\274yD\266<_\023\003\274u-?\273\246p^\273\224\373\035<F\350\374<\353\251\023\275\353\374\337\27362\231\274\233\004\025\275\251w\201:\231\343\030\275\373\347-\274\240\305\024=2\'@\274\311{\220\274B\335\024\274\366\353\200<\334\213\244<\3733\320\274\301\017\253<I&G=R$\314;[\253G=@=\210:\225,\300;\353\275\343<\t\025\212<\304\340\200\274\373\372\340<6\350\022;\324\022M\274j\226\242<ihd<?\'\200;NJ\364\274T\262\347<\025\002\327\273\262\305\022=\331X\212\274l4^;\370c\323\274\346m\333<\2454y;\376\231;=\316\326\214\274H#\201<\313d3\274\035\262\276:\360\242\327<\2028\023\274,\237\024=\033zJ\274\222\221\256\274\376\235\026=MR\215<\203\250\220<s/{\274h\024\t<9\267,\275\271\273\205;x$\335\274\241\330A;}\361\227\274\2114\352\273\251\306d\273\311vj\2748\034\335\273\344\341\005\275\026\374\033<\275\203 \275\002\302\013<\231V\000<\242/\260<\016\351\024;\353m\027\275\037\\\t\275Dc\206;\245\221\216\273l\313\321\2737\211b\274\"4\374:\225\254\377:Gh\210\274\366\342\004<\017\014/\274\231\361L\275\3602\023;\n7\210<\374\264\216;,*\365:\376:\204\274U\252\031<\311\271*\274T\366<<\234\225\270\274r\023i\274\352\372m\274M\274\214<\301\304\327<\257\305Z<\320\272 <|\322^8\226\t\216<\373\340\331<R\216\t<\333\252\n<\302\177Y<{\336n\274C\375o<\335\302\303;\225\357\342;F\262K< \362\035<k\263\374\273\263e\277\273\227\336\021\275\336>\227\273*t\010\275v\370\240<\313;=\274/\261k\274\177\013\030\274\370\213\236<\237\331\020\274\327\371\200\274(\224\242\274IX\021\275\341\250\265\274\275\345\202\272q\n\214\274\233\300\216<\200\227I;\335\363\253<\320yC;K\200\3679RT\302\272T,\272;g7;\2749r\007=.7\254\273}\\<\275\232\016\024\274\363j\t\275\375\361.<\027%7<\242]\222<\311H\216<<\'\201\273^\203\364:_;\205<.\n\035=-_\221\274\t\310\306<\226\304-\274c\326\000<4e\267<\354?\r;<IC\273\246\215[\274\323\366L\274\3431\232<{\276\031<\304\005=\274\373)^:K\027\364<o\362E\274\330\341]\274e\240\255<\371\317\204\274\235\332\377<\323\000\300\274\005\333\260<^\332Z<}`\205;O\272\323<e:\244\274g\372s<\2354\364\273\323\213\327\274\252\362\316;\223V,\273\266\177\250;[!\253\274A\024\223<\262\027\220<\177\377\n\273\301\211\010\274\301\004\212\274\366R\204\273\217\023\350\273\224[\255\273\362\270\206:Pc\000\274\027\344E\274\201\210g<\360D\265;\203\017\231\274\023`\337\273\376\274|<\260\346\210\274k\246\375\273\346\003\211\273\244\227\242\272e\321b\274&T\216<\375/P\273\226\342\221\274+,\021\274\270\300\013;\224\244L<\223\320\303:]\324\263;=/\n\275sh\232<8=4;\"]\263\274*+p<n`0<a(\344\273K\317\327;\301\017;\272\257r\n\275\261\351\017\274\315\300\243\273\231\265,\275J\377\023\274\200\331\005<\361\220\007<~\324\001<O\351\211:\244-\247;\035\211\253<\023\374f\274Kb\025\274\246E\304\273\364a.<=\255\003<W\033\211\274\373:]<\212\373H<\210M\230<~\262\230\274\322w+\271\367&[<?\365\007<\017\257@:\200\032H<\230?\310<\2050\265<NR?<\362J\210\2732T\247\272\251 \206\274\371?E\274\t\274\306<\276\2051<`\261\256\273I\270\314:\325\345\347\273=\004@\274\177\037\002<\224!\353;\225+O\274{AV\274JT\334:\252\211\245<ZY\243\272\270\350\253\272\3053\355\274\265\007\302\273\231\005v\274\315o\244;=;\035<\234 n\273\207\306%\275r\366\224\274yL\344\273\013h\277<\320n:<T\346/\274-\001\236<\nJ\327;{\256\310\273Sd\212<\3714\023:<\315\245;K\003\273\274`|\326;|\322a\274\266j\034\275\230\031\332; \270\366<\314.x\273N,e\274\nd\301<\016\020\374;$D\207\274J\372 <\347+\245\274\267\254.\274\327`,\274\200\220\300<*a\227<\362\273\312:W\'*\275\312*\366;\347\267\350\274\325\032\331;]\227:;\261\033\004\274\306\247D\275\336\007/<\351{\200\274\033w\277:\251\302\034;!\006^<\251\201\302;2\022$<\345bk:F\027\035<F\233\252;5U\343:\346e\024\275\305\317\350\274\004\312\275\274\002T\324\274\362;\205\274\027\177\271\273\275\300*\275=\230\321<\231X\334:yI\241\274a*m9\225\225R<\222g<\273\235{\225<\034D\260<\014\251\357<\006\371\177<\334\275\037\274\216b\016<\377\251\010\274+3\273\274\234\300\245\2737\227H\273\0311\240\274\204;D\274\317<\";\265\223L\273\257\346\314<\317\003p\274C\276\217<"
  }
  initializer {
    dims: 16
    dims: 32
    data_type: 1
    name: "model.layers.0.mlp.up_proj.weight_t"
    raw_data: "\352\263\231\274\352\312\246<\336\"\010<BF\257<\357\225\306\273\257\235\253<\222\245\020\274G)\252;\"\235\206;\227x\347\273{\273\334\273\264\001\274\274\256\274F<nr\215<\300\263J<\334\223\250\274\":\317<\330..\274\273\264\267\273s|b<t\023c;\352\213+<\346\220j<\276\257\376:\334\302p<\202,\235:Vn\241\273lct<D|\334\274\024\r(<=O\316;@\t\327;~\256\333\2731R\020\275V\241\214<[T+\275\246X\332;dY\347<<\021\350:\351\252.<\016\254\346<\244Ec<]\347\031\274\370\351d<~\361\005;\353\037\217\273\364T\205<z3\000<\327\354\305<\036\223\257\274\256\2074\273\244=\"=\233\256\202<\247S+<\201\362s<\373u]\274\241\230e\270\345\313\n\2754\366\353\272\013\021\021\275\273\024\215<\007Q\254\274\356w\265\273\256\305u<\240\277e<\376\'\312<\340B/\274K\014\377\273u\366\270<=\1772\274\300\343-\275)V ;\212\341g\274\031\\\r:\340\340=\274O+U\274\364/\216\272Aw\354\273~\031\'<\206\237\303<\017\300\265\273]\226\211<\240\314\336<\325H\273\274\002\316H\273\330\006i<\242W!\274\031cA\273\005\310W\2735\004\367;r\371\021\274b|\323<\355E\277\274\3748\315\274\357\300\037<B^\202\274\375\240\221:\325,}<\370\n\326\273\244t\211\274\302\022\207\272\000\363Q;\206\243\274\273\320\330a;\023q:<\313nS\273\263\261\311<\326\305\"=\217Y\254\273\246LL\274\214\213\326<\036\nw\2731\205\205<w\205\343<\233>\267;\251\0377\275\315O1\275h\250\223\274\321\255\216<\317\346N\272\355\003\206;\203\322\000=g\366\326\273\336\014B;\343Pm;\375\000\035\275]\206\020\274\252\215\225<\323\301#\274\323H\361\274P|\252<\262\024\330<b\307\246;\2171\202\273p\342p<\035\333\227\274\241y$\271\275\023\323\274!\3371\273\241\017\027\275A\331\025\274\364\305.=\370\021\'=\345I\351<\370\006\370;g\337\006;y\233\272<dG\212<{\252\004\275`\271\272\274\213\035\261<\t\017\005<AX\373<|AB<\255w\300<\347A,;\207\263\211;e>\317\274\264\324\303;\316\201\205;^\330\230;)\2017=+vY<I\177\303;WD\300\271\237\023\"\275>\303:\275a\220\001<!\034\r=b\\A:\\\347M\274\327m_\274\004S\237\274\364\244\003\274\203\213\021\273%\317\267\274W\321\202\274J<\301<\034\'\226\274&Hn;E\255?<\002\010\357\274\360o\226\273~z\277\274F\271\217\274)\335\272<Dy\301\274\242F\256<-m\024;p\211\353\274\215\247\207<o\213\307<\024k\222;\311N\031=g\275\214\273\253C\001=\245T\275:\203!!9\207\006\220\274\t\325\223;\241\"9\273\342\200\025<\302*U;\347\261\352;\356\377\235\274I\016$\274esW<d\257\244\274\251\237\265\274\3338,<}\023\214<\331-9:\370\301\261:7(Q\274,4g\274\213\323\220<\364\234*;%\216\330<\'\272\003=\211\251j<\'\225\252;\\n\265\273\030p\2069tnG\274\022\227$=/\243,\274[\026\017\275p\247\232<\253>\241<D\272-\273\031\037\276;o\376X\274\312y\177\274F\206\313\274@}r<@\255\337\274\222%\025\274\200\204\245\274&2R\272\335\\o\271\200\022J;\"\3269\274\207\222\224;\035}\266\274\3112\202;\356\240\035\275u\024\030\274\354\010\201\273\324p\023\273l\252\375;\201\235\246<\211F\227<\253\254\362;\365a\037\274\177\204\216<`\250\235\273\207\235\000=\333\266\021<O\336\324<`\352\\\274\275\261\316;D3H;f\3624\275\027\374\307\274\357\221,\274,AR<JO)\272\231E\013<W+N<v\022\227;\260\220\000<m_\010\275\035\"\224\274\330}2<g\260\203\274\200\342V\274\036\266\367\273j\255o;\316\271K\273\325\354\240<\017/f\274{\021\005\274E_)\275$\037(<\365\363q\274\346\242\326\273\362?$\273\260rE\274@\302\035\274R3j\274\207\236>\274d\317\016=A\217\031;&\022\025<\270\373\353\274gD\256\274\252(\335\274\036\256X\274\206E\236\274;\305\003<\345\353\274\274\344*\002<\341\326\342\274@<\254<\330EG=\305\305I<\031\307\306:\320\366T\272+h\227<\306ub\274\311\tw;\271\315\016<\177a\007<\346\335\271\272\322\357\242\274\306\024\022=\220\004\013\2759.\232<\r6\251\273\325\325\276;2\266\237\274\n9\n=\007|\210\272\341\353\226<\360\016 <\240>\360\2747O\365;\210\355\026\274i\031\304<\252\330-\274\030@\307<3\177.8E\031\243\274\345\034\364<\255h\206<G{\002=\363\262\321:\025ZB<\342\356@<0[3<\336\000]\274\300L\214\272V\316\017=BV\005\275\273\027\276\273\231V\203\2743s\302;7\327\344\274\242\317\205<J%C<\253\217\375\273\362\017!=M\273\212:\334\331\352\272\033\337\340\273\201\306\326<\256$\276<\234\032\365\274=\350z<\362\372\272\274\263\n%<\233\035\021\273\353\262-<\316\370&\274\201\305\347<O\315\010<k#\\\274\3471f<pH\244\274Ez@<\370h\305\273\302\211J=)\3039<\325U\026=\215\356\017=\212\005\267<\'G\020\275\312e,<.z\256\274Oq\032;\267\262\013;t\'\372\273\234[\306\274a\273\267\273\236P\322;\364R\310;2N\272\274t\217\013=\223\245q<\327\373\255\273\026\237\026\272\244\270B\274=\272I\273\330\351\021<!\201W;J\342\277;\235\001\010<J\014X<\320\200\200<RPv<r\207\\\274]\376\210\275\313\t\227:_\212\014<h7\016=\256\346\377\274oYD<\007\333\370<\206\223\353<\260\031\001=S\242\005\275]\002\233\274\344jP<\276\314f\274\305S\004\275X\3707<\301x\256\274\254@\332:\230&X\274S<D\273\314\310Z<\217P\026<\247n\026\274Q\240\231\271\n\374L\275w\202\n<\314\360`=\"MX<\276\327d\274Dv\274<\224\365\023\274\376X\320\273\367\246\217\274\223\233\336\2740\035D\274g(P<[\\d\273VT <\241\261\363<)\265\315;\343\036\222\271k<\313;2\237\032\275\306\217\022<\330\315A\275I\234k\274\327\342\022\275\002\215\256\272\253Z\326<\005\334-;\263\237k\274\374\332)\274\311\214o\273\0008\333\273\322N\351\274\307\227\240<\333\3321<\231r\2639T\315\252;\205\267\223\274\275E\311<\245\244R\274\224\377y\272\020\304~;\271\250w\274\242\261\200\274\256\342h<\027n\242\274N\225\333<P\211?<\265\232\323;Bn]\2730\343v\272)\033\272\273\330F\016\273\375\365\236<L\\\026\275\217\375K\274\001\265\216\274\265\376\2269\027\177\014<\362\214\026\274@\204\204<\nH\275<R\352\241\272\263\207\211\274\360\216Z\273Ks\236:\"jv;\323\"#;\013\371&=8az<\0173\313;X\355\306\274E\024&\275\002{\244;\351W\t\274q\235\033;@`\032<\202(R\271\227\343\343:\335\264[\273Mq\222<\262\200\202<t\270\213<!\207\364\273rG\334\274\034\305+\274\363\016\370\274\002^\016=\346dq;7\274\316<"
  }
  initializer {
    dims: 32
    dims: 16
    data_type: 1
    name: "model.layers.0.mlp.down_proj.weight_t"
