ir_version: 4
producer_name: "pytorch"
producer_version: "1.1"
graph {
  node {
    input: "input_mask"
    output: "97"
    name: "Unsqueeze_0"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      type: INTS
    }
  }
  node {
    input: "97"
    output: "98"
    name: "Unsqueeze_1"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "98"
    output: "99"
    name: "Cast_2"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "100"
    name: "Constant_3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "100"
    input: "99"
    output: "101"
    name: "Sub_4"
    op_type: "Sub"
  }
  node {
    output: "102"
    name: "Constant_5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000@\034\306"
      }
      type: TENSOR
    }
  }
  node {
    input: "101"
    input: "102"
    output: "103"
    name: "Mul_6"
    op_type: "Mul"
  }
  node {
    input: "input_ids"
    output: "105"
    name: "Shape_8"
    op_type: "Shape"
  }
  node {
    input: "from_slice_01"
    input: "105"
    output: "106"
    name: "Expand_9"
    op_type: "Expand"
  }
  node {
    input: "bert.embeddings.word_embeddings.weight"
    input: "input_ids"
    output: "107"
    name: "Gather_10"
    op_type: "Gather"
  }
  node {
    input: "bert.embeddings.position_embeddings.weight"
    input: "106"
    output: "108"
    name: "Gather_11"
    op_type: "Gather"
  }
  node {
    input: "bert.embeddings.token_type_embeddings.weight"
    input: "token_type_ids"
    output: "109"
    name: "Gather_12"
    op_type: "Gather"
  }
  node {
    input: "107"
    input: "108"
    output: "110"
    name: "Add_13"
    op_type: "Add"
  }
  node {
    input: "110"
    input: "109"
    output: "111"
    name: "Add_14"
    op_type: "Add"
  }
  node {
    input: "111"
    output: "112"
    name: "ReduceMean_15"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "111"
    input: "112"
    output: "113"
    name: "Sub_16"
    op_type: "Sub"
  }
  node {
    output: "114"
    name: "Constant_17"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "113"
    input: "114"
    output: "115"
    name: "Pow_18"
    op_type: "Pow"
  }
  node {
    input: "115"
    output: "116"
    name: "ReduceMean_19"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "111"
    input: "112"
    output: "117"
    name: "Sub_20"
    op_type: "Sub"
  }
  node {
    output: "118"
    name: "Constant_21"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\314\274\214+"
      }
      type: TENSOR
    }
  }
  node {
    input: "116"
    input: "118"
    output: "119"
    name: "Add_22"
    op_type: "Add"
  }
  node {
    input: "119"
    output: "120"
    name: "Sqrt_23"
    op_type: "Sqrt"
  }
  node {
    input: "117"
    input: "120"
    output: "121"
    name: "Div_24"
    op_type: "Div"
  }
  node {
    input: "bert.embeddings.LayerNorm.weight"
    input: "121"
    output: "122"
    name: "Mul_25"
    op_type: "Mul"
  }
  node {
    input: "122"
    input: "bert.embeddings.LayerNorm.bias"
    output: "123"
    name: "Add_26"
    op_type: "Add"
  }
  node {
    input: "123"
    input: "bert.encoder.layer.0.attention.self.query.weight_transposed"
    output: "125"
    name: "MatMul_28"
    op_type: "MatMul"
  }
  node {
    input: "125"
    input: "bert.encoder.layer.0.attention.self.query.bias"
    output: "126"
    name: "Add_29"
    op_type: "Add"
  }
  node {
    input: "123"
    input: "bert.encoder.layer.0.attention.self.key.weight_transposed"
    output: "128"
    name: "MatMul_31"
    op_type: "MatMul"
  }
  node {
    input: "128"
    input: "bert.encoder.layer.0.attention.self.key.bias"
    output: "129"
    name: "Add_32"
    op_type: "Add"
  }
  node {
    input: "123"
    input: "bert.encoder.layer.0.attention.self.value.weight_transposed"
    output: "131"
    name: "MatMul_34"
    op_type: "MatMul"
  }
  node {
    input: "131"
    input: "bert.encoder.layer.0.attention.self.value.bias"
    output: "132"
    name: "Add_35"
    op_type: "Add"
  }
  node {
    input: "126"
    input: "concat_shape_0"
    output: "146"
    name: "Reshape_49"
    op_type: "Reshape"
  }
  node {
    input: "146"
    output: "147"
    name: "Transpose_50"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "129"
    input: "concat_shape_1"
    output: "161"
    name: "Reshape_64"
    op_type: "Reshape"
  }
  node {
    input: "132"
    input: "concat_shape_2"
    output: "175"
    name: "Reshape_78"
    op_type: "Reshape"
  }
  node {
    input: "175"
    output: "176"
    name: "Transpose_79"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "161"
    output: "177"
    name: "Transpose_80"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 3
      ints: 1
      type: INTS
    }
  }
  node {
    input: "147"
    input: "177"
    output: "178"
    name: "MatMul_81"
    op_type: "MatMul"
  }
  node {
    output: "179"
    name: "Constant_82"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\363\0045@"
      }
      type: TENSOR
    }
  }
  node {
    input: "178"
    input: "179"
    output: "180"
    name: "Div_83"
    op_type: "Div"
  }
  node {
    input: "180"
    input: "103"
    output: "181"
    name: "Add_84"
    op_type: "Add"
  }
  node {
    input: "181"
    output: "182"
    name: "Softmax_85"
    op_type: "Softmax"
    attribute {
      name: "axis"
      i: 3
      type: INT
    }
  }
  node {
    input: "182"
    input: "176"
    output: "183"
    name: "MatMul_86"
    op_type: "MatMul"
  }
  node {
    input: "183"
    output: "184"
    name: "Transpose_87"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "184"
    input: "concat_shape_3"
    output: "196"
    name: "Reshape_99"
    op_type: "Reshape"
  }
  node {
    input: "196"
    input: "bert.encoder.layer.0.attention.output.dense.weight_transposed"
    output: "198"
    name: "MatMul_101"
    op_type: "MatMul"
  }
  node {
    input: "198"
    input: "bert.encoder.layer.0.attention.output.dense.bias"
    output: "199"
    name: "Add_102"
    op_type: "Add"
  }
  node {
    input: "199"
    input: "123"
    output: "200"
    name: "Add_103"
    op_type: "Add"
  }
  node {
    input: "200"
    output: "201"
    name: "ReduceMean_104"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "200"
    input: "201"
    output: "202"
    name: "Sub_105"
    op_type: "Sub"
  }
  node {
    output: "203"
    name: "Constant_106"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "202"
    input: "203"
    output: "204"
    name: "Pow_107"
    op_type: "Pow"
  }
  node {
    input: "204"
    output: "205"
    name: "ReduceMean_108"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "200"
    input: "201"
    output: "206"
    name: "Sub_109"
    op_type: "Sub"
  }
  node {
    output: "207"
    name: "Constant_110"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\314\274\214+"
      }
      type: TENSOR
    }
  }
  node {
    input: "205"
    input: "207"
    output: "208"
    name: "Add_111"
    op_type: "Add"
  }
  node {
    input: "208"
    output: "209"
    name: "Sqrt_112"
    op_type: "Sqrt"
  }
  node {
    input: "206"
    input: "209"
    output: "210"
    name: "Div_113"
    op_type: "Div"
  }
  node {
    input: "bert.encoder.layer.0.attention.output.LayerNorm.weight"
    input: "210"
    output: "211"
    name: "Mul_114"
    op_type: "Mul"
  }
  node {
    input: "211"
    input: "bert.encoder.layer.0.attention.output.LayerNorm.bias"
    output: "212"
    name: "Add_115"
    op_type: "Add"
  }
  node {
    input: "212"
    input: "bert.encoder.layer.0.intermediate.dense.weight_transposed"
    output: "214"
    name: "MatMul_117"
    op_type: "MatMul"
  }
  node {
    input: "214"
    input: "bert.encoder.layer.0.intermediate.dense.bias"
    output: "215"
    name: "Add_118"
    op_type: "Add"
  }
  node {
    output: "216"
    name: "Constant_119"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000?"
      }
      type: TENSOR
    }
  }
  node {
    input: "215"
    input: "216"
    output: "217"
    name: "Mul_120"
    op_type: "Mul"
  }
  node {
    output: "218"
    name: "Constant_121"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\363\004\265?"
      }
      type: TENSOR
    }
  }
  node {
    input: "215"
    input: "218"
    output: "219"
    name: "Div_122"
    op_type: "Div"
  }
  node {
    input: "219"
    output: "220"
    name: "Erf_123"
    op_type: "Erf"
  }
  node {
    output: "221"
    name: "Constant_124"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "220"
    input: "221"
    output: "222"
    name: "Add_125"
    op_type: "Add"
  }
  node {
    input: "217"
    input: "222"
    output: "223"
    name: "Mul_126"
    op_type: "Mul"
  }
  node {
    input: "223"
    input: "bert.encoder.layer.0.output.dense.weight_transposed"
    output: "225"
    name: "MatMul_128"
    op_type: "MatMul"
  }
  node {
    input: "225"
    input: "bert.encoder.layer.0.output.dense.bias"
    output: "226"
    name: "Add_129"
    op_type: "Add"
  }
  node {
    input: "226"
    input: "212"
    output: "227"
    name: "Add_130"
    op_type: "Add"
  }
  node {
    input: "227"
    output: "228"
    name: "ReduceMean_131"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "227"
    input: "228"
    output: "229"
    name: "Sub_132"
    op_type: "Sub"
  }
  node {
    output: "230"
    name: "Constant_133"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "229"
    input: "230"
    output: "231"
    name: "Pow_134"
    op_type: "Pow"
  }
  node {
    input: "231"
    output: "232"
    name: "ReduceMean_135"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "227"
    input: "228"
    output: "233"
    name: "Sub_136"
    op_type: "Sub"
  }
  node {
    output: "234"
    name: "Constant_137"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\314\274\214+"
      }
      type: TENSOR
    }
  }
  node {
    input: "232"
    input: "234"
    output: "235"
    name: "Add_138"
    op_type: "Add"
  }
  node {
    input: "235"
    output: "236"
    name: "Sqrt_139"
    op_type: "Sqrt"
  }
  node {
    input: "233"
    input: "236"
    output: "237"
    name: "Div_140"
    op_type: "Div"
  }
  node {
    input: "bert.encoder.layer.0.output.LayerNorm.weight"
    input: "237"
    output: "238"
    name: "Mul_141"
    op_type: "Mul"
  }
  node {
    input: "238"
    input: "bert.encoder.layer.0.output.LayerNorm.bias"
    output: "239"
    name: "Add_142"
    op_type: "Add"
  }
  node {
    input: "239"
    input: "bert.encoder.layer.1.attention.self.query.weight_transposed"
    output: "241"
    name: "MatMul_144"
    op_type: "MatMul"
  }
  node {
    input: "241"
    input: "bert.encoder.layer.1.attention.self.query.bias"
    output: "242"
    name: "Add_145"
    op_type: "Add"
  }
  node {
    input: "239"
    input: "bert.encoder.layer.1.attention.self.key.weight_transposed"
    output: "244"
    name: "MatMul_147"
    op_type: "MatMul"
  }
  node {
    input: "244"
    input: "bert.encoder.layer.1.attention.self.key.bias"
    output: "245"
    name: "Add_148"
    op_type: "Add"
  }
  node {
    input: "239"
    input: "bert.encoder.layer.1.attention.self.value.weight_transposed"
    output: "247"
    name: "MatMul_150"
    op_type: "MatMul"
  }
  node {
    input: "247"
    input: "bert.encoder.layer.1.attention.self.value.bias"
    output: "248"
    name: "Add_151"
    op_type: "Add"
  }
  node {
    input: "242"
    input: "concat_shape_4"
    output: "262"
    name: "Reshape_165"
    op_type: "Reshape"
  }
  node {
    input: "262"
    output: "263"
    name: "Transpose_166"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "245"
    input: "concat_shape_5"
    output: "277"
    name: "Reshape_180"
    op_type: "Reshape"
  }
  node {
    input: "248"
    input: "concat_shape_6"
    output: "291"
    name: "Reshape_194"
    op_type: "Reshape"
  }
  node {
    input: "291"
    output: "292"
    name: "Transpose_195"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "277"
    output: "293"
    name: "Transpose_196"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 3
      ints: 1
      type: INTS
    }
  }
  node {
    input: "263"
    input: "293"
    output: "294"
    name: "MatMul_197"
    op_type: "MatMul"
  }
  node {
    output: "295"
    name: "Constant_198"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\363\0045@"
      }
      type: TENSOR
    }
  }
  node {
    input: "294"
    input: "295"
    output: "296"
    name: "Div_199"
    op_type: "Div"
  }
  node {
    input: "296"
    input: "103"
    output: "297"
    name: "Add_200"
    op_type: "Add"
  }
  node {
    input: "297"
    output: "298"
    name: "Softmax_201"
    op_type: "Softmax"
    attribute {
      name: "axis"
      i: 3
      type: INT
    }
  }
  node {
    input: "298"
    input: "292"
    output: "299"
    name: "MatMul_202"
    op_type: "MatMul"
  }
  node {
    input: "299"
    output: "300"
    name: "Transpose_203"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "300"
    input: "concat_shape_7"
    output: "312"
    name: "Reshape_215"
    op_type: "Reshape"
  }
  node {
    input: "312"
    input: "bert.encoder.layer.1.attention.output.dense.weight_transposed"
    output: "314"
    name: "MatMul_217"
    op_type: "MatMul"
  }
  node {
    input: "314"
    input: "bert.encoder.layer.1.attention.output.dense.bias"
    output: "315"
    name: "Add_218"
    op_type: "Add"
  }
  node {
    input: "315"
    input: "239"
    output: "316"
    name: "Add_219"
    op_type: "Add"
  }
  node {
    input: "316"
    output: "317"
    name: "ReduceMean_220"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "316"
    input: "317"
    output: "318"
    name: "Sub_221"
    op_type: "Sub"
  }
  node {
    output: "319"
    name: "Constant_222"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "318"
    input: "319"
    output: "320"
    name: "Pow_223"
    op_type: "Pow"
  }
  node {
    input: "320"
    output: "321"
    name: "ReduceMean_224"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "316"
    input: "317"
    output: "322"
    name: "Sub_225"
    op_type: "Sub"
  }
  node {
    output: "323"
    name: "Constant_226"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\314\274\214+"
      }
      type: TENSOR
    }
  }
  node {
    input: "321"
    input: "323"
    output: "324"
    name: "Add_227"
    op_type: "Add"
  }
  node {
    input: "324"
    output: "325"
    name: "Sqrt_228"
    op_type: "Sqrt"
  }
  node {
    input: "322"
    input: "325"
    output: "326"
    name: "Div_229"
    op_type: "Div"
  }
  node {
    input: "bert.encoder.layer.1.attention.output.LayerNorm.weight"
    input: "326"
    output: "327"
    name: "Mul_230"
    op_type: "Mul"
  }
  node {
    input: "327"
    input: "bert.encoder.layer.1.attention.output.LayerNorm.bias"
    output: "328"
    name: "Add_231"
    op_type: "Add"
  }
  node {
    input: "328"
    input: "bert.encoder.layer.1.intermediate.dense.weight_transposed"
    output: "330"
    name: "MatMul_233"
    op_type: "MatMul"
  }
  node {
    input: "330"
    input: "bert.encoder.layer.1.intermediate.dense.bias"
    output: "331"
    name: "Add_234"
    op_type: "Add"
  }
  node {
    output: "332"
    name: "Constant_235"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000?"
      }
      type: TENSOR
    }
  }
  node {
    input: "331"
    input: "332"
    output: "333"
    name: "Mul_236"
    op_type: "Mul"
  }
  node {
    output: "334"
    name: "Constant_237"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\363\004\265?"
      }
      type: TENSOR
    }
  }
  node {
    input: "331"
    input: "334"
    output: "335"
    name: "Div_238"
    op_type: "Div"
  }
  node {
    input: "335"
    output: "336"
    name: "Erf_239"
    op_type: "Erf"
  }
  node {
    output: "337"
    name: "Constant_240"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "336"
    input: "337"
    output: "338"
    name: "Add_241"
    op_type: "Add"
  }
  node {
    input: "333"
    input: "338"
    output: "339"
    name: "Mul_242"
    op_type: "Mul"
  }
  node {
    input: "339"
    input: "bert.encoder.layer.1.output.dense.weight_transposed"
    output: "341"
    name: "MatMul_244"
    op_type: "MatMul"
  }
  node {
    input: "341"
    input: "bert.encoder.layer.1.output.dense.bias"
    output: "342"
    name: "Add_245"
    op_type: "Add"
  }
  node {
    input: "342"
    input: "328"
    output: "343"
    name: "Add_246"
    op_type: "Add"
  }
  node {
    input: "343"
    output: "344"
    name: "ReduceMean_247"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "343"
    input: "344"
    output: "345"
    name: "Sub_248"
    op_type: "Sub"
  }
  node {
    output: "346"
    name: "Constant_249"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "345"
    input: "346"
    output: "347"
    name: "Pow_250"
    op_type: "Pow"
  }
  node {
    input: "347"
    output: "348"
    name: "ReduceMean_251"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "343"
    input: "344"
    output: "349"
    name: "Sub_252"
    op_type: "Sub"
  }
  node {
    output: "350"
    name: "Constant_253"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\314\274\214+"
      }
      type: TENSOR
    }
  }
  node {
    input: "348"
    input: "350"
    output: "351"
    name: "Add_254"
    op_type: "Add"
  }
  node {
    input: "351"
    output: "352"
    name: "Sqrt_255"
    op_type: "Sqrt"
  }
  node {
    input: "349"
    input: "352"
    output: "353"
    name: "Div_256"
    op_type: "Div"
  }
  node {
    input: "bert.encoder.layer.1.output.LayerNorm.weight"
    input: "353"
    output: "354"
    name: "Mul_257"
    op_type: "Mul"
  }
  node {
    input: "354"
    input: "bert.encoder.layer.1.output.LayerNorm.bias"
    output: "355"
    name: "Add_258"
    op_type: "Add"
  }
  node {
    input: "355"
    input: "bert.encoder.layer.2.attention.self.query.weight_transposed"
    output: "357"
    name: "MatMul_260"
    op_type: "MatMul"
  }
  node {
    input: "357"
    input: "bert.encoder.layer.2.attention.self.query.bias"
    output: "358"
    name: "Add_261"
    op_type: "Add"
  }
  node {
    input: "355"
    input: "bert.encoder.layer.2.attention.self.key.weight_transposed"
    output: "360"
    name: "MatMul_263"
    op_type: "MatMul"
  }
  node {
    input: "360"
    input: "bert.encoder.layer.2.attention.self.key.bias"
    output: "361"
    name: "Add_264"
    op_type: "Add"
  }
  node {
    input: "355"
    input: "bert.encoder.layer.2.attention.self.value.weight_transposed"
    output: "363"
    name: "MatMul_266"
    op_type: "MatMul"
  }
  node {
    input: "363"
    input: "bert.encoder.layer.2.attention.self.value.bias"
    output: "364"
    name: "Add_267"
    op_type: "Add"
  }
  node {
    input: "358"
    input: "concat_shape_8"
    output: "378"
    name: "Reshape_281"
    op_type: "Reshape"
  }
  node {
    input: "378"
    output: "379"
    name: "Transpose_282"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "361"
    input: "concat_shape_9"
    output: "393"
    name: "Reshape_296"
    op_type: "Reshape"
  }
  node {
    input: "364"
    input: "concat_shape_10"
    output: "407"
    name: "Reshape_310"
    op_type: "Reshape"
  }
  node {
    input: "407"
    output: "408"
    name: "Transpose_311"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "393"
    output: "409"
    name: "Transpose_312"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 3
      ints: 1
      type: INTS
    }
  }
  node {
    input: "379"
    input: "409"
    output: "410"
    name: "MatMul_313"
    op_type: "MatMul"
  }
  node {
    output: "411"
    name: "Constant_314"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\363\0045@"
      }
      type: TENSOR
    }
  }
  node {
    input: "410"
    input: "411"
    output: "412"
    name: "Div_315"
    op_type: "Div"
  }
  node {
    input: "412"
    input: "103"
    output: "413"
    name: "Add_316"
    op_type: "Add"
  }
  node {
    input: "413"
    output: "414"
    name: "Softmax_317"
    op_type: "Softmax"
    attribute {
      name: "axis"
      i: 3
      type: INT
    }
  }
  node {
    input: "414"
    input: "408"
    output: "415"
    name: "MatMul_318"
    op_type: "MatMul"
  }
  node {
    input: "415"
    output: "416"
    name: "Transpose_319"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "416"
    input: "concat_shape_11"
    output: "428"
    name: "Reshape_331"
    op_type: "Reshape"
  }
  node {
    input: "428"
    input: "bert.encoder.layer.2.attention.output.dense.weight_transposed"
    output: "430"
    name: "MatMul_333"
    op_type: "MatMul"
  }
  node {
    input: "430"
    input: "bert.encoder.layer.2.attention.output.dense.bias"
    output: "431"
    name: "Add_334"
    op_type: "Add"
  }
  node {
    input: "431"
    input: "355"
    output: "432"
    name: "Add_335"
    op_type: "Add"
  }
  node {
    input: "432"
    output: "433"
    name: "ReduceMean_336"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "432"
    input: "433"
    output: "434"
    name: "Sub_337"
    op_type: "Sub"
  }
  node {
    output: "435"
    name: "Constant_338"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "434"
    input: "435"
    output: "436"
    name: "Pow_339"
    op_type: "Pow"
  }
  node {
    input: "436"
    output: "437"
    name: "ReduceMean_340"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "432"
    input: "433"
    output: "438"
    name: "Sub_341"
    op_type: "Sub"
  }
  node {
    output: "439"
    name: "Constant_342"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\314\274\214+"
      }
      type: TENSOR
    }
  }
  node {
    input: "437"
    input: "439"
    output: "440"
    name: "Add_343"
    op_type: "Add"
  }
  node {
    input: "440"
    output: "441"
    name: "Sqrt_344"
    op_type: "Sqrt"
  }
  node {
    input: "438"
    input: "441"
    output: "442"
    name: "Div_345"
    op_type: "Div"
  }
  node {
    input: "bert.encoder.layer.2.attention.output.LayerNorm.weight"
    input: "442"
    output: "443"
    name: "Mul_346"
    op_type: "Mul"
  }
  node {
    input: "443"
    input: "bert.encoder.layer.2.attention.output.LayerNorm.bias"
    output: "444"
    name: "Add_347"
    op_type: "Add"
  }
  node {
    input: "444"
    input: "bert.encoder.layer.2.intermediate.dense.weight_transposed"
    output: "446"
    name: "MatMul_349"
    op_type: "MatMul"
  }
  node {
    input: "446"
    input: "bert.encoder.layer.2.intermediate.dense.bias"
    output: "447"
    name: "Add_350"
    op_type: "Add"
  }
  node {
    output: "448"
    name: "Constant_351"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000?"
      }
      type: TENSOR
    }
  }
  node {
    input: "447"
    input: "448"
    output: "449"
    name: "Mul_352"
    op_type: "Mul"
  }
  node {
    output: "450"
    name: "Constant_353"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\363\004\265?"
      }
      type: TENSOR
    }
  }
  node {
    input: "447"
    input: "450"
    output: "451"
    name: "Div_354"
    op_type: "Div"
  }
  node {
    input: "451"
    output: "452"
    name: "Erf_355"
    op_type: "Erf"
  }
  node {
    output: "453"
    name: "Constant_356"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "452"
    input: "453"
    output: "454"
    name: "Add_357"
    op_type: "Add"
  }
  node {
    input: "449"
    input: "454"
    output: "455"
    name: "Mul_358"
    op_type: "Mul"
  }
  node {
    input: "455"
    input: "bert.encoder.layer.2.output.dense.weight_transposed"
    output: "457"
    name: "MatMul_360"
    op_type: "MatMul"
  }
  node {
    input: "457"
    input: "bert.encoder.layer.2.output.dense.bias"
    output: "458"
    name: "Add_361"
    op_type: "Add"
  }
  node {
    input: "458"
    input: "444"
    output: "459"
    name: "Add_362"
    op_type: "Add"
  }
  node {
    input: "459"
    output: "460"
    name: "ReduceMean_363"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "459"
    input: "460"
    output: "461"
    name: "Sub_364"
    op_type: "Sub"
  }
  node {
    output: "462"
    name: "Constant_365"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "461"
    input: "462"
    output: "463"
    name: "Pow_366"
    op_type: "Pow"
  }
  node {
    input: "463"
    output: "464"
    name: "ReduceMean_367"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "459"
    input: "460"
    output: "465"
    name: "Sub_368"
    op_type: "Sub"
  }
  node {
    output: "466"
    name: "Constant_369"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\314\274\214+"
      }
      type: TENSOR
    }
  }
  node {
    input: "464"
    input: "466"
    output: "467"
    name: "Add_370"
    op_type: "Add"
  }
  node {
    input: "467"
    output: "468"
    name: "Sqrt_371"
    op_type: "Sqrt"
  }
  node {
    input: "465"
    input: "468"
    output: "469"
    name: "Div_372"
    op_type: "Div"
  }
  node {
    input: "bert.encoder.layer.2.output.LayerNorm.weight"
    input: "469"
    output: "470"
    name: "Mul_373"
    op_type: "Mul"
  }
  node {
    input: "470"
    input: "bert.encoder.layer.2.output.LayerNorm.bias"
    output: "471"
    name: "Add_374"
    op_type: "Add"
  }
  node {
    input: "471"
    input: "bert.encoder.layer.3.attention.self.query.weight_transposed"
    output: "473"
    name: "MatMul_376"
    op_type: "MatMul"
  }
  node {
    input: "473"
    input: "bert.encoder.layer.3.attention.self.query.bias"
    output: "474"
    name: "Add_377"
    op_type: "Add"
  }
  node {
    input: "471"
    input: "bert.encoder.layer.3.attention.self.key.weight_transposed"
    output: "476"
    name: "MatMul_379"
    op_type: "MatMul"
  }
  node {
    input: "476"
    input: "bert.encoder.layer.3.attention.self.key.bias"
    output: "477"
    name: "Add_380"
    op_type: "Add"
  }
  node {
    input: "471"
    input: "bert.encoder.layer.3.attention.self.value.weight_transposed"
    output: "479"
    name: "MatMul_382"
    op_type: "MatMul"
  }
  node {
    input: "479"
    input: "bert.encoder.layer.3.attention.self.value.bias"
    output: "480"
    name: "Add_383"
    op_type: "Add"
  }
  node {
    input: "474"
    input: "concat_shape_12"
    output: "494"
    name: "Reshape_397"
    op_type: "Reshape"
  }
  node {
    input: "494"
    output: "495"
    name: "Transpose_398"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "477"
    input: "concat_shape_13"
    output: "509"
    name: "Reshape_412"
    op_type: "Reshape"
  }
  node {
    input: "480"
    input: "concat_shape_14"
    output: "523"
    name: "Reshape_426"
    op_type: "Reshape"
  }
  node {
    input: "523"
    output: "524"
    name: "Transpose_427"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "509"
    output: "525"
    name: "Transpose_428"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 3
      ints: 1
      type: INTS
    }
  }
  node {
    input: "495"
    input: "525"
    output: "526"
    name: "MatMul_429"
    op_type: "MatMul"
  }
  node {
    output: "527"
    name: "Constant_430"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\363\0045@"
      }
      type: TENSOR
    }
  }
  node {
    input: "526"
    input: "527"
    output: "528"
    name: "Div_431"
    op_type: "Div"
  }
  node {
    input: "528"
    input: "103"
    output: "529"
    name: "Add_432"
    op_type: "Add"
  }
  node {
    input: "529"
    output: "530"
    name: "Softmax_433"
    op_type: "Softmax"
    attribute {
      name: "axis"
      i: 3
      type: INT
    }
  }
  node {
    input: "530"
    input: "524"
    output: "531"
    name: "MatMul_434"
    op_type: "MatMul"
  }
  node {
    input: "531"
    output: "532"
    name: "Transpose_435"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "532"
    input: "concat_shape_15"
    output: "544"
    name: "Reshape_447"
    op_type: "Reshape"
  }
  node {
    input: "544"
    input: "bert.encoder.layer.3.attention.output.dense.weight_transposed"
    output: "546"
    name: "MatMul_449"
    op_type: "MatMul"
  }
  node {
    input: "546"
    input: "bert.encoder.layer.3.attention.output.dense.bias"
    output: "547"
    name: "Add_450"
    op_type: "Add"
  }
  node {
    input: "547"
    input: "471"
    output: "548"
    name: "Add_451"
    op_type: "Add"
  }
  node {
    input: "548"
    output: "549"
    name: "ReduceMean_452"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "548"
    input: "549"
    output: "550"
    name: "Sub_453"
    op_type: "Sub"
  }
  node {
    output: "551"
    name: "Constant_454"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "550"
    input: "551"
    output: "552"
    name: "Pow_455"
    op_type: "Pow"
  }
  node {
    input: "552"
    output: "553"
    name: "ReduceMean_456"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "548"
    input: "549"
    output: "554"
    name: "Sub_457"
    op_type: "Sub"
  }
  node {
    output: "555"
    name: "Constant_458"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\314\274\214+"
      }
      type: TENSOR
    }
  }
  node {
    input: "553"
    input: "555"
    output: "556"
    name: "Add_459"
    op_type: "Add"
  }
  node {
    input: "556"
    output: "557"
    name: "Sqrt_460"
    op_type: "Sqrt"
  }
  node {
    input: "554"
    input: "557"
    output: "558"
    name: "Div_461"
    op_type: "Div"
  }
  node {
    input: "bert.encoder.layer.3.attention.output.LayerNorm.weight"
    input: "558"
    output: "559"
    name: "Mul_462"
    op_type: "Mul"
  }
  node {
    input: "559"
    input: "bert.encoder.layer.3.attention.output.LayerNorm.bias"
    output: "560"
    name: "Add_463"
    op_type: "Add"
  }
  node {
    input: "560"
    input: "bert.encoder.layer.3.intermediate.dense.weight_transposed"
    output: "562"
    name: "MatMul_465"
    op_type: "MatMul"
  }
  node {
    input: "562"
    input: "bert.encoder.layer.3.intermediate.dense.bias"
    output: "563"
    name: "Add_466"
    op_type: "Add"
  }
  node {
    output: "564"
    name: "Constant_467"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000?"
      }
      type: TENSOR
    }
  }
  node {
    input: "563"
    input: "564"
    output: "565"
    name: "Mul_468"
    op_type: "Mul"
  }
  node {
    output: "566"
    name: "Constant_469"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\363\004\265?"
      }
      type: TENSOR
    }
  }
  node {
    input: "563"
    input: "566"
    output: "567"
    name: "Div_470"
    op_type: "Div"
  }
  node {
    input: "567"
    output: "568"
    name: "Erf_471"
    op_type: "Erf"
  }
  node {
    output: "569"
    name: "Constant_472"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "568"
    input: "569"
    output: "570"
    name: "Add_473"
    op_type: "Add"
  }
  node {
    input: "565"
    input: "570"
    output: "571"
    name: "Mul_474"
    op_type: "Mul"
  }
  node {
    input: "571"
    input: "bert.encoder.layer.3.output.dense.weight_transposed"
    output: "573"
    name: "MatMul_476"
    op_type: "MatMul"
  }
  node {
    input: "573"
    input: "bert.encoder.layer.3.output.dense.bias"
    output: "574"
    name: "Add_477"
    op_type: "Add"
  }
  node {
    input: "574"
    input: "560"
    output: "575"
    name: "Add_478"
    op_type: "Add"
  }
  node {
    input: "575"
    output: "576"
    name: "ReduceMean_479"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "575"
    input: "576"
    output: "577"
    name: "Sub_480"
    op_type: "Sub"
  }
  node {
    output: "578"
    name: "Constant_481"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "577"
    input: "578"
    output: "579"
    name: "Pow_482"
    op_type: "Pow"
  }
  node {
    input: "579"
    output: "580"
    name: "ReduceMean_483"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "575"
    input: "576"
    output: "581"
    name: "Sub_484"
    op_type: "Sub"
  }
  node {
    output: "582"
    name: "Constant_485"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\314\274\214+"
      }
      type: TENSOR
    }
  }
  node {
    input: "580"
    input: "582"
    output: "583"
    name: "Add_486"
    op_type: "Add"
  }
  node {
    input: "583"
    output: "584"
    name: "Sqrt_487"
    op_type: "Sqrt"
  }
  node {
    input: "581"
    input: "584"
    output: "585"
    name: "Div_488"
    op_type: "Div"
  }
  node {
    input: "bert.encoder.layer.3.output.LayerNorm.weight"
    input: "585"
    output: "586"
    name: "Mul_489"
    op_type: "Mul"
  }
  node {
    input: "586"
    input: "bert.encoder.layer.3.output.LayerNorm.bias"
    output: "587"
    name: "Add_490"
    op_type: "Add"
  }
  node {
    input: "587"
    input: "bert.encoder.layer.4.attention.self.query.weight_transposed"
    output: "589"
    name: "MatMul_492"
    op_type: "MatMul"
  }
  node {
    input: "589"
    input: "bert.encoder.layer.4.attention.self.query.bias"
    output: "590"
    name: "Add_493"
    op_type: "Add"
  }
  node {
    input: "587"
    input: "bert.encoder.layer.4.attention.self.key.weight_transposed"
    output: "592"
    name: "MatMul_495"
    op_type: "MatMul"
  }
  node {
    input: "592"
    input: "bert.encoder.layer.4.attention.self.key.bias"
    output: "593"
    name: "Add_496"
    op_type: "Add"
  }
  node {
    input: "587"
    input: "bert.encoder.layer.4.attention.self.value.weight_transposed"
    output: "595"
    name: "MatMul_498"
    op_type: "MatMul"
  }
  node {
    input: "595"
    input: "bert.encoder.layer.4.attention.self.value.bias"
    output: "596"
    name: "Add_499"
    op_type: "Add"
  }
  node {
    input: "590"
    input: "concat_shape_16"
    output: "610"
    name: "Reshape_513"
    op_type: "Reshape"
  }
  node {
    input: "610"
    output: "611"
    name: "Transpose_514"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "593"
    input: "concat_shape_17"
    output: "625"
    name: "Reshape_528"
    op_type: "Reshape"
  }
  node {
    input: "596"
    input: "concat_shape_18"
    output: "639"
    name: "Reshape_542"
    op_type: "Reshape"
  }
  node {
    input: "639"
    output: "640"
    name: "Transpose_543"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "625"
    output: "641"
    name: "Transpose_544"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 3
      ints: 1
      type: INTS
    }
  }
  node {
    input: "611"
    input: "641"
    output: "642"
    name: "MatMul_545"
    op_type: "MatMul"
  }
  node {
    output: "643"
    name: "Constant_546"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\363\0045@"
      }
      type: TENSOR
    }
  }
  node {
    input: "642"
    input: "643"
    output: "644"
    name: "Div_547"
    op_type: "Div"
  }
  node {
    input: "644"
    input: "103"
    output: "645"
    name: "Add_548"
    op_type: "Add"
  }
  node {
    input: "645"
    output: "646"
    name: "Softmax_549"
    op_type: "Softmax"
    attribute {
      name: "axis"
      i: 3
      type: INT
    }
  }
  node {
    input: "646"
    input: "640"
    output: "647"
    name: "MatMul_550"
    op_type: "MatMul"
  }
  node {
    input: "647"
    output: "648"
    name: "Transpose_551"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "648"
    input: "concat_shape_19"
    output: "660"
    name: "Reshape_563"
    op_type: "Reshape"
  }
  node {
    input: "660"
    input: "bert.encoder.layer.4.attention.output.dense.weight_transposed"
    output: "662"
    name: "MatMul_565"
    op_type: "MatMul"
  }
  node {
    input: "662"
    input: "bert.encoder.layer.4.attention.output.dense.bias"
    output: "663"
    name: "Add_566"
    op_type: "Add"
  }
  node {
    input: "663"
    input: "587"
    output: "664"
    name: "Add_567"
    op_type: "Add"
  }
  node {
    input: "664"
    output: "665"
    name: "ReduceMean_568"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "664"
    input: "665"
    output: "666"
    name: "Sub_569"
    op_type: "Sub"
  }
  node {
    output: "667"
    name: "Constant_570"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "666"
    input: "667"
    output: "668"
    name: "Pow_571"
    op_type: "Pow"
  }
  node {
    input: "668"
    output: "669"
    name: "ReduceMean_572"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "664"
    input: "665"
    output: "670"
    name: "Sub_573"
    op_type: "Sub"
  }
  node {
    output: "671"
    name: "Constant_574"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\314\274\214+"
      }
      type: TENSOR
    }
  }
  node {
    input: "669"
    input: "671"
    output: "672"
    name: "Add_575"
    op_type: "Add"
  }
  node {
    input: "672"
    output: "673"
    name: "Sqrt_576"
    op_type: "Sqrt"
  }
  node {
    input: "670"
    input: "673"
    output: "674"
    name: "Div_577"
    op_type: "Div"
  }
  node {
    input: "bert.encoder.layer.4.attention.output.LayerNorm.weight"
    input: "674"
    output: "675"
    name: "Mul_578"
    op_type: "Mul"
  }
  node {
    input: "675"
    input: "bert.encoder.layer.4.attention.output.LayerNorm.bias"
    output: "676"
    name: "Add_579"
    op_type: "Add"
  }
  node {
    input: "676"
    input: "bert.encoder.layer.4.intermediate.dense.weight_transposed"
    output: "678"
    name: "MatMul_581"
    op_type: "MatMul"
  }
  node {
    input: "678"
    input: "bert.encoder.layer.4.intermediate.dense.bias"
    output: "679"
    name: "Add_582"
    op_type: "Add"
  }
  node {
    output: "680"
    name: "Constant_583"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000?"
      }
      type: TENSOR
    }
  }
  node {
    input: "679"
    input: "680"
    output: "681"
    name: "Mul_584"
    op_type: "Mul"
  }
  node {
    output: "682"
    name: "Constant_585"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\363\004\265?"
      }
      type: TENSOR
    }
  }
  node {
    input: "679"
    input: "682"
    output: "683"
    name: "Div_586"
    op_type: "Div"
  }
  node {
    input: "683"
    output: "684"
    name: "Erf_587"
    op_type: "Erf"
  }
  node {
    output: "685"
    name: "Constant_588"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "684"
    input: "685"
    output: "686"
    name: "Add_589"
    op_type: "Add"
  }
  node {
    input: "681"
    input: "686"
    output: "687"
    name: "Mul_590"
    op_type: "Mul"
  }
  node {
    input: "687"
    input: "bert.encoder.layer.4.output.dense.weight_transposed"
    output: "689"
    name: "MatMul_592"
    op_type: "MatMul"
  }
  node {
    input: "689"
    input: "bert.encoder.layer.4.output.dense.bias"
    output: "690"
    name: "Add_593"
    op_type: "Add"
  }
  node {
    input: "690"
    input: "676"
    output: "691"
    name: "Add_594"
    op_type: "Add"
  }
  node {
    input: "691"
    output: "692"
    name: "ReduceMean_595"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "691"
    input: "692"
    output: "693"
    name: "Sub_596"
    op_type: "Sub"
  }
  node {
    output: "694"
    name: "Constant_597"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "693"
    input: "694"
    output: "695"
    name: "Pow_598"
    op_type: "Pow"
  }
  node {
    input: "695"
    output: "696"
    name: "ReduceMean_599"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "691"
    input: "692"
    output: "697"
    name: "Sub_600"
    op_type: "Sub"
  }
  node {
    output: "698"
    name: "Constant_601"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\314\274\214+"
      }
      type: TENSOR
    }
  }
  node {
    input: "696"
    input: "698"
    output: "699"
    name: "Add_602"
    op_type: "Add"
  }
  node {
    input: "699"
    output: "700"
    name: "Sqrt_603"
    op_type: "Sqrt"
  }
  node {
    input: "697"
    input: "700"
    output: "701"
    name: "Div_604"
    op_type: "Div"
  }
  node {
    input: "bert.encoder.layer.4.output.LayerNorm.weight"
    input: "701"
    output: "702"
    name: "Mul_605"
    op_type: "Mul"
  }
  node {
    input: "702"
    input: "bert.encoder.layer.4.output.LayerNorm.bias"
    output: "703"
    name: "Add_606"
    op_type: "Add"
  }
  node {
    output: "704"
    name: "Constant_607"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "703"
    input: "704"
    output: "705"
    name: "Gather_608"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "705"
    input: "bert.pooler.dense.weight"
    input: "bert.pooler.dense.bias"
    output: "706"
    name: "Gemm_609"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1.0
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 1.0
      type: FLOAT
    }
    attribute {
      name: "transB"
      i: 1
      type: INT
    }
  }
  node {
    input: "706"
    output: "707"
    name: "Tanh_610"
    op_type: "Tanh"
  }
  node {
    input: "703"
    input: "cls.predictions.transform.dense.weight_transposed"
    output: "709"
    name: "MatMul_612"
    op_type: "MatMul"
  }
  node {
    input: "709"
