ir_version: 8
producer_name: "onnx-genai tiny-masked-diffusion"
graph {
  node {
    output: "logits"
    name: "fixed_logits"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        dims: 4
        dims: 6
        data_type: 1
        name: "logits_value"
        raw_data: "\000\000\000\000\000\000\000\000\000\000 A\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000A\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\300@\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\200@"
      }
      type: TENSOR
    }
  }
  name: "tiny_masked_diffusion_lm"
  input {
    name: "input_ids"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "logits"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 13
}
