ir_version: 10
graph {
  node {
    output: "logits"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        dims: 1
        dims: 2
        data_type: 1
        float_data: 0.0
        float_data: 1.0
        name: "logits_value"
      }
      type: TENSOR
    }
  }
  node {
    output: "kv_seed"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        dims: 2
        dims: 1
        data_type: 1
        float_data: 0.0
        float_data: 0.0
        name: "kv_seed_value"
      }
      type: TENSOR
    }
  }
  node {
    input: "kv_seed"
    input: "attention_mask"
    output: "present.0.key"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "kv_seed"
    input: "attention_mask"
    output: "present.0.value"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  name: "tiny_native_cuda_engine"
  input {
    name: "input_ids"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "sequence"
          }
        }
      }
    }
  }
  input {
    name: "attention_mask"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "total"
          }
        }
      }
    }
  }
  input {
    name: "position_ids"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "sequence"
          }
        }
      }
    }
  }
  input {
    name: "past_key_values.0.key"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "past"
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "past_key_values.0.value"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "past"
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "logits"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "present.0.key"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "total"
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "present.0.value"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_param: "total"
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 13
}
